{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719114},"publisher-location":"New York, New York, USA","reference-count":40,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186239","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["How to Assess and Rank User-Generated Content on Web"],"prefix":"10.1145","author":[{"given":"Elaheh","family":"Momeni","sequence":"first","affiliation":[{"name":"University of Vienna, Vienna, Austria"}]},{"given":"Claire","family":"Cardie","sequence":"additional","affiliation":[{"name":"Cornell University, Ithaca, NY, USA"}]},{"given":"Nicholas","family":"Diakopoulos","sequence":"additional","affiliation":[{"name":"Northwestern University, Evanston, IL, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186239-1","unstructured":"Fabian Abel, Ilknur Celik, Geert-Jan Houben, and Patrick Siehndel. 2011. Leveraging the Semantics of Tweets for Adaptive Faceted Search on Twitter Proceedings of the 10th International Conference on The Semantic Web - Volume Part I (ISWC'11). Springer-Verlag, Berlin, Heidelberg, 1--17."},{"key":"key-10.1145\/3184558.3186239-2","unstructured":"Jisun An, Meeyoung Cha, Krishna Gummadi, Jon Crowcroft, and Daniele Quercia. 2012. Visualizing Media Bias through Twitter. In Proc. of ICWSM. AAAI."},{"key":"key-10.1145\/3184558.3186239-3","unstructured":"Hila Becker, Dan Iter, Mor Naaman, and Luis Gravano. 2012. Identifying content for planned events across social media sites Proceedings of the fifth ACM international conference on Web search and data mining (WSDM '12). ACM, 10."},{"key":"key-10.1145\/3184558.3186239-4","unstructured":"Hila Becker, Mor Naaman, and Luis Gravano. 2011. Selecting Quality Twitter Content for Events. In ICWSM. The AAAI Press."},{"key":"key-10.1145\/3184558.3186239-5","unstructured":"Michael S. Bernstein, Bongwon Suh, Lichan Hong, Jilin Chen, Sanjay Kairam, and Ed H. Chi. 2010. Eddi: interactive topic-based browsing of social status streams Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, New York, NY, USA, 303--312.","DOI":"10.1145\/1866029.1866077","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-6","unstructured":"Jiang Bian, Yandong Liu, Ding Zhou, Eugene Agichtein, and Hongyuan Zha. 2009. Learning to recognize reliable users and content in social media with coupled mutual reinforcement. In Proceedings of the 18th international conference on World wide web (WWW '09). ACM, New York, NY, USA, 51--60.","DOI":"10.1145\/1526709.1526717","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-7","unstructured":"Matthew Burgess, Alessandra Mazzia, Eytan Adar, and Michael Cafarella. 2013. Leveraging Noisy Lists for Social Feed Ranking. In The 7th International AAAI Conference on Weblogs and Social Media (ICWSM2013). AAAI, Boston, USA."},{"key":"key-10.1145\/3184558.3186239-8","unstructured":"Kevin R. Canini, Bongwon Suh, and Peter L. Pirolli. 2011. Finding Credible Information Sources in Social Networks Based on Content and Social Structure. In 2011 IEEE Third Int'l Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third Int'l Conference on Social Computing.","DOI":"10.1109\/PASSAT\/SocialCom.2011.91","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-9","unstructured":"Carlos Castillo, Marcelo Mendoza, and Barbara Poblete. 2011. Information credibility on twitter. In the 20th international conference (WWW). http:\/\/dx.doi.org\/10.1145\/1963405.1963500","DOI":"10.1145\/1963405.1963500","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-10","unstructured":"Nikan Chavoshi, Hossein Hamooni, and Abdullah Mueen. 2017. Temporal Patterns in Bot Activities. In Proceedings of the 26th International Conference on World Wide Web Companion (WWW '17 Companion).","DOI":"10.1145\/3041021.3051114","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-11","unstructured":"Jilin Chen, Rowan Nairn, and Ed Chi. 2011. Speak Little and Well: Recommending Conversations in Online Social Streams Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA."},{"key":"key-10.1145\/3184558.3186239-12","unstructured":"Cristian Danescu-Niculescu-Mizil, Gueorgi Kossinets, Jon Kleinberg, and Lillian Lee. 2009. How opinions are received by online communities: a case study on amazon.com helpfulness votes. In Proceedings of the 18th international conference on World wide web (WWW '09). 10.","DOI":"10.1145\/1526709.1526729","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-13","unstructured":"Nicholas Diakopoulos, Munmun De Choudhury, and Mor Naaman. 2012. Finding and assessing social media information sources in the context of journalism. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems (CHI '12). ACM, 10.http:\/\/doi.acm.org\/10.1145\/2208276.2208409"},{"key":"key-10.1145\/3184558.3186239-14","unstructured":"Siamak Faridani, Ephrat Bitton, Kimiko Ryokai, and Ken Goldberg. 2010. Opinion Space: A Scalable Tool for Browsing Online Comments Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1175--1184.","DOI":"10.1145\/1753326.1753502","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-15","unstructured":"Emilio Ferrara, Onur Varol, Clayton Davis, Filippo Menczer, and Alessandro Flammini. 2016. The Rise of Social Bots. Commun. ACM Vol. 59, 7 (June. 2016)."},{"key":"key-10.1145\/3184558.3186239-16","unstructured":"Anindya Ghose and Panagiotis G. Ipeirotis. [n. d.]. Estimating the Helpfulness and Economic Impact of Product Reviews: Mining Text and Reviewer Characteristics. IEEE Transactions on Knowledge and Data Engineering Vol. 23, 10 (. [n. d.])."},{"key":"key-10.1145\/3184558.3186239-17","unstructured":"Arpita Ghosh and Patrick Hummel. 2012. Implementing optimal outcomes in social computing: a game-theoretic approach Proceedings of the 21st international conference on World Wide Web (WWW '12). ACM, New York, NY, USA, 10.","DOI":"10.1145\/2187836.2187910","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-18","unstructured":"Giorgos Giannopoulos, Ingmar Weber, Alejandro Jaimes, and Timos Sellis. 2012. Diversifying User Comments on News Articles. Vol. 7651 (2012), 100--113."},{"key":"key-10.1145\/3184558.3186239-19","unstructured":"F. Maxwell Harper, Daniel Moy, and Joseph A. Konstan. 2009. Facts or friends: distinguishing informational and conversational questions in social Q&#38;A sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.","DOI":"10.1145\/1518701.1518819","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-20","unstructured":"Liangjie Hong, Ovidiu Dan, and Brian D. Davison. 2011. Predicting popular messages in Twitter. In Proceedings of the 20th international conference companion on World wide web (WWW '11). ACM, New York, NY, USA, 57--58.","DOI":"10.1145\/1963192.1963222","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-21","unstructured":"Chiao-Fang Hsu, Elham Khabiri, and James Caverlee. [n. d.]. Ranking Comments on the Social Web. In Proceedings of the 2009 International Conference on Computational Science and Engineering - Volume 04. IEEE Computer Society, Washington, DC, USA.","DOI":"10.1109\/CSE.2009.109","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-22","unstructured":"Yuheng Hu, Shelly Diane Farnham, and Andr&#233;s Monroy-Hern&#225;ndez. 2013. Whoo.ly: facilitating information seeking for hyperlocal communities using social media. In CHI."},{"key":"key-10.1145\/3184558.3186239-23","unstructured":"Travis Kriplean, Jonathan Morgan, Deen Freelon, Alan Borning, and Lance Bennett. 2012. Supporting Reflective Public Thought with Considerit Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 265--274."},{"key":"key-10.1145\/3184558.3186239-24","unstructured":"Baoli Li, Yandong Liu, and Eugene Agichtein. 2008. CoCQA: co-training over questions and answers with an application to predicting question subjectivity orientation. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP '08). Association for Computational Linguistics, Stroudsburg, PA, USA.","DOI":"10.3115\/1613715.1613836","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-25","unstructured":"Jiwei Li, Myle Ott, Claire Cardie, and Eduard Hovy. [n. d.]. In Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, 1566--1576."},{"key":"key-10.1145\/3184558.3186239-26","unstructured":"Q. Vera Liao and Wai-Tat Fu. 2013. Beyond the Filter Bubble: Interactive Effects of Perceived Threat and Topic Involvement on Selective Exposure to Information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2359--2368.","DOI":"10.1145\/2470654.2481326","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-27","unstructured":"Ee-Peng Lim, Viet-An Nguyen, Nitin Jindal, Bing Liu, and Hady Wirawan Lauw. 2010. Detecting Product Review Spammers Using Rating Behaviors Proceedings of the 19th ACM International Conference on Information and Knowledge Management (CIKM '10). 939--948."},{"key":"key-10.1145\/3184558.3186239-28","unstructured":"Jingjing Liu, Yunbo Cao, Chin Y. Lin, Yalou Huang, and Ming Zhou. 2007. Low-Quality Product Review Detection in Opinion Summarization Proceedings of the 2007 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning (EMNLP-CoNLL)."},{"key":"key-10.1145\/3184558.3186239-29","unstructured":"Yue Lu, Panayiotis Tsaparas, Alexandros Ntoulas, and Livia Polanyi. 2010. Exploiting social context for review quality prediction Proceedings of the 19th international conference on World wide web (WWW '10). 10."},{"key":"key-10.1145\/3184558.3186239-30","unstructured":"Elaheh Momeni, Claire Cardie, and Nicholas Diakopoulos. [n. d.]. A Survey on Assessment and Ranking Methodologies for User-Generated Content on the Web. ACM Comput. Surv. (. [n. d.])."},{"key":"key-10.1145\/3184558.3186239-31","unstructured":"Elaheh Momeni, Claire Cardie, and Myle Ott. 2013. Properties, Prediction, and Prevalence of Useful User-generated Comments for Descriptive Annotation of Social Media Objects. In The 7th International AAAI Conference on Weblogs and Social Media (ICWSM2013). AAAI, Boston, USA."},{"key":"key-10.1145\/3184558.3186239-32","unstructured":"Elaheh Momeni, Reza Rawassizadeh, and Eytan Adar. 2017. Leveraging Semantic Facets for Adaptive Ranking of Social Comments Proceedings of the 2017 ACM on International Conference on Multimedia Retrieval (ICMR '17)."},{"key":"key-10.1145\/3184558.3186239-33","unstructured":"Lev Muchnik, Sinan Aral, and Sean J. Taylor. 2013. Social Influence Bias: A Randomized Experiment. Science Vol. 341, 6146 (09 Aug. 2013), 647--651.","DOI":"10.1126\/science.1240466","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-34","unstructured":"Sean A. Munson, Stephanie Y. Lee, and Paul Resnick. 2013. Encouraging Reading of Diverse Political Viewpoints with a Browser Widget. ICWSM, Emre Kiciman, Nicole B. Ellison, Bernie Hogan, Paul Resnick, and Ian Soboroff (Eds.). The AAAI Press. http:\/\/dblp.uni-trier.de\/db\/conf\/icwsm\/icwsm2013.html#MunsonLR13"},{"key":"key-10.1145\/3184558.3186239-35","unstructured":"Sean A. Munson and Paul Resnick. 2010. Presenting Diverse Political Opinions: How and How Much Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1457--1466.","DOI":"10.1145\/1753326.1753543","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-36","unstructured":"Myle Ott, Claire Cardie, and Jeff Hancock. 2012. Estimating the prevalence of deception in online review communities Proceedings of the 21st international conference on World Wide Web (WWW '12). ACM, New York, NY, USA, 201--210."},{"key":"key-10.1145\/3184558.3186239-37","unstructured":"Tim Paek, Michael Gamon, Scott Counts, David Maxwell Chickering, and Aman Dhesi. 2010. Predicting the Importance of Newsfeed Posts and Social Network Friends. AAAI. AAAI Press."},{"key":"key-10.1145\/3184558.3186239-38","unstructured":"Matthew Rowe, Sofia Angeletou, and Harith Alani. 2011. Predicting Discussions on the Social Semantic Web. In Extended Semantic Web Conference.","DOI":"10.1007\/978-3-642-21064-8_28","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186239-39","unstructured":"Kai Shu, Amy Sliva, Suhang Wang, Jiliang Tang, and Huan Liu. 2017. Fake News Detection on Social Media: A Data Mining Perspective. SIGKDD Explor. Newsl. Vol. 19, 1 (Sept. 2017), 22--36. W. Bruce Croft. 2011. User oriented tweet ranking: a filtering approach to microblogs. CIKM, Craig Macdonald, Iadh Ounis, and Ian Ruthven (Eds.). ACM, 2261--2264. http:\/\/dblp.uni-trier.de\/db\/conf\/cikm\/cikm2011.html#UysalC11"},{"key":"key-10.1145\/3184558.3186239-40","unstructured":"Claudia Wagner, Matthew Rowe, Markus Strohmaier, and Harith Alani. 2012. What Catches Your Attention An Empirical Study of Attention Patterns in Community Forums. In ICWSM."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186239&ftid=1958250&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T19:15:30Z","timestamp":1524078930000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":40,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186239","relation":{"cites":[]}}}