{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:58:52Z","timestamp":1523998732212},"publisher-location":"New York, New York, USA","reference-count":42,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186051","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Multi-instance Domain Adaptation for Vaccine Adverse Event Detection"],"prefix":"10.1145","author":[{"given":"Junxiang","family":"Wang","sequence":"first","affiliation":[{"name":"George Mason University, Fairfax, VA, USA"}]},{"given":"Liang","family":"Zhao","sequence":"additional","affiliation":[{"name":"George Mason University, Fairfax, VA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186051-1","unstructured":"Jaume Amores. Multiple instance classification: Review, taxonomy and comparative study. Artificial Intelligence, 201(4):81--105, 2013.","DOI":"10.1016\/j.artint.2013.06.003","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-2","unstructured":"Stuart Andrews, Ioannis Tsochantaridis, and Thomas Hofmann. Support vector machines for multiple-instance learning. Advances in Neural Information Processing Systems, 15(2):561--568, 2002."},{"key":"key-10.1145\/3178876.3186051-3","unstructured":"Amir Beck and Marc Teboulle. A fast iterative shrinkage-thresholding algorithm for linear inverse problems. SIAM journal on imaging sciences, 2(1):183--202, 2009.","DOI":"10.1137\/080716542","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-4","unstructured":"Stephen Boyd, Neal Parikh, Eric Chu, Borja Peleato, and Jonathan Eckstein. Distributed optimization and statistical learning via the alternating direction method of multipliers. Foundations and Trends&#174; in Machine Learning, 3(1):1--122, 2011."},{"key":"key-10.1145\/3178876.3186051-5","unstructured":"Rita Chattopadhyay, Qian Sun, Wei Fan, Ian Davidson, Sethuraman Panchanathan, and Jieping Ye. Multisource domain adaptation and its application to early detection of fatigue. ACM Transactions on Knowledge Discovery from Data (TKDD), 6(4):18, 2012.","DOI":"10.1145\/2382577.2382582","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-6","unstructured":"Liangzhe Chen, K. S. M. Tozammel Hossain, Patrick Butler, Naren Ramakrishnan, and B. Aditya Prakash. Flu gone viral: Syndromic surveillance of flu on twitter using temporal topic models. In IEEE International Conference on Data Mining, pages 755--760, 2014."},{"key":"key-10.1145\/3178876.3186051-7","unstructured":"Hal Daum&#233; III. Frustratingly easy domain adaptation. arXiv preprint arXiv:0907.1815, 2009."},{"key":"key-10.1145\/3178876.3186051-8","unstructured":"Thomas G Dietterich, Richard H Lathrop, and Tom&#225;s Lozano-P&#233;rez. Solving the multiple instance problem with axis-parallel rectangles. Artificial intelligence, 89(1--2):31--71, 1997."},{"key":"key-10.1145\/3178876.3186051-9","unstructured":"Lixin Duan, Ivor W Tsang, and Dong Xu. Domain transfer multiple kernel learning. IEEE Transactions on Pattern Analysis and Machine Intelligence, 34(3):465-- 479, 2012.","DOI":"10.1109\/TPAMI.2011.114","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-10","unstructured":"Lixin Duan, Dong Xu, and Ivor Tsang. Learning with augmented features for heterogeneous domain adaptation. arXiv preprint arXiv:1206.4660, 2012."},{"key":"key-10.1145\/3178876.3186051-11","unstructured":"Fran&#231;ois Fleuret and Hichem Sahbi. Scale-invariance of support vector machines based on the triangular kernel. In 3rd International Workshop on Statistical and Computational Theories of Vision, pages 1--13, 2003."},{"key":"key-10.1145\/3178876.3186051-12","unstructured":"Zhouyu Fu and Antonio Robles-Kelly. An instance selection approach to multiple instance learning. In Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on, pages 911--918. IEEE, 2009.","DOI":"10.1109\/CVPR.2009.5206655","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-13","unstructured":"Mingyi Hong, Zhi-Quan Luo, and Meisam Razaviyayn. Convergence analysis of alternating direction method of multipliers for a family of nonconvex problems. SIAM Journal on Optimization, 26(1):337--364, 2016.","DOI":"10.1137\/140990309","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-14","unstructured":"Hayate Iso, Shoko Wakamiya, and Eiji Aramaki. Forecasting word model: Twitterbased influenza surveillance and prediction. In COLING, pages 76--86, 2016."},{"key":"key-10.1145\/3178876.3186051-15","unstructured":"L. K. Real-time disease surveillance using twitter data: demonstration on flu and cancer. In ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, pages 1474--1477, 2013."},{"key":"key-10.1145\/3178876.3186051-16","unstructured":"Shehroz S Khan and Michael G Madden. A survey of recent trends in one class classification. In Irish Conference on Artificial Intelligence and Cognitive Science, pages 188--197. Springer, 2009."},{"key":"key-10.1145\/3178876.3186051-17","unstructured":"Brian Kulis, Kate Saenko, and Trevor Darrell. What you saw is not what you get: Domain adaptation using asymmetric kernel transforms. In Computer Vision and Pattern Recognition (CVPR), 2011 IEEE Conference on, pages 1785--1792. IEEE, 2011."},{"key":"key-10.1145\/3178876.3186051-18","unstructured":"Anurag Kumar and Bhiksha Raj. Audio event detection using weakly labeled data. In Proceedings of the 2016 ACM on Multimedia Conference, pages 1038--1047. ACM, 2016.","DOI":"10.1145\/2964284.2964310","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-19","unstructured":"Alex Lamb, Michael J Paul, and Mark Dredze. Separating fact from fear: Tracking flu infections on twitter. In HLT-NAACL, pages 789--795, 2013."},{"key":"key-10.1145\/3178876.3186051-20","unstructured":"Vasileios Lampos, Tijl De Bie, and Nello Cristianini. Flu detector-tracking epidemics on twitter. In Joint European Conference on Machine Learning and Knowledge Discovery in Databases, pages 599--602. Springer, 2010.","DOI":"10.1007\/978-3-642-15939-8_42","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-21","unstructured":"Thomas Lipp and Stephen Boyd. Variations and extension of the convex--concave procedure. Optimization and Engineering, 17(2):263--287, 2016.","DOI":"10.1007\/s11081-015-9294-x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-22","unstructured":"Mingsheng Long, Jianmin Wang, Guiguang Ding, Sinno Jialin Pan, and S Yu Philip. Adaptation regularization: A general framework for transfer learning. IEEE Transactions on Knowledge and Data Engineering, 26(5):1076--1089, 2014.","DOI":"10.1109\/TKDE.2013.111","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-23","unstructured":"Mingsheng Long, Jianmin Wang, Guiguang Ding, Dou Shen, and Qiang Yang. Transfer learning with graph co-regularization. IEEE Transactions on Knowledge and Data Engineering, 26(7):1805--1818, 2014.","DOI":"10.1109\/TKDE.2013.97","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-24","unstructured":"Mingsheng Long, Jianmin Wang, Guiguang Ding, Jiaguang Sun, and Philip S Yu. Transfer feature learning with joint distribution adaptation. In Proceedings of the IEEE international conference on computer vision, pages 2200--2207, 2013.","DOI":"10.1109\/ICCV.2013.274","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-25","unstructured":"Alejandro Metke-Jimenez, Sarvnaz Karimi, and Cecile Paris. Evaluation of textprocessing algorithms for adverse drug event extraction from social media. In International Workshop on Social Media Retrieval and Analysis, pages 15--20, 2014."},{"key":"key-10.1145\/3178876.3186051-26","unstructured":"Sinno Jialin Pan, Xiaochuan Ni, Jian-Tao Sun, Qiang Yang, and Zheng Chen. Crossdomain sentiment classification via spectral feature alignment. In Proceedings of the 19th international conference on World wide web, pages 751--760. ACM, 2010."},{"key":"key-10.1145\/3178876.3186051-27","unstructured":"Sinno Jialin Pan and Qiang Yang. A survey on transfer learning. IEEE Transactions on knowledge and data engineering, 22(10):1345--1359, 2010.","DOI":"10.1109\/TKDE.2009.191","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-28","unstructured":"Michael J Paul and Mark Dredze. You are what you tweet: Analyzing twitter for public health. Icwsm, 20:265--272, 2011."},{"key":"key-10.1145\/3178876.3186051-29","unstructured":"Duda Ro and Hart Pe. Pattern classification and scene analysis. 1973."},{"key":"key-10.1145\/3178876.3186051-30","unstructured":"Alessio Signorini, Alberto Maria Segre, and Philip M Polgreen. The use of twitter to track levels of disease activity and public concern in the us during the influenza a h1n1 pandemic. PloS one, 6(5):e19467, 2011.","DOI":"10.1371\/journal.pone.0019467","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-31","unstructured":"Vladimir Naumovich Vapnik and Vlamimir Vapnik. Statistical learning theory, volume 1. Wiley New York, 1998."},{"key":"key-10.1145\/3178876.3186051-32","unstructured":"Ke Wang, Jiayong Liu, and Daniel Gonz&#225;lez. Domain transfer multi-instance dictionary learning. Neural Computing and Applications, pages 1--10, 2016."},{"key":"key-10.1145\/3178876.3186051-33","unstructured":"Qifan Wang, Lingyun Ruan, and Luo Si. Adaptive knowledge transfer for multiple instance learning in image classification. In AAAI, pages 1334--1340, 2014."},{"key":"key-10.1145\/3178876.3186051-34","unstructured":"Yu Wang, Wotao Yin, and Jinshan Zeng. Global convergence of admm in nonconvex nonsmooth optimization. arXiv preprint arXiv:1511.06324, 2015."},{"key":"key-10.1145\/3178876.3186051-35","unstructured":"Xiu Shen Wei, Jianxin Wu, and Zhi Hua Zhou. Scalable multi-instance learning. In IEEE International Conference on Data Mining, pages 1037--1042, 2014."},{"key":"key-10.1145\/3178876.3186051-36","unstructured":"Karl Weiss, Taghi M Khoshgoftaar, and DingDing Wang. A survey of transfer learning. Journal of Big Data, 3(1):9, 2016.","DOI":"10.1186\/s40537-016-0043-6","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-37","unstructured":"E Yomtov and E Gabrilovich. Postmarket drug surveillance without trial costs: Discovery of adverse drug reactions through large-scale analysis of web search queries. Journal of Medical Internet Research, 15(6):e124, 2013.","DOI":"10.2196\/jmir.2614","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-38","unstructured":"H Yu, C Ho, Y Juan, and C Lin. Libshorttext: A library for short-text classification and analysis. Rapport interne, Department of Computer Science, National Taiwan University. Software available at http:\/\/www. csie. ntu. edu. tw\/? cjlin\/libshorttext, 2013."},{"key":"key-10.1145\/3178876.3186051-39","unstructured":"Dan Zhang and Luo Si. Multiple instance transfer learning. In Data Mining Workshops, 2009. ICDMW'09. IEEE International Conference on, pages 406--411. IEEE, 2009.","DOI":"10.1109\/ICDMW.2009.72","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-40","unstructured":"Liang Zhao, Feng Chen, Chang-Tien Lu, and Naren Ramakrishnan. Online spatial event forecasting in microblogs. ACM Transactions on Spatial Algorithms and Systems (TSAS), 2(4):15, 2016.","DOI":"10.1145\/2997642","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186051-41","unstructured":"Zhi Hua Zhou, Yu Yin Sun, and Yu Feng Li. Multi-instance learning by treating instances as non-i.i.d. samples. Computer Science, pages 1249--1256, 2008."},{"key":"key-10.1145\/3178876.3186051-42","unstructured":"Yin Zhu, Yuqiang Chen, Zhongqi Lu, Sinno Jialin Pan, Gui-Rong Xue, Yong Yu, and Qiang Yang. Heterogeneous transfer learning for image classification. In AAAI, 2011."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186051&ftid=1957489&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:00:51Z","timestamp":1523635251000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":42,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186051","relation":{"cites":[]}}}