{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:27Z","timestamp":1523998767468},"publisher-location":"New York, New York, USA","reference-count":37,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186025","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Finding Needles in an Encyclopedic Haystack"],"prefix":"10.1145","author":[{"given":"Marius","family":"Pasca","sequence":"first","affiliation":[{"name":"Google, Mountain View, CA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186025-1","unstructured":"C. Bizer, J. Lehmann, G. Kobilarov, S. Auer, C. Becker, R. Cyganiak, and S. Hellmann. 2009. DBpedia - a Crystallization Point for the Web of Data. Journal of Web Semantics Vol. 7, 3 (2009), 154--165.","DOI":"10.1016\/j.websem.2009.07.002","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-2","unstructured":"R. Blanco, G. Ottaviano, and E. Meij. 2015. Fast and Space-Efficient Entity Linking in Queries Proceedings of the 8th ACM Conference on Web Search and Data Mining (WSDM-15). Shanghai, China, 179--188."},{"key":"key-10.1145\/3178876.3186025-3","unstructured":"G. Boleda, A. Gupta, and S. Pad&#243;. 2017. Instances and Concepts in Distributional Space. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics (EACL-17). Valencia, Spain, 79--85.","DOI":"10.18653\/v1\/E17-2013","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-4","unstructured":"K. Bollacker, C. Evans, P. Paritosh, T. Sturge, and J. Taylor. 2008. Freebase: A Collaboratively Created Graph Database for Structuring Human Knowledge Proceedings of the 2008 International Conference on Management of Data (SIGMOD-08). Vancouver, Canada, 1247--1250.","DOI":"10.1145\/1376616.1376746","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-5","unstructured":"D. Chen, A. Fisch, J. Weston, and A. Bordes. 2017. Reading Wikipedia to Answer Open-Domain Questions Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (ACL-17). Vancouver, Canada, 1870--1879."},{"key":"key-10.1145\/3178876.3186025-6","unstructured":"A. Chisholm and B. Hachey. 2015. Entity disambiguation with Web links. Transactions of the Association for Computational Linguistics Vol. 3 (2015), 145--156."},{"key":"key-10.1145\/3178876.3186025-7","unstructured":"M. Dryer and M. Haspelmath (Eds.).. 2013. World Atlas of Language Structures. Max Planck Institute for Evolutionary Anthropology."},{"key":"key-10.1145\/3178876.3186025-8","unstructured":"O. Etzioni, A. Fader, J. Christensen, S. Soderland, and Mausam. 2011. Open Information Extraction: The Second Generation Proceedings of the 22nd International Joint Conference on Artificial Intelligence (IJCAI-11). Barcelona, Spain, 3--10."},{"key":"key-10.1145\/3178876.3186025-9","unstructured":"A. Fader, S. Soderland, and O. Etzioni. 2011. Identifying Relations for Open Information Extraction Proceedings of the 2011 Conference on Empirical Methods in Natural Language Processing (EMNLP-11). Edinburgh, Scotland, 1535--1545."},{"key":"key-10.1145\/3178876.3186025-10","unstructured":"C. Fellbaum (Ed.).. 1998. WordNet: An Electronic Lexical Database and Some of its Applications. MIT Press."},{"key":"key-10.1145\/3178876.3186025-11","unstructured":"T. Flati, D. Vannella, T. Pasini, and R. Navigli. 2014. Two Is Bigger (and Better) Than One: the Wikipedia Bitaxonomy Project. Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (ACL-14). Baltimore, Maryland, 945--955.","DOI":"10.3115\/v1\/P14-1089","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-12","unstructured":"O. Ganea, M. Ganea, A. Lucchi, C. Eickhoff, and T. Hofmann. 2016. Probabilistic Bag-Of-Hyperlinks Model for Entity Linking Proceedings of the 25th World Wide Web Conference (WWW-16). Montreal, Canada, 927--938."},{"key":"key-10.1145\/3178876.3186025-13","unstructured":"M. Hearst. 1992. Automatic acquisition of hyponyms from large text corpora Proceedings of the 14th International Conference on Computational Linguistics (COLING-92). Nantes, France, 539--545."},{"key":"key-10.1145\/3178876.3186025-14","unstructured":"J. Hoffart, F. Suchanek, K. Berberich, and G. Weikum. 2013. YAGO2: a Spatially and Temporally Enhanced Knowledge Base from Wikipedia. Artificial Intelligence Journal. Special Issue on Artificial Intelligence, Wikipedia and Semi-Structured Resources Vol. 194 (2013), 28--61."},{"key":"key-10.1145\/3178876.3186025-15","unstructured":"J. Hu, G. Wang, F. Lochovsky, J. Sun, and Z. Chen. 2009. Understanding User's Query Intent with Wikipedia Proceedings of the 18th World Wide Web Conference (WWW-09). Madrid, Spain, 471--480."},{"key":"key-10.1145\/3178876.3186025-16","unstructured":"D. Lenat. 1995. CYC: a Large-Scale Investment in Knowledge Infrastructure. Commun. ACM Vol. 38, 11 (1995), 32--38.","DOI":"10.1145\/219717.219745","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-17","unstructured":"Mausam, M. Schmitz, S. Soderland, R. Bart, and O. Etzioni. 2012. Open Language Learning for Information Extraction. In Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning (EMNLP-CoNLL-12). Jeju Island, Korea, 523--534."},{"key":"key-10.1145\/3178876.3186025-18","unstructured":"G. Miller and F. Hristea. 2006. WordNet Nouns: Classes and Instances. Computational Linguistics Vol. 32, 1 (2006), 1--3.","DOI":"10.1162\/coli.2006.32.1.1","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-19","unstructured":"V. Nastase and M. Strube. 2008. Decoding Wikipedia Categories for Knowledge Acquisition Proceedings of the 23rd National Conference on Artificial Intelligence (AAAI-08). Chicago, Illinois, 1219--1224."},{"key":"key-10.1145\/3178876.3186025-20","unstructured":"V. Nastase and M. Strube. 2013. Transforming Wikipedia into a Large Scale Multilingual Concept Network. Artificial Intelligence Vol. 194 (2013), 62--85.","DOI":"10.1016\/j.artint.2012.06.008","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-21","unstructured":"X. Pan, T. Cassidy, U. Hermjakob, H. Ji, and K. Knight. 2015. Unsupervised Entity Linking with Abstract Meaning Representation Proceedings of the 2015 Conference of the North American Association for Computational Linguistics (NAACL-HLT-15). Denver, Colorado, 1130--1139."},{"key":"key-10.1145\/3178876.3186025-22","unstructured":"S. Ponzetto and R. Navigli. 2009. Large-Scale Taxonomy Mapping for Restructuring and Integrating Wikipedia Proceedings of the 21st International Joint Conference on Artificial Intelligence (IJCAI-09). Pasadena, California, 2083--2088."},{"key":"key-10.1145\/3178876.3186025-23","unstructured":"S. Ponzetto and M. Strube. 2007. Deriving a Large Scale Taxonomy from Wikipedia. In Proceedings of the 22nd National Conference on Artificial Intelligence (AAAI-07). Vancouver, British Columbia, 1440--1447."},{"key":"key-10.1145\/3178876.3186025-24","unstructured":"M. Porter. 1980. An algorithm for suffix stripping. Program Vol. 14, 3 (1980), 130--137.","DOI":"10.1108\/eb046814","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-25","unstructured":"L. Ratinov, D. Roth, D. Downey, and M. Anderson. 2011. Local and Global Algorithms for Disambiguation to Wikipedia Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics (ACL-11). Portland, Oregon, 1375--1384."},{"key":"key-10.1145\/3178876.3186025-26","unstructured":"M. Remy. 2002. Wikipedia: The Free Encyclopedia. Online Information Review Vol. 26, 6 (2002), 434.","DOI":"10.1108\/oir.2002.26.6.434.14","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-27","unstructured":"U. Scaiella, P. Ferragina, A. Marino, and M. Ciaramita. 2012. Topical Clustering of Search Results. In Proceedings of the 5th ACM Conference on Web Search and Data Mining (WSDM-12). Seattle, Washington, 223--232.","DOI":"10.1145\/2124295.2124324","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-28","unstructured":"J. Seitner, C. Bizer, K. Eckert, S. Faralli, R. Meusel, H. Paulheim, and S. Ponzetto. 2016. A Large Database of Hypernymy Relations Extracted from the Web Proceedings of the 10th Conference on Language Resources and Evaluation (LREC-16). Portoroz, Slovenia, 360--367."},{"key":"key-10.1145\/3178876.3186025-29","unstructured":"A. Singhal. 2012. Introducing the Knowledge Graph: Things, not Strings. Corporate blog."},{"key":"key-10.1145\/3178876.3186025-30","unstructured":"Y. Sun, A. Singla, D. Fox, and A. Krause. 2015. Building Hierarchies of Concepts via Crowdsourcing Proceedings of the 24th International Joint Conference on Artificial Intelligence (IJCAI-15). Buenos Aires, Argentina, 844--851."},{"key":"key-10.1145\/3178876.3186025-31","unstructured":"D. Tsurel, D. Pelleg, I. Guy, and D. Shahaf. 2017. Fun Facts: Automatic Trivia Fact Extraction from Wikipedia Proceedings of the 10th ACM Conference on Web Search and Data Mining (WSDM-17). Cambridge, United Kingdom, 345--354.","DOI":"10.1145\/3018661.3018709","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-32","unstructured":"D. Vrandeuci&#231; and M. Kr&#246;tzsch. 2014. Wikidata: A Free Collaborative Knowledge Base. Commun. ACM Vol. 57 (2014), 78--85.","DOI":"10.1145\/2629489","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-33","unstructured":"Z. Wang, Z. Li, J. Li, J. Tang, and J. Pan. 2013. Transfer Learning Based Cross-lingual Knowledge Extraction for Wikipedia Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics (ACL-13). Sofia, Bulgaria, 641--650."},{"key":"key-10.1145\/3178876.3186025-34","unstructured":"F. Wu and D. Weld. 2010. Open Information Extraction using Wikipedia. In Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics (ACL-10). Uppsala, Sweden, 118--127."},{"key":"key-10.1145\/3178876.3186025-35","unstructured":"W. Wu, H. Li, H. Wang, and K. Zhu. 2012. Probase: a Probabilistic Taxonomy for Text Understanding Proceedings of the 2012 International Conference on Management of Data (SIGMOD-12). Scottsdale, Arizona, 481--492.","DOI":"10.1145\/2213836.2213891","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-36","unstructured":"Y. Yan, N. Okazaki, Y. Matsuo, Z. Yang, and M. Ishizuka. 2009. Unsupervised Relation Extraction by Mining Wikipedia Texts Using Information from the Web. In Proceedings of the 47th Annual Meeting of the Association for Computational Linguistics (ACL-IJCNLP-09). Singapore, 1021--1029.","DOI":"10.3115\/1690219.1690289","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186025-37","unstructured":"C. Zirn, V. Nastase, and M. Strube. 2008. Distinguishing Between Instances and Classes in the Wikipedia Taxonomy Proceedings of the 5th European Semantic Web Conference (ESWC-08). Tenerife, Spain, 376--387."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186025&ftid=1957347&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:41:15Z","timestamp":1523641275000},"score":1.0,"subtitle":["Detecting Classes Among Wikipedia Articles"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":37,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186025","relation":{"cites":[]}}}