{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719872},"publisher-location":"New York, New York, USA","reference-count":42,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"FWO - Research Foundation - Flanders","award":["1S02717N"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186570","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Web Performance Automation for the People"],"prefix":"10.1145","author":[{"given":"Robin","family":"Marx","sequence":"first","affiliation":[{"name":"Hasselt University - tUL, Diepenbeek, Belgium"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186570-1","unstructured":"Victor Agababov, Michael Buettner, Victor Chudnovsky, Mark Cogan, Ben Greenstein, Shane McDaniel, Michael Piatek, Colin Scott, Matt Welsh, and Bolian Yin. 2015. Flywheel: Google's Data Compression Proxy for the Mobile Web. NSDI, Vol. Vol. 15. 367--380."},{"key":"key-10.1145\/3184558.3186570-2","unstructured":"Tom Bergan. 2016. Benchmarking HTTP\/2 Priorities. Online, https:\/\/docs.google.com\/document\/d\/1oLhNg1skaWD4_DtaoCxdSRN5erEXrH-KnLrMwEpOtFY\/. (October. 2016)."},{"key":"key-10.1145\/3184558.3186570-3","unstructured":"Tom Bergan, Simon Pelchat, and Michael Buettner. 2016. Rules of Thumb for HTTP\/2 Push. Online, https:\/\/docs.google.com\/document\/d\/1K0NykTXBbbbTlv60t5MyJvXjqKGsCVNYHyLEXIxYMv0. (2016)."},{"key":"key-10.1145\/3184558.3186570-4","unstructured":"Michael Butkiewicz, Daimeng Wang, Zhe Wu, Harsha V. Madhyastha, and Vyas Sekar. 2015. KLOTSKI: Reprioritizing Web Content to Improve User Experience on Mobile Devices. In Proceedings of the 12th USENIX Conference on Networked Systems Design and Implementation (NSDI'15). 439--453."},{"key":"key-10.1145\/3184558.3186570-5","unstructured":"Gaetano Carlucci, Luca De Cicco, and Saverio Mascolo. 2015. HTTP over UDP: an Experimental Investigation of QUIC Proceedings of the 30th Annual ACM Symposium on Applied Computing. ACM, 609--614.","DOI":"10.1145\/2695664.2695706","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-6","unstructured":"Calin Cascaval, Seth Fowler, Pablo Montesinos-Ortego, Wayne Piekarski, Mehrdad Reshadi, Behnam Robatmili, Michael Weber, and Vrajesh Bhavsar. 2013. ZOOMM: a parallel web browser engine for multicore mobile devices ACM SIGPLAN Notices, Vol. Vol. 48. ACM, 271--280.","DOI":"10.1145\/2442516.2442543","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-7","unstructured":"Hugues de Saxc&#233;, Iuniana Oprescu, and Yiping Chen. 2015. Is HTTP\/2 really faster than HTTP\/1.1. In Proceedings of the IEEE Conference on Computer Communications Workshops. 293--299.","DOI":"10.1109\/INFCOMW.2015.7179400","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-8","unstructured":"Dev.Opera. 2012. Opera Mini and JavaScript. Online, http:\/\/dev.opera.com\/articles\/view\/opera-mini-and-javascript\/. (2012)."},{"key":"key-10.1145\/3184558.3186570-9","unstructured":"Jeffrey Erman, Vijay Gopalakrishnan, Rittwik Jana, and K. K. Ramakrishnan. 2013. Towards a SPDY'ier Mobile Web. In Proceedings of the 9th ACM International Conference on emerging Networking EXperiments and Technologies (CoNEXT'13). 303--314.","DOI":"10.1145\/2535372.2535399","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-10","unstructured":"Everts, Tammy. 2014. Progressive image rendering: Good or evil Online, https:\/\/blog.radware.com\/applicationdelivery\/wpo\/2014\/09\/progressive-image-rendering-good-evil\/. (2014)."},{"key":"key-10.1145\/3184558.3186570-11","unstructured":"Utkarsh Goel, Moritz Steiner, Mike P Wittie, Stephen Ludin, and Martin Flack. 2017. Domain-Sharding for Faster HTTP\/2 in Lossy Cellular Networks. arXiv preprint arXiv:1707.05836 (2017)."},{"key":"key-10.1145\/3184558.3186570-12","unstructured":"Ilya Grigorik. 2013. High Performance Browser Networking. \" O'Reilly Media, Inc.\"."},{"key":"key-10.1145\/3184558.3186570-13","unstructured":"Bo Han, Shuai Hao, and Feng Qian. 2015. MetaPush: Cellular-Friendly Server Push For HTTP\/2 Proceedings of the Workshop on All Things Cellular (AllThingsCellular'15). 57--62."},{"key":"key-10.1145\/3184558.3186570-14","unstructured":"Ilya Grigorik and Pat Meenan and Rick Viscomi. 2017. HTTP Archive. Online, http:\/\/httparchive.org\/. (October. 2017)."},{"key":"key-10.1145\/3184558.3186570-15","unstructured":"Arash Molavi Kakhki, Samuel Jero, David Choffnes, Cristina Nita-Rotaru, and Alan Mislove. 2017. Taking a long look at QUIC: an approach for rigorous evaluation of rapidly evolving transport protocols. In Proceedings of the 2017 Internet Measurement Conference. ACM, 290--303.","DOI":"10.1145\/3131365.3131368","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-16","unstructured":"Conor Kelton, Jihoon Ryoo, Aruna Balasubramanian, and Samir R Das. 2017. Improving User Perceived Page Load Times Using Gaze. 14th USENIX Symposium on Networked Systems Design and Implementation (NSDI). 545--559."},{"key":"key-10.1145\/3184558.3186570-17","unstructured":"Ron Kohavi, Alex Deng, Roger Longbotham, and Ya Xu. 2014. Seven rules of thumb for web site experimenters. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1857--1866.","DOI":"10.1145\/2623330.2623341","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-18","unstructured":"Xuanzhe Liu, Yun Ma, Xinyang Wang, Yunxin Liu, Tao Xie, and Gang Huang. 2017. Swarovsky: Optimizing resource loading for mobile web browsing. IEEE Transactions on Mobile Computing Vol. 16, 10 (2017).","DOI":"10.1109\/TMC.2016.2645563","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-19","unstructured":"Robin Marx, Peter Quax, Axel Faes, and Wim Lamotte. [n. d.]. Concatenation, Embedding and Sharding: Do HTTP\/1 Performance Best Practices Make Sense in HTTP\/2. In Proceedings of the 13th International Conference on Web Information Systems and Technologies (WEBIST'17). Scitepress."},{"key":"key-10.1145\/3184558.3186570-20","unstructured":"Robin Marx, Sander Vanhove, Wouter Vanmontfort, Peter Quax, and Wim Lamotte. 2017. DOM2AFrame: Putting the Web back in WebVR. In Proceedings on the Int. Conf. on 3D Immersion (IC3D17). IEEE."},{"key":"key-10.1145\/3184558.3186570-21","unstructured":"Javad Nejati and Aruna Balasubramanian. 2016. An in-depth study of mobile browser performance. In Proceedings of the 25th International Conference on World Wide Web. 1305--1315.","DOI":"10.1145\/2872427.2883014","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-22","unstructured":"Ravi Netravali, Ameesh Goyal, James Mickens, and Hari Balakrishnan. 2016. Polaris: Faster Page Loads Using Fine-grained Dependency Tracking Proceedings of the 13th USENIX Conference on Networked Systems Design and Implementation (NSDI'16). 123--136."},{"key":"key-10.1145\/3184558.3186570-23","unstructured":"Ravi Netravali, Anirudh Sivaraman, Somak Das, Ameesh Goyal, Keith Winstein, James Mickens, and Hari Balakrishnan. 2015. Mahimahi: Accurate Record-and-Replay for HTTP. In USENIX Annual Technical Conference. 417--429."},{"key":"key-10.1145\/3184558.3186570-24","unstructured":"Osmani, Addy. 2017. Preload, Prefetch And Priorities in Chrome. Online, https:\/\/medium.com\/reloading\/preload-prefetch-and-priorities-in-chrome-776165961bbf. (2017)."},{"key":"key-10.1145\/3184558.3186570-25","unstructured":"Purnell, Newley. 2018. UC Browser vs Google Chrome. Online, https:\/\/www.wsj.com\/articles\/a-browser-youve-never-heard-of-is-dethroning-google-in-asia-1514808002. (2018)."},{"key":"key-10.1145\/3184558.3186570-26","unstructured":"Feng Qian, Vijay Gopalakrishnan, Emir Halepovic, Subhabrata Sen, and Oliver Spatscheck. 2015. TM 3: flexible transport-layer multi-pipe multiplexing middlebox without head-of-line blocking. In Proc. of the 11th ACM Conf. on Emerging Networking Experiments and Technologies.","DOI":"10.1145\/2716281.2836088","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-27","unstructured":"Sanae Rosen, Bo Han, Shuai Hao, Z Morley Mao, and Feng Qian. 2017. Push or Request: An Investigation of HTTP\/2 Server Push for Improving Mobile Performance. In Proceedings of the 26th International Conference on World Wide Web. 459--468.","DOI":"10.1145\/3038912.3052574","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-28","unstructured":"Vaspol Ruamviboonsuk, Ravi Netravali, Muhammed Uluyol, and Harsha V Madhyastha. 2017. VROOM: Accelerating the Mobile Web with Server-Aided Dependency Resolution Proceedings of the Conference of the ACM Special Interest Group on Data Communication."},{"key":"key-10.1145\/3184558.3186570-29","unstructured":"Ali Sehati and Majid Ghaderi. 2015. WebPro: A proxy-based approach for low latency web browsing on mobile devices Quality of Service (IWQoS), 2015 IEEE 23rd International Symposium on. IEEE, 319--328."},{"key":"key-10.1145\/3184558.3186570-30","unstructured":"Tammy Everts and Tim Kadlec. 2017. WPO Stats. Online, https:\/\/wpostats.com\/. (October. 2017)."},{"key":"key-10.1145\/3184558.3186570-31","unstructured":"Kashyap Todi, Jussi Jokinen, Antti Oulasvirta, and Kris Luyten. 2018. Familiarisation: Restructuring Layouts with Visual Learning Models International Conference on Intelligent User Interfaces 2018 (IUI). ACM."},{"key":"key-10.1145\/3184558.3186570-32","unstructured":"Jeroen van der Hooft, Stefano Petrangeli, Tim Wauters, Rameez Rahman, Nico Verzijp, Rafael Huysegems, Tom Bostoen, and Filip De Turck. 2017. Analysis of a large multimedia-rich web portal for the validation of personal delivery networks. In Integrated Network and Service Management (IM), 2017 IFIP\/IEEE Symposium on. IEEE, 714--719.","DOI":"10.23919\/INM.2017.7987364","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-33","unstructured":"Matteo Varvello, Jeremy Blackburn, David Naylor, and Konstantina Papagiannaki. 2016. EYEORG: A Platform For Crowdsourcing Web Quality Of Experience Measurements Proceedings of the 12th ACM International Conference on emerging Networking EXperiments and Technologies (CoNEXT'16). 399--412."},{"key":"key-10.1145\/3184558.3186570-34","unstructured":"W3C Recommendation. 2012. Navigation Timing. Online, https:\/\/www.w3.org\/TR\/navigation-timing. (December. 2012)."},{"key":"key-10.1145\/3184558.3186570-35","unstructured":"Xiao Sophia Wang, Aruna Balasubramanian, Arvind Krishnamurthy, and David Wetherall. 2013. Demystifying Page Load Performance with WProf. In Proceedings of the 10th USENIX Conference on Networked Systems Design and Implementation (NSDI'13). 473--486."},{"key":"key-10.1145\/3184558.3186570-36","unstructured":"Xiao Sophia Wang, Arvind Krishnamurthy, and David Wetherall. 2016. Speeding Up Web Page Loads with Shandian. In Proceedings of the 13th USENIX Conference on Networked Systems Design and Implementation (NSDI'16). 109--122."},{"key":"key-10.1145\/3184558.3186570-37","unstructured":"Zhen Wang, Felix Xiaozhu Lin, Lin Zhong, and Mansoor Chishtie. 2011. Why are web browsers slow on smartphones. In Proceedings of the 12th Workshop on Mobile Computing Systems and Applications. ACM, 91--96.","DOI":"10.1145\/2184489.2184508","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186570-38","unstructured":"WebPagetest. 2017. Website Performance and Optimization Test. Online, https:\/\/www.webpagetest.org\/. (2017)."},{"key":"key-10.1145\/3184558.3186570-39","unstructured":"WebPageTest Documentation. 2012. Speed Index. Online, https:\/\/sites.google.com\/a\/webpagetest.org\/docs\/using-webpagetest\/metrics\/speed-index. (2012)."},{"key":"key-10.1145\/3184558.3186570-40","unstructured":"Maarten Wijnants, Robin Marx, Peter Quax, and Wim Lamotte. 2018. HTTP\/2 Prioritization and its Impact on Web Performance WWW 2018: The 2018 Web Conference, April 23--27, 2018, Lyon, France. ACM."},{"key":"key-10.1145\/3184558.3186570-41","unstructured":"Kyriakos Zarifis, Mark Holland, Manish Jain, Ethan Katz-Bassett, and Ramesh Govindan. 2017. Making Effective Use of HTTP\/2 Server Push in Content Delivery Networks Technical report. University of Southern California."},{"key":"key-10.1145\/3184558.3186570-42","unstructured":"Torsten Zimmermann, Benedikt Wolters, and Oliver Hohlfeld. 2017. A QoE Perspective on HTTP\/2 Server Push. In Proc. Workshop on QoE-based Analysis and Management of Data Comm. Networks. ACM, 1--6."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186570&ftid=1958288&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T19:44:48Z","timestamp":1524080688000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":42,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186570","relation":{"cites":[]}}}