{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:21Z","timestamp":1525103721175},"publisher-location":"New York, New York, USA","reference-count":33,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186965","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["THOR"],"prefix":"10.1145","author":[{"given":"Mayank","family":"Kejriwal","sequence":"first","affiliation":[{"name":"University of Southern California, Information Sciences Institute, Marina Del Rey, CA, USA"}]},{"given":"Daniel","family":"Gilley","sequence":"additional","affiliation":[{"name":"Next Century Corporation, Annapolis Junction, MD, USA"}]},{"given":"Pedro","family":"Szekely","sequence":"additional","affiliation":[{"name":"University of Southern California, Information Sciences Institute, Marina Del Rey, CA, USA"}]},{"given":"Jill","family":"Crisman","sequence":"additional","affiliation":[{"name":"Next Century Corporation, Annapolis Junction, MD, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186965-1","unstructured":"Fabian Abel, Claudia Hauff, Geert-Jan Houben, Richard Stronkman, and Ke Tao. 2012. Twitcident: fighting fire with information from social web streams Proceedings of the 21st International Conference on World Wide Web. ACM, 305--308.","DOI":"10.1145\/2187980.2188035","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-2","unstructured":"Yusup Aibaidulla and Kim-Teng Lua. 2003. The development of tagged Uyghur corpus. Proceedings of PACLIC17 (2003), 1--3."},{"key":"key-10.1145\/3184558.3186965-3","unstructured":"Brian Anderson and Sumeth Vongpanitlerd. 2006. Network analysis and synthesis. Dover."},{"key":"key-10.1145\/3184558.3186965-4","unstructured":"Rudy Arthur, Chris A Boulton, Humphrey Shotton, and Hywel TP Williams. 2017. Social Sensing of Floods in the UK. arXiv preprint arXiv:1711.04695 (2017)."},{"key":"key-10.1145\/3184558.3186965-5","unstructured":"Marco Avvenuti, Stefano Cresci, Mariantonietta N La Polla, Andrea Marchetti, and Maurizio Tesconi. 2014. Earthquake emergency management by social sensing. Pervasive computing and communications workshops (PERCOM workshops), 2014 IEEE international conference on. IEEE, 587--592."},{"key":"key-10.1145\/3184558.3186965-6","unstructured":"Cosmin Adrian Bejan and Sanda Harabagiu. 2014. Unsupervised event coreference resolution. Computational Linguistics Vol. 40, 2 (2014), 311--347.","DOI":"10.1162\/COLI_a_00174","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-7","unstructured":"David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of machine Learning research Vol. 3, Jan (2003), 993--1022."},{"key":"key-10.1145\/3184558.3186965-8","unstructured":"Seonhwa Choi and Byunggul Bae. 2015. The real-time monitoring system of social big data for disaster management. Computer Science and its Applications. Springer, 809--815.","DOI":"10.1007\/978-3-662-45402-2_115","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-9","unstructured":"Andrew Crooks, Arie Croitoru, Anthony Stefanidis, and Jacek Radzikowski. 2013. # Earthquake: Twitter as a distributed sensor system. Transactions in GIS, Vol. 17, 1 (2013), 124--147.","DOI":"10.1111\/j.1467-9671.2012.01359.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-10","unstructured":"Daniel Delling, Peter Sanders, Dominik Schultes, and Dorothea Wagner. 2009. Engineering route planning algorithms. Algorithmics of large and complex networks. Springer, 117--139.","DOI":"10.1007\/978-3-642-02094-0_7","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-11","unstructured":"Lise Getoor and Ashwin Machanavajjhala. 2013. Entity resolution for big data. In Proceedings of the 19th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1527--1527.","DOI":"10.1145\/2487575.2506179","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-12","unstructured":"Xingsheng He, Di Lu, Drew Margolin, Mengdi Wang, Salma El Idrissi, and Yu-Ru Lin. 2017. The signals and noise: Actionable information in improvised social media channels during a disaster. In Proceedings of the 2017 ACM on Web Science Conference. ACM, 33--42.","DOI":"10.1145\/3091478.3091501","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-13","unstructured":"Muhammad Imran, Carlos Castillo, Ji Lucas, Patrick Meier, and Sarah Vieweg. 2014. AIDR: Artificial intelligence for disaster response Proceedings of the 23rd International Conference on World Wide Web. ACM, 159--162.","DOI":"10.1145\/2567948.2577034","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-14","unstructured":"Muhammad Imran, Shady Elbassuoni, Carlos Castillo, Fernando Diaz, and Patrick Meier. 2013. Extracting information nuggets from disaster-Related messages in social media. ISCRAM."},{"key":"key-10.1145\/3184558.3186965-15","unstructured":"Ann Irvine and Alexandre Klementiev. 2010. Using Mechanical Turk to annotate lexicons for less commonly used languages Proceedings of the NAACL HLT 2010 Workshop on Creating Speech and Language Data with Amazon's Mechanical Turk. Association for Computational Linguistics, 108--113."},{"key":"key-10.1145\/3184558.3186965-16","unstructured":"Peter Jackson and Isabelle Moulinier. 2007. Natural language processing for online applications: Text retrieval, extraction and categorization. Vol. Vol. 5. John Benjamins Publishing.","DOI":"10.1075\/nlp.5","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-17","unstructured":"Ashutosh Sopan Jadhav, Hemant Purohit, Pavan Kapanipathi, Pramod Anantharam, Ajith H Ranabahu, Vinh Nguyen, Pablo N Mendes, Alan Gary Smith, Michael Cooney, and Amit P Sheth. 2010. Twitris 2.0: Semantically empowered system for understanding perceptions from social data. (2010)."},{"key":"key-10.1145\/3184558.3186965-18","unstructured":"Grigoris Karvounarakis, Zachary G Ives, and Val Tannen. 2010. Querying data provenance. In Proceedings of the 2010 ACM SIGMOD International Conference on Management of data. ACM, 951--962.","DOI":"10.1145\/1807167.1807269","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-19","unstructured":"Philipp Koehn, Hieu Hoang, Alexandra Birch, Chris Callison-Burch, Marcello Federico, Nicola Bertoldi, Brooke Cowan, Wade Shen, Christine Moran, Richard Zens, et almbox. 2007. Moses: Open source toolkit for statistical machine translation Proceedings of the 45th annual meeting of the ACL on interactive poster and demonstration sessions. Association for Computational Linguistics, 177--180.","DOI":"10.3115\/1557769.1557821","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-20","unstructured":"Andrea Moro, Alessandro Raganato, and Roberto Navigli. 2014. Entity linking meets word sense disambiguation: a unified approach. Transactions of the Association for Computational Linguistics Vol. 2 (2014), 231--244."},{"key":"key-10.1145\/3184558.3186965-21","unstructured":"Nathan Morrow, Nancy Mock, Adam Papendieck, and Nicholas Kocmich. 2011. Independent evaluation of the Ushahidi Haiti project. Development Information Systems International Vol. 8 (2011), 2011."},{"key":"key-10.1145\/3184558.3186965-22","unstructured":"David Nadeau and Satoshi Sekine. 2007. A survey of named entity recognition and classification. Lingvisticae Investigationes Vol. 30, 1 (2007), 3--26.","DOI":"10.1075\/li.30.1.03nad","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-23","unstructured":"Bo Pang, Lillian Lee, et almbox. 2008. Opinion mining and sentiment analysis. Foundations and Trends&#174; in Information Retrieval, Vol. 2, 1--2 (2008), 1--135."},{"key":"key-10.1145\/3184558.3186965-24","unstructured":"Jakob Rogstadius, Maja Vukovic, CA Teixeira, Vassilis Kostakos, Evangelos Karapanos, and Jim Alain Laredo. 2013. CrisisTracker: Crowdsourced social media curation for disaster awareness. IBM Journal of Research and Development Vol. 57, 5 (2013), 4--1."},{"key":"key-10.1145\/3184558.3186965-25","unstructured":"Takeshi Sakaki, Makoto Okazaki, and Yutaka Matsuo. 2010. Earthquake shakes Twitter users: real-time event detection by social sensors Proceedings of the 19th international conference on World wide web. ACM, 851--860.","DOI":"10.1145\/1772690.1772777","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-26","unstructured":"Axel Schulz, Petar Ristoski, and Heiko Paulheim. 2013. I see a car crash: Real-time detection of small scale incidents in microblogs Extended Semantic Web Conference. Springer, 22--33."},{"key":"key-10.1145\/3184558.3186965-27","unstructured":"Tomer Simon, Avishay Goldberg, and Bruria Adini. 2015. Socializing in emergencies--A review of the use of social media in emergency situations. International Journal of Information Management, Vol. 35, 5 (2015), 609--619.","DOI":"10.1016\/j.ijinfomgt.2015.07.001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-28","unstructured":"Michael Stonebraker, U&#199;&#167;ur cCetintemel, and Stan Zdonik. 2005. The 8 requirements of real-time stream processing. ACM SIGMOD Record, Vol. 34, 4 (2005), 42--47."},{"key":"key-10.1145\/3184558.3186965-29","unstructured":"Pedro Szekely, Craig A Knoblock, Jason Slepicka, Andrew Philpot, Amandeep Singh, Chengye Yin, Dipsy Kapoor, Prem Natarajan, Daniel Marcu, Kevin Knight, et almbox. 2015. Building and using a knowledge graph to combat human trafficking International Semantic Web Conference. Springer, 205--221."},{"key":"key-10.1145\/3184558.3186965-30","unstructured":"Dennis Thom, Robert Kr&#252;ger, Thomas Ertl, Ulrike Bechstedt, Axel Platz, Julia Zisgen, and Bernd Volland. 2015. Can twitter really save your life A case study of visual social media analytics for situation awareness. In Visualization Symposium (PacificVis), 2015 IEEE Pacific. IEEE, 183--190.","DOI":"10.1109\/PACIFICVIS.2015.7156376","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-31","unstructured":"Sarah Vieweg, Amanda L Hughes, Kate Starbird, and Leysia Palen. 2010. Microblogging during two natural hazards events: what twitter may contribute to situational awareness. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1079--1088.","DOI":"10.1145\/1753326.1753486","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186965-32","unstructured":"Quan Wang, Bin Wang, and Li Guo. 2015. Knowledge Base Completion Using Embeddings and Rules. IJCAI. 1859--1866."},{"key":"key-10.1145\/3184558.3186965-33","unstructured":"Linhong Zhu, Majid Ghasemi-Gol, Pedro Szekely, Aram Galstyan, and Craig A Knoblock. 2016. Unsupervised Entity Resolution on Multi-type Graphs International Semantic Web Conference. Springer, 649--667."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186965&ftid=1958200&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:31:08Z","timestamp":1524076268000},"score":1.0,"subtitle":["Text-enabled Analytics for Humanitarian Operations"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":33,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186965","relation":{"cites":[]}}}