{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:23Z","timestamp":1525103723445},"publisher-location":"New York, New York, USA","reference-count":71,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"Agence Nationale de la Recherche France","award":["ANR-15-CE23-0025-01"]},{"name":"KAKENHI Japan","award":["17K12786"]},{"name":"New Energy and Industrial Technology Development Organization (NEDO) Japan","award":[]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3188727","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["A Content Management Perspective on Fact-Checking"],"prefix":"10.1145","author":[{"given":"Sylvie","family":"Cazalens","sequence":"first","affiliation":[{"name":"Université de Lyon, CNRS, INSA-Lyon, LIRIS, UMR5205, Lyon, France"}]},{"given":"Philippe","family":"Lamarre","sequence":"additional","affiliation":[{"name":"Université de Lyon, CNRS, INSA-Lyon, LIRIS, UMR5205, Lyon, France"}]},{"given":"Julien","family":"Leblay","sequence":"additional","affiliation":[{"name":"AIRC, AIST, Tokyo, Japan"}]},{"given":"Ioana","family":"Manolescu","sequence":"additional","affiliation":[{"name":"Inria, UMR7161, CNRS, Ecole Polytechnique, Palaiseau, France"}]},{"given":"Xavier","family":"Tannier","sequence":"additional","affiliation":[{"name":"Sorbonne Université, Inserm, LIMICS, Paris, France"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3188727-1","unstructured":"Eneko Agirre, Daniel Cer, Mona Diab, and Aitor Gonzalez-Agirre. 2013. *Sem 2013 Shared Task: Semantic Textual Similarity. In Proceedings of the Second Joint Conference on Lexical and Computational Semantics and the Shared Task: Semantic Textual Similarity. 32--43."},{"key":"key-10.1145\/3184558.3188727-2","unstructured":"Isabelle Augenstein, Tim Rockt&#228;schel, Andreas Vlachos, and Kalina Bontcheva. 2016. Stance Detection with Bidirectional Conditional Encoding. In Proceedings of the Conference on Empirical Methods in Natural Language Processing, Jian Su, Kevin Duh, and Xavier Carreras (Eds.). Association for Computational Linguistics, Austin, Texas, 876--885. https:\/\/aclweb.org\/anthology\/D16--1084","DOI":"10.18653\/v1\/D16-1084","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-3","unstructured":"Mevan Babakar and Will Moy. 2016. The State of Automated Factchecking. https:\/\/fullfact.org\/media\/uploads\/full_factthe_state_of_automated_factchecking_aug_2016.pdf. (2016)."},{"key":"key-10.1145\/3184558.3188727-4","unstructured":"Roy Bar-Haim, Indrajit Bhattacharya, Francesco Dinuzzo, Amrita Saha, and Noam Slonim. 2017. Stance Classification of Context-Dependent Claims. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics: Volume 1, Long Papers. Association for Computational Linguistics, Valencia, Spain, 251--261. http:\/\/www.aclweb.org\/anthology\/E17--1024"},{"key":"key-10.1145\/3184558.3188727-5","unstructured":"Adnene Belfodil, Sylvie Cazalens, Philippe Lamarre, and Marc Plantevit. 2017. Flash Points: Discovering Exceptional Pairwise Behaviors in Vote or Rating Data. In Machine Learning and Knowledge Discovery in Databases - European Conference, ECML PKDD 2017, Skopje, Macedonia, September 18--22, 2017, Proceedings, Part II (Lecture Notes in Computer Science), Michelangelo Ceci, Jaakko Hollm&#233;n, Ljupco Todorovski, Celine Vens, and Saso Dzeroski (Eds.), Vol. 10535. Springer, 442--458. DOI:https:\/\/doi.org\/10.1007\/978--3--319--71246--8_27"},{"key":"key-10.1145\/3184558.3188727-6","unstructured":"Gajanan K. Birajdar and Vijay H. Mankar. 2013. Digital Image Forgery Detection Using Passive Techniques: A Survey. Digit. Investig. 10, 3 (Oct. 2013), 226--245. DOI:https:\/\/doi.org\/10.1016\/j.diin.2013.04.007","DOI":"10.1016\/j.diin.2013.04.007","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-7","unstructured":"Leticia Bode and Emily K. Vraga. 2015. In Related News, That Was Wrong: The Correction of Misinformation Through Related Stories Functionality in Social Media. Journal of Communication 65, 4 (2015), 619--638. DOI:https:\/\/doi.org\/10. 1111\/jcom.12166"},{"key":"key-10.1145\/3184558.3188727-8","unstructured":"Rapha&#235;l Bonaque, T. D. Cao, Bogdan Cautis, Fran&#231;ois Goasdou&#233;, J. Letelier, Ioana Manolescu, O. Mendoza, S. Ribeiro, Xavier Tannier, and Micha&#235;l Thomazo. 2016. Mixed-instance querying: a lightweight integration architecture for data journalism. PVLDB 9, 13 (2016), 1513--1516."},{"key":"key-10.1145\/3184558.3188727-9","unstructured":"Allan Borodin, Gareth O. Roberts, Jeffrey S. Rosenthal, and Panayiotis Tsaparas. 2005. Link Analysis Ranking: Algorithms, Theory, and Experiments. ACM Trans. Internet Technol. 5, 1 (Feb. 2005), 231--297. DOI:https:\/\/doi.org\/10.1145\/1052934. 1052942"},{"key":"key-10.1145\/3184558.3188727-10","unstructured":"Samuel R. Bowman, Gabor Angeli, Christopher Potts, and Christopher D. Manning. 2015. A large annotated corpus for learning natural language inference. In Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing (EMNLP). Association for Computational Linguistics.","DOI":"10.18653\/v1\/D15-1075","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-11","unstructured":"Giovanni Luca Ciampaglia, Prashant Shiralkar, Luis M. Rocha, Johan Bollen, Filippo Menczer, and Alessandro Flammini. 2015. Computational fact checking from knowledge networks. PloS one 10, 6 (2015), e0128193."},{"key":"key-10.1145\/3184558.3188727-12","unstructured":"Sarah Cohen, Hamilton James T., and Fred Turner. 2011. Computational Journalism. Commun. ACM 54, 10 (Oct. 2011), 66--71. DOI:https:\/\/doi.org\/10.1145\/ 2001269.2001288"},{"key":"key-10.1145\/3184558.3188727-13","unstructured":"Ido Dagan, Oren Glickman, and Bernardo Magnini. 2005. The PASCAL Recognising Textual Entailment Challenge. In PASCAL Challenges Workshop for Recognizing Textual Entailment. http:\/\/oren.glickman.com\/publications\/LNAI_39440177. pdf"},{"key":"key-10.1145\/3184558.3188727-14","unstructured":"Nicholas Diakopoulos. 2012. Cultivating the Landscape of Innovation in Computational Journalism. http:\/\/www.nickdiakopoulos.com\/wpcontent\/uploads\/2012\/05\/diakopoulos_whitepaper_systematicinnovation.pdf. (2012)."},{"key":"key-10.1145\/3184558.3188727-15","unstructured":"B. Dolan, C. Quirk, and C. Brockett. 2004. Unsupervised Construction of Large Paraphrase Corpora: Exploiting Massively Parallel News Sources. In Proceedings of the 20th International Conference on Computational Linguistics (Coling 04). COLING, Geneva, Switzerland."},{"key":"key-10.1145\/3184558.3188727-16","unstructured":"Xin Dong, Evgeniy Gabrilovich, Geremy Heitz, Wilko Horn, Ni Lao, Kevin Murphy, Thomas Strohmann, Shaohua Sun, and Wei Zhang. 2014. Knowledge Vault: A Web-scale Approach to Probabilistic Knowledge Fusion. In Proceedings of the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '14). ACM, New York, NY, USA, 601--610. DOI: https:\/\/doi.org\/10.1145\/2623330.2623623","DOI":"10.1145\/2623330.2623623","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-17","unstructured":"Xin Luna Dong, Laure Berti-Equille, and Divesh Srivastava. 2009. Truth discovery and copying detection in a dynamic world. Proceedings of the VLDB Endowment 2, 1 (2009), 562--573.","DOI":"10.14778\/1687627.1687691","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-18","unstructured":"Xin Luna Dong, Evgeniy Gabrilovich, Kevin Murphy, Van Dang, Wilko Horn, Camillo Lugaresi, Shaohua Sun, and Wei Zhang. 2015. Knowledge-Based Trust: Estimating the Trustworthiness of Web Sources. In Proceedings of the VLDB Endowment. http:\/\/arxiv.org\/pdf\/1502.03519v1.pdf"},{"key":"key-10.1145\/3184558.3188727-19","unstructured":"Rob Ennals, Beth Trushkowsky, and John Mark Agosta. 2010. Highlighting disputed claims on the web. In Proceedings of the 19th international conference on World wide web. ACM, 341--350.","DOI":"10.1145\/1772690.1772726","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-20","unstructured":"Adam Faulkner. 2014. Automated Classification of Stance in Student Essays: An Approach Using Stance Target Information and the Wikipedia Link-Based Measure. In Proceedings of the Twenty-Seventh International Florida Artificial Intelligence Research Society Conference. Association for the Advancement of Artificial Intelligence, Pensacola Beach, USA. https:\/\/pdfs.semanticscholar.org\/ 2e8d\/01e2fcf7ad7bfc889360a7c9c495effbdc34.pdf"},{"key":"key-10.1145\/3184558.3188727-21","unstructured":"William Ferreira and Andreas Vlachos. 2016. Emergent: a novel data-set for stance classification. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, San Diego, California, 1163--1168. http:\/\/www.aclweb.org\/anthology\/N16--1138","DOI":"10.18653\/v1\/N16-1138","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-22","unstructured":"Michael Franklin, Alon Halevy, and David Maier. 2005. From Databases to Dataspaces: A New Abstraction for Information Management. SIGMOD Record 34, 4 (Dec. 2005), 27--33. DOI:https:\/\/doi.org\/10.1145\/1107499.1107502","DOI":"10.1145\/1107499.1107502","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-23","unstructured":"R. Kelly Garrett. 2009. Echo chambers online: Politically motivated selective exposure among Internet news users1. Journal of Computer-Mediated Communication 14, 2 (2009), 265--285. DOI:https:\/\/doi.org\/10.1111\/j.1083--6101.2009.01440.x"},{"key":"key-10.1145\/3184558.3188727-24","unstructured":"R. Kelly Garrett. 2016. Facebook's problem is more complicated than fake news. http:\/\/theconversation.com\/facebooks-problem-is-more-complicated-thanfake-news-68886. (2016)."},{"key":"key-10.1145\/3184558.3188727-25","unstructured":"R. Kelly Garrett and Brian E. Weeks. 2013. The promise and peril of real-time corrections to political misperceptions. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1047--1058.","DOI":"10.1145\/2441776.2441895","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-26","unstructured":"Daniel Gerber, Diego Esteves, Jens Lehmann, Lorenz B&#252;hmann, Ricardo Usbeck, Axel-Cyrille Ngonga Ngomo, and Ren&#233; Speck. 2015. DeFactoTemporal and multilingual Deep Fact Validation. Web Semantics: Science, Services and Agents on the World Wide Web 35 (2015), 85--101.","DOI":"10.1016\/j.websem.2015.08.001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-27","unstructured":"Fran&#231;ois Goasdou&#233;, Konstantinos Karanasos, Yannis Katsis, Julien Leblay, Ioana Manolescu, and Stamatis Zampetakis. 2013. Fact checking and analyzing the web. In SIGMOD, Kenneth A. Ross, Divesh Srivastava, and Dimitris Papadias (Eds.). ACM, 997--1000. DOI:https:\/\/doi.org\/10.1145\/2463676.2463692","DOI":"10.1145\/2463676.2463692","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-28","unstructured":"Alan Greenblatt. 2017. The Future of Fact-Checking: Moving ahead in political accountability journalism. https:\/\/www.americanpressinstitute.org\/publications\/reports\/whitepapers\/future-of-fact-checking\/. (2017)."},{"key":"key-10.1145\/3184558.3188727-29","unstructured":"Chinnappa Guggilla, Tristan Miller, and Iryna Gurevych. 2016. CNN- and LSTMbased Claim Classification in Online User Comments. In Proceedings of the 26th International Conference on Computational Linguistics: Technical Papers (COLING 2016). 2740--2751. https:\/\/www.ukp.tu-darmstadt.de\/fileadmin\/user_upload\/ Group_UKP\/publikationen\/2016\/2016_COLING_CG.pdf"},{"key":"key-10.1145\/3184558.3188727-30","unstructured":"Kazi Saidul Hasan and Vincent Ng. 2013. Stance Classification of Ideological Debates: Data, Models, Features, and Constraints. In Proceedings of the Sixth International Joint Conference on Natural Language Processing. Asian Federation of Natural Language Processing, Nagoya, Japan, 1348--1356. http:\/\/www.aclweb. org\/anthology\/I13--1191"},{"key":"key-10.1145\/3184558.3188727-31","unstructured":"Naeemul Hassan, Chengkai Li, and Mark Tremayne. 2015. Detecting checkworthy factual claims in presidential debates. In Proceedings of International on Conference on Information and Knowledge Management. ACM, 1835--1838."},{"key":"key-10.1145\/3184558.3188727-32","unstructured":"Naeemul Hassan, Gensheng Zhang, Fatma Arslan, Josue Caraballo, Damian Jimenez, Siddhant Gawsane, Shohedul Hasan, Minumol Joseph, Aaditya Kulkarni, Anil Kumar Nayak, and others. 2017. ClaimBuster: The First-ever End-to-end Fact-checking System. Proceedings of the VLDB Endowment 10, 7 (2017).","DOI":"10.14778\/3137765.3137815","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-33","unstructured":"Julien Leblay. 2017. A Declarative Approach to Data-Driven Fact Checking. In AAAI. 147--153."},{"key":"key-10.1145\/3184558.3188727-34","unstructured":"Jens Lehmann, Daniel Gerber, Mohamed Morsey, and Axel-Cyrille Ngonga Ngomo. 2012. DeFacto-deep fact validation. In International Semantic Web Conference. Springer, 312--327.","DOI":"10.1007\/978-3-642-35176-1_20","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-35","unstructured":"Ran Levy, Yonatan Bilu, Daniel Hershcovich, Ehud Aharoni, and Noam Slonim. 2014. Context Dependent Claim Detection. In Proceedings of the 25th International Conference on Computational Linguistics (COLING 2014). Dublin City University and Association for Computational Linguistics, Dublin, Ireland, 1489--1500. http: \/\/www.aclweb.org\/anthology\/C14--1141"},{"key":"key-10.1145\/3184558.3188727-36","unstructured":"Yaliang Li, Jing Gao, Chuishi Meng, Qi Li, Lu Su, Bo Zhao, Wei Fan, and Jiawei Han. 2016. A survey on truth discovery. Acm Sigkdd Explorations Newsletter 17, 2 (2016), 1--16.","DOI":"10.1145\/2897350.2897352","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-37","unstructured":"Amnon Lotan, Asher Stern, and Ido Dagan. 2013. TruthTeller: Annotating Predicate Truth. In Proceedings of NAACL-HLT 2013. Atlanta, USA, 752--757. http:\/\/www.aclweb.org\/anthology\/N13--1091"},{"key":"key-10.1145\/3184558.3188727-38","unstructured":"Ioana Manolescu. 2017. ContentCheck: Content Management Techniques and Tools for Fact-checking. ERCIM News (Oct. 2017). https:\/\/hal.inria.fr\/hal-01596563"},{"key":"key-10.1145\/3184558.3188727-39","unstructured":"Saif Mohammad, Svetlana Kiritchenko, Parinaz Sobhani, Xiaodan Zhu, and Colin Cherry. 2016. SemEval-2016 Task 6: Detecting Stance in Tweets. In Proceedings of the 10th International Workshop on Semantic Evaluation (SemEval2016). Association for Computational Linguistics, San Diego, California, 31--41. http:\/\/www.aclweb.org\/anthology\/S16--1003","DOI":"10.18653\/v1\/S16-1003","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-40","unstructured":"Akiko Murakami and Rudy Raymond. 2010. Support or Oppose Classifying Positions in Online Debates from Reply Activities and Opinion Expressions. In Proceedings of the 23rd International Conference on Computational Linguistics (Coling 2010). Beijing, China, 869--875. http:\/\/www.aclweb.org\/anthology\/C10--2100"},{"key":"key-10.1145\/3184558.3188727-41","unstructured":"Brendan Nyhan and Jason Reifler. 2010. When Corrections Fail: The Persistence of Political Misperceptions. Political Behavior 32, 2 (01 Jun 2010), 303--330. DOI: https:\/\/doi.org\/10.1007\/s11109-010--9112--2"},{"key":"key-10.1145\/3184558.3188727-42","unstructured":"Ramesh C. Pandey, Sanjay K. Singh, and Kaushal K. Shukla. 2016. Passive Forensics in Image and Video Using Noise Features: A Review. Digital Investigation 19, C (Dec. 2016), 1--28. DOI:https:\/\/doi.org\/10.1016\/j.diin.2016.08.002","DOI":"10.1016\/j.diin.2016.08.002","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-43","unstructured":"Joonsuk Park and Claire Cardie. 2014. Identifying Appropriate Support for Propositions in Online User Comments. In Proceedings of the First Workshop on Argumentation Mining. Association for Computational Linguistics, Baltimore, Maryland, 29--38. http:\/\/www.aclweb.org\/anthology\/W14--2105","DOI":"10.3115\/v1\/W14-2105","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-44","unstructured":"Kashyap Popat, Subhabrata Mukherjee, Jannik Str&#246;tgen, and Gerhard Weikum. 2016. Credibility Assessment of Textual Claims on the Web. In CIKM. ACM, 2173--2178.","DOI":"10.1145\/2983323.2983661","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-45","unstructured":"Kashyap Popat, Subhabrata Mukherjee, Jannik Str&#246;tgen, and Gerhard Weikum. 2017. Where the Truth Lies: Explaining the Credibility of Emerging Claims on the Web and Social Media. In Proceedings of the 26th International Conference on World Wide Web Companion (WWW '17 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 1003--1012. DOI:https:\/\/doi.org\/10.1145\/3041021.3055133","DOI":"10.1145\/3041021.3055133","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-46","unstructured":"Ashwin Rajadesingan and Huan Liu. 2014. Identifying Users with Opposing Opinions in Twitter Debates. In 7th International Conference Social Computing, Behavioral-Cultural Modeling and Prediction, William G. Kennedy, Nitin Agarwal, and Shanchieh Jay Yang (Eds.). Springer International Publishing, Cham, 153--160. DOI:https:\/\/doi.org\/10.1007\/978--3--319-05579--4_19"},{"key":"key-10.1145\/3184558.3188727-47","unstructured":"David P. Redlawsk, Andrew JW. Civettini, and Karen M. Emmerson. 2010. The affective tipping point: Do motivated reasoners ever get it Political Psychology 31, 4 (2010), 563--593.","DOI":"10.1111\/j.1467-9221.2010.00772.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-48","unstructured":"Victoria L. Rubin. 2017. News Verification Suite: Towards System Design to Supplement Reporters' and Editors' Judgements. In Proceedings of the 45th Annual Conference of The Canadian Association for Information Science\/ LAssociation canadienne des sciences de linformation (CAIS\/ACSI2017)."},{"key":"key-10.1145\/3184558.3188727-49","unstructured":"Victoria L. Rubin, Yimin Chen, and Niall J. Conroy. 2015. Deception detection for news: three types of fakes. Proceedings of the Association for Information Science and Technology 52, 1 (2015), 1--4.","DOI":"10.1002\/pra2.2015.145052010083","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-50","unstructured":"Victoria L. Rubin, Niall J. Conroy, Yimin Chen, and Sarah Cornwell. 2016. Fake News or Truth Using Satirical Cues to Detect Potentially Misleading News. In Proceedings of NAACL-HLT. 7--17.","DOI":"10.18653\/v1\/W16-0802","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-51","unstructured":"Misa Sato, Kohsuke Yanai, Toshinori Miyoshi, Toshihiko Yanase, Makoto Iwayama, Qinghua Sun, and Yoshiki Niwa. 2015. End-to-end Argument Generation System in Debating. In Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics (ACL), System Demonstrations. 109--114. http:\/\/aclweb.org\/anthology\/P\/P15\/P15--4019.pdf"},{"key":"key-10.1145\/3184558.3188727-52","unstructured":"Baoxu Shi and Tim Weninger. 2016. Fact Checking in Heterogeneous Information Networks. In Proceedings of the 25th International Conference Companion on World Wide Web (WWW '16 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 101--102. DOI: https:\/\/doi.org\/10.1145\/2872518.2889354","DOI":"10.1145\/2872518.2889354","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-53","unstructured":"Jieun Shin, Lian Jian, Kevin Driscoll, and Fran&#231;ois Bar. 2017. Political rumoring on Twitter during the 2012 US presidential election: Rumor diffusion and correction. New Media &#38; Society 19, 8 (2017), 1214--1235. DOI:https:\/\/doi.org\/10.1177\/ 1461444816634054 arXiv:https:\/\/doi.org\/10.1177\/1461444816634054","DOI":"10.1177\/1461444816634054","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-54","unstructured":"Kai Shu, Amy Sliva, Suhang Wang, Jiliang Tang, and Huan Liu. 2017. Fake News Detection on Social Media: A Data Mining Perspective. ACM SIGKDD Explorations Newsletter 19, 1 (2017), 22--36.","DOI":"10.1145\/3137597.3137600","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-55","unstructured":"K. Sitara and B.M. Mehtre. 2016. Digital Video Tampering Detection: An Overview of Passive Techniques. Digital Investigation 18, C (Sept. 2016), 8--22. DOI:https: \/\/doi.org\/10.1016\/j.diin.2016.06.003"},{"key":"key-10.1145\/3184558.3188727-56","unstructured":"Swapna Somasundaran and Janyce Wiebe. 2009. Recognizing Stances in Online Debates. In Proceedings of the Joint Conference of the 47th Annual Meeting of the ACL and the 4th International Joint Conference on Natural Language Processing of the AFNLP. Association for Computational Linguistics, Suntec, Singapore, 226--234. http:\/\/www.aclweb.org\/anthology\/P\/P09\/P09--1026","DOI":"10.3115\/1687878.1687912","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-57","unstructured":"Matthew C. Stamm, Min Wu, and Kuo J. Ray Liu. 2013. Information Forensics: An Overview of the First Decade. IEEE Access 1 (2013), 167--200. DOI:https: \/\/doi.org\/10.1109\/ACCESS.2013.2260814"},{"key":"key-10.1145\/3184558.3188727-58","unstructured":"Jonathan Stray. 2017. Defense Against the Dark Arts: Networked Propaganda and Counter-Propaganda. http:\/\/jonathanstray.com\/networked-propaganda-andcounter-propaganda. (2017)."},{"key":"key-10.1145\/3184558.3188727-59","unstructured":"Jonathan Stray. 2017. Introducing the CJ Workbench. http:\/\/jonathanstray.com\/introducing-the-cj-workbench. (2017)."},{"key":"key-10.1145\/3184558.3188727-60","unstructured":"Mihai Surdeanu. 2013. Overview of the TAC2013 Knowledge Bbase Population Evaluation: English Slot Filling and Temporal Slot Filling. In Proceedings of the TAC-KBP 2013 Workshop."},{"key":"key-10.1145\/3184558.3188727-61","unstructured":"Denis Teyssou, Jean-Michel Leung, Evlampios Apostolidis, Konstantinos Apostolidis, Symeon Papadopoulos, Markos Zampoglou, Olga Papadopoulou, and Vasileios Mezaris. 2017. The InVID Plug-in: Web Video Verification on the Browser. In Proceedings of the 1st International Workshop on Multimedia Verification. Mountain View, USA. http:\/\/www.iti.gr\/~bmezaris\/publications\/mm17_2_ preprint.pdf"},{"key":"key-10.1145\/3184558.3188727-62","unstructured":"Matt Thomas, Bo Pang, and Lillian Lee. 2006. Get out the vote: Determining support or opposition from Congressional floor-debate transcripts. In Proceedings of the 2006 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, Sydney, Australia, 327--335. https: \/\/www.cs.cornell.edu\/home\/llee\/papers\/tpl-convote.dec06.pdf","DOI":"10.3115\/1610075.1610122","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-63","unstructured":"Andreas Vlachos and Sebastian Riedel. 2014. Fact Checking: Task definition and dataset construction. In ACL 2014 Workshop on Language Technologies and Computational Social Science. 18--22. http:\/\/aclweb.org\/anthology\/W14--2508"},{"key":"key-10.1145\/3184558.3188727-64","unstructured":"Marilyn Walker, Jean Fox Tree, Pranav Anand, Rob Abbott, and Joseph King. 2012. A Corpus for Research on Deliberation and Debate. In Proceedings of the Eight International Conference on Language Resources and Evaluation (LREC'12) (23--25), Nicoletta Calzolari (Conference Chair), Khalid Choukri, Thierry Declerck, Mehmet Uur Doan, Bente Maegaard, Joseph Mariani, Asuncion Moreno, Jan Odijk, and Stelios Piperidis (Eds.). European Language Resources Association (ELRA), Istanbul, Turkey."},{"key":"key-10.1145\/3184558.3188727-65","unstructured":"Thomas Wood and Ethan Porter. 2016. The elusive backfire effect: mass attitudes' steadfast factual adherence. Political Behavior (2016), 1--29.","DOI":"10.2139\/ssrn.2819073","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-66","unstructured":"You Wu, Pankaj K Agarwal, Chengkai Li, Jun Yang, and Cong Yu. 2014. Toward computational fact-checking. Proceedings of the VLDB Endowment 7, 7 (2014), 589--600.","DOI":"10.14778\/2732286.2732295","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-67","unstructured":"You Wu, Pankaj K Agarwal, Chengkai Li, Jun Yang, and Cong Yu. 2017. Computational Fact Checking through Query Perturbations. ACM Transactions on Database Systems (TODS) 42, 1 (2017), 4."},{"key":"key-10.1145\/3184558.3188727-68","unstructured":"You Wu, Junyang Gao, Pankaj K Agarwal, and Jun Yang. 2017. Finding diverse, high-value representatives on a surface of answers. Proceedings of the VLDB Endowment 10, 7 (2017), 793--804.","DOI":"10.14778\/3067421.3067428","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-69","unstructured":"Hong Yu and Vasileios Hatzivassiloglou. 2003. Towards Answering Opinion Questions: Separating Facts from Opinions and Identifying the Polarity of Opinion Sentences. In Proceedings of 2003 Conference on Empirical Methods in Natural Language Processing (EMNLP). 129--136.","DOI":"10.3115\/1119355.1119372","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3188727-70","unstructured":"Markos Zampoglou, Symeon Papadopoulos, and Yiannis Kompatsiaris. 2017. Large-scale Evaluation of Splicing Localization Algorithms for Web Images. Multimedia Tools Appl. 76, 4 (Feb. 2017), 4801--4834. DOI:https:\/\/doi.org\/10.1007\/ s11042-016--3795--2"},{"key":"key-10.1145\/3184558.3188727-71","unstructured":"&#193;lvaro Rodrigo, Anselmo Pe&#241;as, and Felisa Verdejo. 2008. Overview of the Answer Validation Exercise 2008. In Proceedings of the 9th Workshop of the CrossLanguage Evaluation Forum, CLEF 2008. 296--313."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3188727&ftid=1958215&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T19:20:11Z","timestamp":1524079211000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":71,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3188727","relation":{"cites":[]}}}