{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:27Z","timestamp":1523998767059},"publisher-location":"New York, New York, USA","reference-count":42,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3185998","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Parabel"],"prefix":"10.1145","author":[{"given":"Yashoteja","family":"Prabhu","sequence":"first","affiliation":[{"name":"Indian Institute of Technology Delhi, New Delhi, India"}]},{"given":"Anil","family":"Kag","sequence":"additional","affiliation":[{"name":"Microsoft Research India, Bengaluru, India"}]},{"given":"Shrutendra","family":"Harsola","sequence":"additional","affiliation":[{"name":"Microsoft Bing Ads, Bengaluru, India"}]},{"given":"Rahul","family":"Agrawal","sequence":"additional","affiliation":[{"name":"Microsoft Bing Ads, Bengaluru, India"}]},{"given":"Manik","family":"Varma","sequence":"additional","affiliation":[{"name":"Microsoft Research India & Indian Institute of Technology Delhi, Bengaluru, India"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3185998-1","unstructured":"R. Agrawal, A. Gupta, Y. Prabhu, and M. Varma. 2013. Multi-label Learning with Millions of Labels: Recommending Advertiser Bid Phrases for Web Pages. In WWW."},{"key":"key-10.1145\/3178876.3185998-2","unstructured":"R. Babbar and B. Shoelkopf. 2017. DiSMEC-Distributed Sparse Machines for Extreme Multi-label Classification WSDM."},{"key":"key-10.1145\/3178876.3185998-3","unstructured":"S. Bengio, J. Weston, and D. Grangier. 2010. Label Embedding Trees for Large Multi-class Tasks. NIPS. 163--171."},{"key":"key-10.1145\/3178876.3185998-4","unstructured":"A. Bertoni, M. Goldwurm, J. Lin, and F. Sacc&#224;. 2012. Size Constrained Distance Clustering: Separation Properties and Some Complexity Results. Vol. 115 (2012), 125--139."},{"key":"key-10.1145\/3178876.3185998-5","unstructured":"K. Bhatia, H. Jain, P. Kar, M. Varma, and P. Jain. 2015. Sparse Local Embeddings for Extreme Multi-label Classification NIPS."},{"key":"key-10.1145\/3178876.3185998-6","unstructured":"P. S. Bradley, K. P. Bennett, and A. Demiriz. 2000. Constrained K-Means Clustering. Technical Report. MSR-TR-2000--65, Microsoft Research."},{"key":"key-10.1145\/3178876.3185998-7","unstructured":"Y. N. Chen and H. T. Lin. 2012. Feature-aware Label Space Dimension Reduction for Multi-label Classification NIPS."},{"key":"key-10.1145\/3178876.3185998-8","unstructured":"Y. Choi, M. Fontoura, E. Gabrilovich, V. Josifovski, M. R. Mediano, and B. Pang. [n. d.]. Using landing pages for sponsored search ad selection WWW 2010."},{"key":"key-10.1145\/3178876.3185998-9","unstructured":"M. Ciss&#233;, N. Usunier, T. Arti&#232;res, and P. Gallinari. 2013. Robust Bloom Filters for Large MultiLabel Classification Tasks NIPS."},{"key":"key-10.1145\/3178876.3185998-10","unstructured":"J. Deng, S. Satheesh, A. C. Berg, and L. Fei-Fei. 2011. Fast and Balanced: Efficient Label Tree Learning for Large Scale Object Recognition NIPS. 567--575."},{"key":"key-10.1145\/3178876.3185998-11","unstructured":"R. E. Fan, K. W. Chang, C. J. Hsieh, X. R. Wang, and C. J. Lin. 2008. LIBLINEAR: A library for large linear classification. JMLR (2008)."},{"key":"key-10.1145\/3178876.3185998-12","unstructured":"T. Gao and D. Koller. [n. d.]. Discriminative Learning of Relaxed Hierarchy for Large-scale Visual Recognition ICCV. 2072--2079."},{"key":"key-10.1145\/3178876.3185998-13","unstructured":"D. Hsu, S. Kakade, J. Langford, and T. Zhang. 2009. Multi-Label Prediction via Compressed Sensing. In NIPS."},{"key":"key-10.1145\/3178876.3185998-14","unstructured":"P. S. Huang, X. He, J. Gao, L. Deng, A. Acero, and L. P. Heck. 2013. Learning deep structured semantic models for web search using clickthrough data CIKM."},{"key":"key-10.1145\/3178876.3185998-15","unstructured":"H. Jain, Y. Prabhu, and M. Varma. 2016. Extreme Multi-label Loss Functions for Recommendation, Tagging, Ranking &#38; Other Missing Label Applications. KDD.","DOI":"10.1145\/2939672.2939756","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185998-16","unstructured":"K. Jasinska, K. Dembczynski, R. Busa-Fekete, K. Pfannschmidt, T. Klerx, and E. H&#252;llermeier. 2016. Extreme F-measure Maximization Using Sparse Probability Estimates ICML. 1435--1444."},{"key":"key-10.1145\/3178876.3185998-17","unstructured":"Y. Jernite, A. Choromanska, and D. Sontag. 2017. Simultaneous Learning of Trees and Representations for Extreme Classification and Density Estimation. In ICML."},{"key":"key-10.1145\/3178876.3185998-18","unstructured":"K. S. Jones, S. Walker, and S. E. Robertson. 2000. A probabilistic model of information retrieval: development and comparative experiments. Inf. Process. Manage. (2000)."},{"key":"key-10.1145\/3178876.3185998-19","unstructured":"Z. Lin, G. Ding, M. Hu, and J. Wang. 2014. Multi-label Classification via Feature-aware Implicit Label Space Encoding ICML."},{"key":"key-10.1145\/3178876.3185998-20","unstructured":"J. Liu, W. Chang, Y. Wu, and Y. Yang. 2017. Deep Learning for Extreme Multi-label Text Classification SIGIR. 115--124."},{"key":"key-10.1145\/3178876.3185998-21","unstructured":"C. D. Manning, P. Raghavan, and H. Sch&#252;tze. 2008. Introduction to Information Retrieval. Cambridge University Press, New York, NY, USA.","DOI":"10.1017\/CBO9780511809071","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185998-22","unstructured":"J. McAuley and J. Leskovec. 2013. Hidden factors and hidden topics: understanding rating dimensions with review text RecSys."},{"key":"key-10.1145\/3178876.3185998-23","unstructured":"E. L. Mencia and J. F&#252;rnkranz. 2008. Efficient pairwise multilabel classification for large-scale problems in the legal domain SIGIR."},{"key":"key-10.1145\/3178876.3185998-24","unstructured":"P. Mineiro and N. Karampatziakis. 2015. Fast Label Embeddings for Extremely Large Output Spaces ECML."},{"key":"key-10.1145\/3178876.3185998-25","unstructured":"A. Niculescu-Mizil and E. Abbasnejad. 2017. Label Filters for Large Scale Multilabel Classification International Conference on Artificial Intelligence and Statistics. 1448--1457."},{"key":"key-10.1145\/3178876.3185998-26","unstructured":"Y. Prabhu, A. Kag, S. Gopinath, K. Dahiya, S. Harsola, R. Agrawal, and M. Varma. 2018. Extreme multi-label learning with label features for warm-start tagging, ranking and recommendation. In WSDM.","DOI":"10.1145\/3159652.3159660","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185998-27","unstructured":"Y. Prabhu and M. Varma. 2014. FastXML: A fast, accurate and stable tree-classifier for extreme multi-label learning. In KDD.","DOI":"10.1145\/2623330.2623651","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185998-28","unstructured":"S. Ravi, A. Z. Broder, E. Gabrilovich, V. Josifovski, S. Pandey, and B. Pang. [n. d.]. Automatic generation of bid phrases for online advertising WSDM 2010."},{"key":"key-10.1145\/3178876.3185998-29","unstructured":"Y. Shen, X. He, J. Gao, L. Deng, and G. Mesnil. 2014. Learning semantic representations using convolutional neural networks for web search WWW."},{"key":"key-10.1145\/3178876.3185998-30","unstructured":"S. Si, H. Zhang, S. S. Keerthi, D. Mahajan, I. S. Dhillon, and C. J. Hsieh. 2017. Gradient Boosted Decision Trees for High Dimensional Sparse Output ICML. 3182--3190."},{"key":"key-10.1145\/3178876.3185998-31","unstructured":"Y. Tagami. 2017. AnnexML: Approximate Nearest Neighbor Search for Extreme Multi-label Classification KDD. 455--464."},{"key":"key-10.1145\/3178876.3185998-32","unstructured":"Grigorios Tsoumakas, Ioannis Katakis, and Ioannis Vlahavas. 2008. Effective and efficient multilabel classification in domains with large number of labels Proc. ECML\/PKDD 2008 Workshop on Mining Multidimensional Data."},{"key":"key-10.1145\/3178876.3185998-33","unstructured":"X. Wei and W. B. Croft. 2006. LDA-based document models for ad-hoc retrieval. In SIGIR."},{"key":"key-10.1145\/3178876.3185998-34","unstructured":"J. Weston, S. Bengio, and N. Usunier. 2011. Wsabie: Scaling Up To Large Vocabulary Image Annotation IJCAI."},{"key":"key-10.1145\/3178876.3185998-35","unstructured":"J. Weston, A. Makadia, and H. Yee. 2013. Label Partitioning For Sublinear Ranking. In ICML."},{"key":"key-10.1145\/3178876.3185998-36","unstructured":"C. Xu, D. Tao, and C. Xu. 2016. Robust Extreme Multi-label Learning. In KDD. 1275--1284.","DOI":"10.1145\/2939672.2939798","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185998-37","unstructured":"I. E. H. Yen, X. Huang, W. Dai, P. Ravikumar, I. Dhillon, and E. Xing. 2017. PPDsparse: A Parallel Primal-Dual Sparse Method for Extreme Classification KDD. 545--553."},{"key":"key-10.1145\/3178876.3185998-38","unstructured":"I. E. H. Yen, X. Huang, P. Ravikumar, K. Zhong, and I. S. Dhillon. 2016. PD-Sparse: A primal and dual sparse approach to extreme multiclass and multilabel classification. In ICML."},{"key":"key-10.1145\/3178876.3185998-39","unstructured":"W. T. Yih, J. Goodman, and V. R. Carvalho. [n. d.]. Finding advertising keywords on web pages. In WWW 2006.","DOI":"10.1145\/1135777.1135813","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185998-40","unstructured":"H. F. Yu, P. Jain, P. Kar, and I. S. Dhillon. 2014. Large-scale Multi-label Learning with Missing Labels ICML."},{"key":"key-10.1145\/3178876.3185998-41","unstructured":"W. Zhang, D. Wang, G. Xue, and H. Zha. 2012. Advertising Keywords Recommendation for Short-Text Web Pages Using Wikipedia. ACM TIST (2012)."},{"key":"key-10.1145\/3178876.3185998-42","unstructured":"W. Zhang, L. Wang, J. Yan, X. Wang, and H. Zha. 2017. Deep Extreme Multi-label Learning. CoRR (2017)."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3185998&ftid=1957385&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:18:15Z","timestamp":1523639895000},"score":1.0,"subtitle":["Partitioned Label Trees for Extreme Classification with Application to Dynamic Search Advertising"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":42,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3185998","relation":{"cites":[]}}}