{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:29Z","timestamp":1523998769204},"publisher-location":"New York, New York, USA","reference-count":45,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"funder":[{"name":"National Science Foundation","award":["IIS-1715940","IIS-1714741"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186077","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Hierarchical Variational Memory Network for Dialogue Generation"],"prefix":"10.1145","author":[{"given":"Hongshen","family":"Chen","sequence":"first","affiliation":[{"name":"JD.com, Beijing, China"}]},{"given":"Zhaochun","family":"Ren","sequence":"additional","affiliation":[{"name":"JD.com, Beijing, China"}]},{"given":"Jiliang","family":"Tang","sequence":"additional","affiliation":[{"name":"Michigan State University, East Lansing, MI, USA"}]},{"given":"Yihong Eric","family":"Zhao","sequence":"additional","affiliation":[{"name":"JD.com, Beijing, CA, China"}]},{"given":"Dawei","family":"Yin","sequence":"additional","affiliation":[{"name":"JD.com, Beijing, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186077-1","unstructured":"D. Ameixa, L. Coheur, P. Fialho, and P. Quaresma. Luke, I am Your Father: Dealing with Out-of-Domain Requests by Using Movies Subtitles. Springer International Publishing, 2014."},{"key":"key-10.1145\/3178876.3186077-2","unstructured":"R. E. Banchs and H. Li. Iris: a chat-oriented dialogue system based on the vector space model. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics, pages 37--42, 2013."},{"key":"key-10.1145\/3178876.3186077-3","unstructured":"J. Bayer and C. Osendorfer. Learning stochastic recurrent networks. In NIPS, Workshop on Advances in Variational Inference, 2014."},{"key":"key-10.1145\/3178876.3186077-4","unstructured":"A. Bordes and J. Weston. Learning end-to-end goal-oriented dialog. In Proceedings of the 5th International Conference on Learning Representations, 2017."},{"key":"key-10.1145\/3178876.3186077-5","unstructured":"S. R. Bowman, L. Vilnis, O. Vinyals, A. M. Dai, R. Jozefowicz, and S. Bengio. Generating sentences from a continuous space. In Proceedings of 20th SIGNLL Conference on Computational Natural Language Learning, pages 10--21, 2015."},{"key":"key-10.1145\/3178876.3186077-6","unstructured":"K. Cao and S. Clark. Latent variable dialogue models and their diversity. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics, pages 182--187, 2017.","DOI":"10.18653\/v1\/E17-2029","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-7","unstructured":"H. Chen, X. Liu, D. Yin, and J. Tang. A survey on dialogue systems: Recent advances and new frontiers. ACM SIGKDD Explorations Newsletter, 19 (2), 2017."},{"key":"key-10.1145\/3178876.3186077-8","unstructured":"J. Cheng, L. Dong, and M. Lapata. Long short-term memory-networks for machine reading. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pages 551--561, 2016.","DOI":"10.18653\/v1\/D16-1053","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-9","unstructured":"K. Cho, B. van Merrienboer, C. Gulcehre, D. Bahdanau, F. Bougares, H. Schwenk, and Y. Bengio. Learning phrase representations using rnn encoder--decoder for statistical machine translation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 1724--1734, Doha, Qatar, October 2014. Association for Computational Linguistics.","DOI":"10.3115\/v1\/D14-1179","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-10","unstructured":"J. Chung, K. Kastner, L. Dinh, K. Goel, A. C. Courville, and Y. Bengio. A recurrent latent variable model for sequential data. In C. Cortes, N. D. Lawrence, D. D. Lee, M. Sugiyama, and R. Garnett, editors, Advances in Neural Information Processing Systems 28, pages 2980--2988, 2015."},{"key":"key-10.1145\/3178876.3186077-11","unstructured":"G. Forgues, J. Pineau, J.-M. Larchev&#234;que, and R. Tremblay. Bootstrapping dialog systems with word embeddings. In NIPS, Modern Machine Learning and Natural Language Processing Workshop, 2014."},{"key":"key-10.1145\/3178876.3186077-12","unstructured":"M. Ghazvininejad, C. Brockett, M.-W. Chang, B. Dolan, J. Gao, W.-t. Yih, and M. Galley. A knowledge-grounded neural conversation model. arXiv preprint arXiv:1702.01932, 2017."},{"key":"key-10.1145\/3178876.3186077-13","unstructured":"D. Graff and K. Chen. Chinese gigaword. LDC Catalog No.: LDC2003T09, ISBN, 1: 58563--58230, 2005."},{"key":"key-10.1145\/3178876.3186077-14","unstructured":"A. Graves, G. Wayne, and I. Danihelka. Neural turing machines. arXiv preprint arXiv:1410.5401, 2014."},{"key":"key-10.1145\/3178876.3186077-15","unstructured":"K. Gregor, I. Danihelka, A. Graves, D. J. Rezende, and D. Wierstra. Draw: A recurrent neural network for image generation. In Proceedings of the 32nd International Conference on International Conference on Machine Learning, pages 1462--1471, 2015."},{"key":"key-10.1145\/3178876.3186077-16","unstructured":"S. Hochreiter and J. Schmidhuber. Long short-term memory. Neural Computation, 9 (8): 1735--1780, 1997.","DOI":"10.1162\/neco.1997.9.8.1735","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-17","unstructured":"D. P. Kingma and J. Ba. Adam: A method for stochastic optimization. ICLR, 2015."},{"key":"key-10.1145\/3178876.3186077-18","unstructured":"D. P. Kingma and M. Welling. Auto-encoding variational bayes. ICLR, 2014."},{"key":"key-10.1145\/3178876.3186077-19","unstructured":"D. P. Kingma, D. J. Rezende, S. Mohamed, and M. Welling. Semi-supervised learning with deep generative models. Advances in Neural Information Processing Systems, 4: 3581--3589, 2014."},{"key":"key-10.1145\/3178876.3186077-20","unstructured":"J. Li, M. Galley, C. Brockett, J. Gao, and B. Dolan. A diversity-promoting objective function for neural conversation models. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics, pages 110--119, 2016 a.","DOI":"10.18653\/v1\/N16-1014","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-21","unstructured":"Li, Galley, Brockett, Spithourakis, Gao, and Dolan]li2016bJ. Li, M. Galley, C. Brockett, G. Spithourakis, J. Gao, and B. Dolan. A persona-based neural conversation model. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics, pages 994--1003, 2016 b."},{"key":"key-10.1145\/3178876.3186077-22","unstructured":"J. Li, M. Galley, C. Brockett, G. Spithourakis, J. Gao, and B. Dolan. A persona-based neural conversation model. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics, pages 994--1003, 2016.","DOI":"10.18653\/v1\/P16-1094","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-23","unstructured":"P. Li, Z. Wang, W. Lam, Z. Ren, and L. Bing. Salience estimation via variational auto-encoders for multi-document summarization. In Proceedings of the 31st AAAI Conference on Artificial Intelligence, pages 3497--3503, 2017."},{"key":"key-10.1145\/3178876.3186077-24","unstructured":"C.-Y. Lin. Rouge: A package for automatic evaluation of summaries. In S. S. Marie-Francine Moens, editor, Text Summarization Branches Out: Proceedings of the ACL-04 Workshop, pages 74--81, Barcelona, Spain, July 2004. Association for Computational Linguistics."},{"key":"key-10.1145\/3178876.3186077-25","unstructured":"C. W. Liu, R. Lowe, I. Serban, M. Noseworthy, L. Charlin, and J. Pineau. How not to evaluate your dialogue system: An empirical study of unsupervised evaluation metrics for dialogue response generation. In Conference on Empirical Methods in Natural Language Processing, pages 2122--2132, 2016.","DOI":"10.18653\/v1\/D16-1230","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-26","unstructured":"R. Lowe, N. Pow, I. Serban, and J. Pineau. The ubuntu dialogue corpus: A large dataset for research in unstructured multi-turn dialogue systems. In Proceedings of the 16th Annual Meeting of the Special Interest Group on Discourse and Dialogue, pages 285--294, 2015.","DOI":"10.18653\/v1\/W15-4640","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-27","unstructured":"J. Mitchell and M. Lapata. Vector-based models of semantic composition. In Proceedings of The 46th Annual Meeting of the Association for Computational Linguistics, pages 236--244, 2008."},{"key":"key-10.1145\/3178876.3186077-28","unstructured":"K. Papineni, S. Roukos, T. Ward, and W. J. Zhu. Bleu: a method for automatic evaluation of machine translation. In Meeting on Association for Computational Linguistics, pages 311--318, 2002."},{"key":"key-10.1145\/3178876.3186077-29","unstructured":"Z. Ren, H. Song, P. Li, S. Liang, J. Ma, and M. de Rijke. Using sparse coding for answer summarization in non-factoid community question-answering. In SIGIR Workshop: Web Question Answering, Beyond Factoids, 2016."},{"key":"key-10.1145\/3178876.3186077-30","unstructured":"A. Ritter, C. Cherry, and W. B. Dolan. Data-driven response generation in social media. In Proceedings of the 2011 Conference on Empirical Methods in Natural Language Processing, pages 583--593, 2011."},{"key":"key-10.1145\/3178876.3186077-31","unstructured":"V. Rus and M. Lintean. A comparison of greedy and optimal assessment of natural language student input using word-to-word similarity metrics. In Proceedings of the Seventh Workshop on Building Educational Applications Using NLP, pages 157--162, 2012."},{"key":"key-10.1145\/3178876.3186077-32","unstructured":"I. Serban, A. Sordoni, R. Lowe, L. Charlin, J. Pineau, A. Courville, and Y. Bengio. A hierarchical latent variable encoder-decoder model for generating dialogues. In Proceedings of the 31st AAAI Conference on Artificial Intelligence, 2017."},{"key":"key-10.1145\/3178876.3186077-33","unstructured":"I. V. Serban, A. Sordoni, Y. Bengio, A. C. Courville, and J. Pineau. Building end-to-end dialogue systems using generative hierarchical neural network models. In Proceedings of the 30th AAAI Conference on Artificial Intelligence, pages 3776--3784, 2016."},{"key":"key-10.1145\/3178876.3186077-34","unstructured":"L. Shang, Z. Lu, and H. Li. Neural responding machine for short-text conversation. In Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Conference on Natural Language Processing, pages 1577--1586, 2015.","DOI":"10.3115\/v1\/P15-1152","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-35","unstructured":"B. A. Shawar and E. Atwell. Chatbots: are they really useful? Ldv Forum, 22 (1): 29--49, 2007."},{"key":"key-10.1145\/3178876.3186077-36","unstructured":"H. Song, Z. Ren, S. Liang, P. Li, J. Ma, and M. de Rijke. Summarizing answers in non-factoid community question-answering. In Proceedings of the 10th ACM International Conference on Web Search and Data Mining, pages 405--414, 2017.","DOI":"10.1145\/3018661.3018704","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-37","unstructured":"A. Sordoni, Y. Bengio, H. Vahabi, C. Lioma, J. Grue Simonsen, and J.-Y. Nie. A hierarchical recurrent encoder-decoder for generative context-aware query suggestion. In Proceedings of the 24th ACM International on Conference on Information and Knowledge Management, pages 553--562, 2015 a.","DOI":"10.1145\/2806416.2806493","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-38","unstructured":"A. Sordoni, M. Galley, M. Auli, C. Brockett, Y. Ji, M. Mitchell, J.-Y. Nie, J. Gao, and B. Dolan. A neural network approach to context-sensitive generation of conversational responses. In Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics, pages 196--205, 2015.","DOI":"10.3115\/v1\/N15-1020","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-39","unstructured":"Sukhbaatar, Weston, Fergus, et al.]sukhbaatar2015endS. Sukhbaatar, J. Weston, R. Fergus, et al. End-to-end memory networks. In Advances in neural information processing systems, pages 2440--2448, 2015."},{"key":"key-10.1145\/3178876.3186077-40","unstructured":"S. Sukhbaatar, J. Weston, R. Fergus, et al. End-to-end memory networks. In Advances in neural information processing systems, pages 2440--2448, 2015."},{"key":"key-10.1145\/3178876.3186077-41","unstructured":"O. Vinyals and Q. Le. A neural conversational model. In ICML Deep Learning Workshop, 2015."},{"key":"key-10.1145\/3178876.3186077-42","unstructured":"M. Wang, Z. Lu, H. Li, and Q. Liu. Memory-enhanced decoder for neural machine translation. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pages 278--286, Austin, Texas, November 2016. Association for Computational Linguistics.","DOI":"10.18653\/v1\/D16-1027","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-43","unstructured":"Y. Wu, W. Wu, C. Xing, M. Zhou, and Z. Li. Sequential matching network: A new architecture for multi-turn response selection in retrieval-based chatbots. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics, pages 496--505, 2017.","DOI":"10.18653\/v1\/P17-1046","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-44","unstructured":"S. Young, M. Gavsi&#263;, B. Thomson, and J. D. Williams. Pomdp-based statistical spoken dialog systems: A review. Proceedings of the IEEE, 101 (5): 1160--1179, 2013.","DOI":"10.1109\/JPROC.2012.2225812","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186077-45","unstructured":"Y. Zhang and S. Clark. Syntactic processing using the generalized perceptron and beam search. Computational linguistics, 37 (1): 105--151, 2011.","DOI":"10.1162\/coli_a_00037","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186077&ftid=1957406&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T18:17:14Z","timestamp":1523643434000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":45,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186077","relation":{"cites":[]}}}