{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719566},"publisher-location":"New York, New York, USA","reference-count":31,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"Shanghai Science and Technology Commission","award":["1751110420"]},{"name":"National Natural Science Foundation of China","award":["61472087"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186353","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Perceiving Commerial Activeness Over Satellite Images"],"prefix":"10.1145","author":[{"given":"Zhiyuan","family":"He","sequence":"first","affiliation":[{"name":"Fudan University, Shanghai, China"}]},{"given":"Su","family":"Yang","sequence":"additional","affiliation":[{"name":"Fudan University, Shanghai, China"}]},{"given":"Weishan","family":"Zhang","sequence":"additional","affiliation":[{"name":"China University of Petroleum, Qingdao, China"}]},{"given":"Jiulong","family":"Zhang","sequence":"additional","affiliation":[{"name":"Xian University of Technology, Xian, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186353-1","unstructured":"Mart'&#305;n Abadi, Ashish Agarwal, Paul Barham, Eugene Brevdo, Zhifeng Chen, Craig Citro, Greg S Corrado, Andy Davis, Jeffrey Dean, Matthieu Devin, et almbox. 2016. Tensorflow: Large-scale machine learning on heterogeneous distributed systems. arXiv preprint arXiv:1603.04467 (2016)."},{"key":"key-10.1145\/3184558.3186353-2","unstructured":"Adrian Albert, Jasleen Kaur, and Marta Gonzalez. 2017. Using convolutional networks and satellite imagery to identify patterns in urban environments at a large scale. arXiv preprint arXiv:1704.02965 (2017)."},{"key":"key-10.1145\/3184558.3186353-3","unstructured":"Sean M Arietta, Alexei A Efros, Ravi Ramamoorthi, and Maneesh Agrawala. 2014. City forensics: Using visual elements to predict non-visual city attributes. IEEE transactions on visualization and computer graphics Vol. 20, 12 (2014), 2624--2633."},{"key":"key-10.1145\/3184558.3186353-4","unstructured":"Michael J Barnsley and Stuart L Barr. 1996. Inferring urban land use from satellite sensor images using kernel-based spatial reclassification. Photogrammetric engineering and remote sensing Vol. 62, 8 (1996), 949--958."},{"key":"key-10.1145\/3184558.3186353-5","unstructured":"Tianqi Chen and Carlos Guestrin. 2016. XGBoost: A Scalable Tree Boosting System. In ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. 785--794.","DOI":"10.1145\/2939672.2939785","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-6","unstructured":"Corinna Cortes and Vladimir Vapnik. 1995. Support-vector networks. Machine learning Vol. 20, 3 (1995), 273--297.","DOI":"10.1007\/BF00994018","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-7","unstructured":"Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. 2009. Imagenet: A large-scale hierarchical image database Computer Vision and Pattern Recognition, 2009. CVPR 2009. IEEE Conference on. IEEE, 248--255."},{"key":"key-10.1145\/3184558.3186353-8","unstructured":"Carl Doersch, Saurabh Singh, Abhinav Gupta, Josef Sivic, and Alexei Efros. 2012. What makes Paris look like Paris ACM Transactions on Graphics Vol. 31, 4 (2012).","DOI":"10.1145\/2185520.2185597","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-9","unstructured":"Harris Drucker, Christopher JC Burges, Linda Kaufman, Alex J Smola, and Vladimir Vapnik. 1997. Support vector regression machines. In Advances in neural information processing systems. 155--161."},{"key":"key-10.1145\/3184558.3186353-10","unstructured":"Jill A Engel-Cox, Christopher H Holloman, Basil W Coutant, and Raymond M Hoff. 2004. Qualitative and quantitative evaluation of MODIS satellite sensor data for regional and urban scale air quality. Atmospheric Environment Vol. 38, 16 (2004), 2495--2509."},{"key":"key-10.1145\/3184558.3186353-11","unstructured":"Jerome H Friedman. 2001. Greedy function approximation: a gradient boosting machine. Annals of statistics (2001), 1189--1232."},{"key":"key-10.1145\/3184558.3186353-12","unstructured":"Jerome H Friedman. 2002. Stochastic gradient boosting. Computational Statistics &#38; Data Analysis Vol. 38, 4 (2002), 367--378."},{"key":"key-10.1145\/3184558.3186353-13","unstructured":"Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition. 770--778.","DOI":"10.1109\/CVPR.2016.90","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-14","unstructured":"Sergey Ioffe and Christian Szegedy. 2015. Batch normalization: Accelerating deep network training by reducing internal covariate shift. In International Conference on Machine Learning. 448--456."},{"key":"key-10.1145\/3184558.3186353-15","unstructured":"Neal Jean, Marshall Burke, Michael Xie, W Matthew Davis, David B Lobell, and Stefano Ermon. 2016. Combining satellite imagery and machine learning to predict poverty. Science Vol. 353, 6301 (2016), 790--794.","DOI":"10.1126\/science.aaf7894","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-16","unstructured":"Aditya Khosla, Byoungkwon An An, Joseph J Lim, and Antonio Torralba. 2014. Looking beyond the visible scene. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 3710--3717."},{"key":"key-10.1145\/3184558.3186353-17","unstructured":"Alex Krizhevsky, Ilya Sutskever, and Geoffrey E Hinton. 2012. Imagenet classification with deep convolutional neural networks Advances in neural information processing systems. 1097--1105."},{"key":"key-10.1145\/3184558.3186353-18","unstructured":"Yueliang Ma and Ruisong Xu. 2010. Remote sensing monitoring and driving force analysis of urban expansion in Guangzhou City, China. Habitat International Vol. 34, 2 (2010), 228--235.","DOI":"10.1016\/j.habitatint.2009.09.007","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-19","unstructured":"N Naik, S. D. Kominers, R Raskar, E. L. Glaeser, and C. A. Hidalgo. 2017. Computer vision uncovers predictors of physical urban change. Proceedings of the National Academy of Sciences of the United States of America (2017)."},{"key":"key-10.1145\/3184558.3186353-20","unstructured":"Nikhil Naik, Jade Philipoom, Ramesh Raskar, and C&#233;sar Hidalgo. 2014. Streetscore-predicting the perceived safety of one million streetscapes Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition Workshops. 779--785."},{"key":"key-10.1145\/3184558.3186353-21","unstructured":"Alameen Najjar, Shun'ichi Kaneko, and Yoshikazu Miyanaga. 2017. Combining Satellite Imagery and Open Data to Map Road Safety. AAAI. 4524--4530."},{"key":"key-10.1145\/3184558.3186353-22","unstructured":"Lorenzo Porzi, Samuel Rota Bul&#242;, Bruno Lepri, and Elisa Ricci. 2015. Predicting and understanding urban perception with convolutional neural networks Proceedings of the 23rd ACM international conference on Multimedia. ACM, 139--148."},{"key":"key-10.1145\/3184558.3186353-23","unstructured":"Karen Simonyan and Andrew Zisserman. 2014. Very deep convolutional networks for large-scale image recognition. arXiv preprint arXiv:1409.1556 (2014)."},{"key":"key-10.1145\/3184558.3186353-24","unstructured":"William L Stefanov, Michael S Ramsey, and Philip R Christensen. 2001. Monitoring urban land cover change: An expert system approach to land cover classification of semiarid to arid urban centers. Remote sensing of Environment Vol. 77, 2 (2001), 173--185."},{"key":"key-10.1145\/3184558.3186353-25","unstructured":"Christian Szegedy, Sergey Ioffe, Vincent Vanhoucke, and Alexander A Alemi. 2017. Inception-v4, Inception-ResNet and the Impact of Residual Connections on Learning. AAAI. 4278--4284."},{"key":"key-10.1145\/3184558.3186353-26","unstructured":"Christian Szegedy, Wei Liu, Yangqing Jia, Pierre Sermanet, Scott Reed, Dragomir Anguelov, Dumitru Erhan, Vincent Vanhoucke, and Andrew Rabinovich. 2015. Going deeper with convolutions. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1--9.","DOI":"10.1109\/CVPR.2015.7298594","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-27","unstructured":"Christian Szegedy, Vincent Vanhoucke, Sergey Ioffe, Jon Shlens, and Zbigniew Wojna. 2016. Rethinking the inception architecture for computer vision Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2818--2826."},{"key":"key-10.1145\/3184558.3186353-28","unstructured":"Tijmen Tieleman and Geoffrey Hinton. 2012. Lecture 6.5-rmsprop: Divide the gradient by a running average of its recent magnitude. COURSERA: Neural networks for machine learning Vol. 4, 2 (2012), 26--31."},{"key":"key-10.1145\/3184558.3186353-29","unstructured":"Su Yang, Minjie Wang, Wenshan Wang, Yi Sun, Jun Gao, Weishan Zhang, and Jiulong Zhang. 2017. Predicting Commercial Activeness over Urban Big Data. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies Vol. 1, 3 (2017), 119.","DOI":"10.1145\/3130983","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-30","unstructured":"Liangpei Zhang, Lefei Zhang, and Bo Du. 2016. Deep learning for remote sensing data: A technical tutorial on the state of the art. IEEE Geoscience and Remote Sensing Magazine Vol. 4, 2 (2016), 22--40.","DOI":"10.1109\/MGRS.2016.2540798","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186353-31","unstructured":"Bolei Zhou, Liu Liu, Aude Oliva, and Antonio Torralba. 2014. Recognizing city identity via attribute analysis of geo-tagged images European conference on computer vision. Springer, 519--534."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186353&ftid=1958133&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T19:03:55Z","timestamp":1524078235000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":31,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186353","relation":{"cites":[]}}}