{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719276},"publisher-location":"New York, New York, USA","reference-count":51,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186242","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Processing Social Media Messages in Mass Emergency"],"prefix":"10.1145","author":[{"given":"Muhammad","family":"Imran","sequence":"first","affiliation":[{"name":"Qatar Computing Research Institute, Doha, Qatar"}]},{"given":"Carlos","family":"Castillo","sequence":"additional","affiliation":[{"name":"Universitat Pompeu Fabra, Barcelona, Spain"}]},{"given":"Fernando","family":"Diaz","sequence":"additional","affiliation":[{"name":"Spotify, New York, NY, USA"}]},{"given":"Sarah","family":"Vieweg","sequence":"additional","affiliation":[{"name":"Qatar Computing Research Institute, Doha, Qatar"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186242-1","unstructured":"Mohammed Ali Al-garadi, Muhammad Sadiq Khan, Kasturi Dewi Varathan, Ghulam Mujtaba, and Abdelkodose M Al-Kabsi. 2016. Using online social networks to track a pandemic: A systematic review. Journal of biomedical informatics Vol. 62 (2016), 1--11.","DOI":"10.1016\/j.jbi.2016.05.005","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-2","unstructured":"Firoj Alam, Muhammad Imran, and Ferda Ofli. 2017. Image4Act: Online Social Media Image Processing for Disaster Response. Proc. of ASONAM. 1--4.","DOI":"10.1145\/3110025.3110164","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-3","unstructured":"James Allan. 2012. Topic detection and tracking: event-based information organization. Vol. Vol. 12. Springer Science &#38; Business Media."},{"key":"key-10.1145\/3184558.3186242-4","unstructured":"Javed Aslam, Fernando Diaz, Matthew Ekstrand-Abueg, Richard McCreadie, Virgil Pavlu, and Tetsuya Sakai. 2015. TREC 2014 temporal summarization track overview. Technical Report. NIST."},{"key":"key-10.1145\/3184558.3186242-5","unstructured":"Marco Avvenuti, Stefano Cresci, Andrea Marchetti, Carlo Meletti, and Maurizio Tesconi. 2014. EARS (earthquake alert and report system): a real time decision support system for earthquake crisis management. In Proc. of KDD. ACM, 1749--1758.","DOI":"10.1145\/2623330.2623358","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-6","unstructured":"Michele Berlingerio, Francesco Calabrese, Giusy Di Lorenzo, Xiaowen Dong, Yiannis Gkoufas, and Dimitrios Mavroeidis. 2013. SaferCity: a system for detecting and analyzing incidents from social media Proc. of ICDM Workshops. IEEE, 1077--1080."},{"key":"key-10.1145\/3184558.3186242-7","unstructured":"Jingwen Bian, Yang Yang, and Tat-Seng Chua. 2013. Multimedia summarization for trending topics in microblogs Proc. of CIKM. ACM, 1807--1812."},{"key":"key-10.1145\/3184558.3186242-8","unstructured":"Carlos Castillo. 2016. Big crisis data: social media in disasters and time-critical situations. Cambridge University Press.","DOI":"10.1017\/CBO9781316476840","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-9","unstructured":"Carlos Castillo, Marcelo Mendoza, and Barbara Poblete. 2011. Information credibility on twitter. In Proc. of WWW. ACM, 675--684.","DOI":"10.1145\/1963405.1963500","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-10","unstructured":"Tao Chen, Dongyuan Lu, Min-Yen Kan, and Peng Cui. 2013. Understanding and classifying image tweets. In Proc. of ACM MM. ACM, 781--784.","DOI":"10.1145\/2502081.2502203","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-11","unstructured":"Soudip Roy Chowdhury, Muhammad Imran, Muhammad Rizwan Asghar, Sihem Amer-Yahia, and Carlos Castillo. 2013. Tweet4act: Using incident-specific profiles for classifying crisis-related messages. Proc. of ISCRAM."},{"key":"key-10.1145\/3184558.3186242-12","unstructured":"Courtney D Corley, Chase Dowling, Stuart J Rose, and Taylor McKenzie. 2013. Social sensor analytics: Measuring phenomenology at scale Proc. of ISI. IEEE, 61--66."},{"key":"key-10.1145\/3184558.3186242-13","unstructured":"John Harrald and Theresa Jefferson. 2007. Shared situational awareness in emergency management mitigation and response Proc. of HICSS. IEEE, 23--23."},{"key":"key-10.1145\/3184558.3186242-14","unstructured":"Amanda L Hughes and Leysia Palen. 2012. The evolving role of the public information officer: An examination of social media in emergency management. J. of Homeland Security and Emergency Management, Vol. 9, 1 (2012)."},{"key":"key-10.1145\/3184558.3186242-15","unstructured":"Amanda L Hughes, Steve Peterson, and Leysia Palen. 2014 a. Social media in emergency management. Issues in Disaster Science and Management: A Critical Dialogue Between Scientists and Emergency Managers (2014)."},{"key":"key-10.1145\/3184558.3186242-16","unstructured":"Amanda L Hughes, Lise AA St Denis, Leysia Palen, and Kenneth M Anderson. 2014 b. Online public communications by police &#38; fire services during the 2012 Hurricane Sandy Proc. of SIGCHI. ACM, 1505--1514."},{"key":"key-10.1145\/3184558.3186242-17","unstructured":"Muhammad Imran and Carlos Castillo. 2015. Towards a data-driven approach to identify crisis-related topics in social media streams Proc. of WWW. ACM, 1205--1210."},{"key":"key-10.1145\/3184558.3186242-18","unstructured":"Muhammad Imran, Carlos Castillo, Fernando Diaz, and Sarah Vieweg. 2015. Processing social media messages in mass emergency: A survey. ACM Computing Surveys (CSUR) Vol. 47, 4 (2015), 67.","DOI":"10.1145\/2771588","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-19","unstructured":"Muhammad Imran, Carlos Castillo, Ji Lucas, Patrick Meier, and Sarah Vieweg. 2014. AIDR: Artificial intelligence for disaster response Proc. of WWW. ACM, 159--162.","DOI":"10.1145\/2567948.2577034","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-20","unstructured":"Muhammad Imran, Sanjay Chawla, and Carlos Castillo. 2016 a. A robust framework for classifying evolving document streams in an expert-machine-crowd setting. In Proc. of ICDM. IEEE, 961--966.","DOI":"10.1109\/ICDM.2016.0120","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-21","unstructured":"Muhammad Imran, Prasenjit Mitra, and Carlos Castillo. 2016 b. Twitter as a Lifeline: Human-annotated Twitter Corpora for NLP of Crisis-related Messages Proceedings of the Tenth International Conference on Language Resources and Evaluation (LREC 2016) (23--28). European Language Resources Association (ELRA), Paris, France."},{"key":"key-10.1145\/3184558.3186242-22","unstructured":"Muhammad Imran, Prasenjit Mitra, and Jaideep Srivastava. 2016 c. Enabling Rapid Classification of Social Media Communications During Crises. Int. J. of Inf. Sys. for Crisis Response and Management, Vol. 8, 3 (2016), 1--17."},{"key":"key-10.1145\/3184558.3186242-23","unstructured":"Chris Kedzie, Kathleen McKeown, and Fernando Diaz. 2014. Summarizing disasters over time. In Proc. of KDD Workshops."},{"key":"key-10.1145\/3184558.3186242-24","unstructured":"Chris Kedzie, Kathleen McKeown, and Fernando Diaz. 2015. Predicting Salient Updates for Disaster Summarization. Proc. of ACL.","DOI":"10.3115\/v1\/P15-1155","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-25","unstructured":"Yuan Liang, James Caverlee, and John Mander. 2013. Text vs. images: on the viability of social media to assess earthquake damage Proc. of WWW. ACM, 1003--1006.","DOI":"10.1145\/2487788.2488102","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-26","unstructured":"Alan M MacEachren, Anuj Jaiswal, Anthony C Robinson, Scott Pezanowski, Alexander Savelyev, Prasenjit Mitra, Xiao Zhang, and Justine Blanford. 2011. Senseplace2: Geotwitter analytics support for situational awareness Proc. of VAST. IEEE, 181--190."},{"key":"key-10.1145\/3184558.3186242-27","unstructured":"Patrick Meier. 2015. Digital humanitarians: how big data is changing the face of humanitarian response. CRC Press.","DOI":"10.1201\/b18023","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-28","unstructured":"Leonardo Neumeyer, Bruce Robbins, Anish Nair, and Anand Kesari. 2010. S4: Distributed stream computing platform. In Proc. of ICDM Workshops. IEEE, 170--177.","DOI":"10.1109\/ICDMW.2010.172","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-29","unstructured":"Dat Tien Nguyen, Kamla Al-Mannai, Shafiq R Joty, Hassan Sajjad, Muhammad Imran, and Prasenjit Mitra. 2017 a. Robust Classification of Crisis-Related Data on Social Networks Using Convolutional Neural Networks. In Proc. of ICWSM. 632--635."},{"key":"key-10.1145\/3184558.3186242-30","unstructured":"Dat Tien Nguyen, Firoj Alam, Ferda Ofli, and Muhammad Imran. 2017 b. Automatic Image Filtering on Social Networks Using Deep Learning and Perceptual Hashing During Crises. In Proc. of ISCRAM."},{"key":"key-10.1145\/3184558.3186242-31","unstructured":"Dat Tien Nguyen, Shafiq Joty, Muhammad Imran, Hassan Sajjad, and Prasenjit Mitra. 2016 a. Applications of Online Deep Learning for Crisis Response Using Social Media Information. arXiv preprint arXiv:1610.01030 (2016)."},{"key":"key-10.1145\/3184558.3186242-32","unstructured":"Dat Tien Nguyen, Kamela Ali Al Mannai, Shafiq Joty, Hassan Sajjad, Muhammad Imran, and Prasenjit Mitra. 2016 b. Rapid Classification of Crisis-Related Data on Social Networks using Convolutional Neural Networks. arXiv preprint arXiv:1608.03902 (2016)."},{"key":"key-10.1145\/3184558.3186242-33","unstructured":"Dat Tien Nguyen, Ferda Ofli, Muhammad Imran, and Prasenjit Mitra. 2017 c. Damage Assessment from Social Media Imagery Data During Disasters Proc. of ASONAM. 1--8."},{"key":"key-10.1145\/3184558.3186242-34","unstructured":"Ferda Ofli, Patrick Meier, Muhammad Imran, Carlos Castillo, Devis Tuia, Nicolas Rey, Julien Briant, Pauline Millet, Friedrich Reinhard, Matthew Parkan, et almbox. 2016. Combining human computing and machine learning to make sense of big (aerial) data for disaster response. Big data, Vol. 4, 1 (2016), 47--59."},{"key":"key-10.1145\/3184558.3186242-35","unstructured":"Alexandra Olteanu, Carlos Castillo, Fernando Diaz, and Sarah Vieweg. 2014. CrisisLex: A Lexicon for Collecting and Filtering Microblogged Communications in Crises. Proc. of ICWSM."},{"key":"key-10.1145\/3184558.3186242-36","unstructured":"Robin Peters and Porto de Albuqerque Joao. 2015. Investigating images as indicators for relevant social media messages in disaster management Proc. of ISCRAM."},{"key":"key-10.1145\/3184558.3186242-37","unstructured":"Robert Power, Bella Robinson, John Colton, and Mark Cameron. 2014. Emergency situation awareness: Twitter case studies Proc. of ISCRAM MED. Springer, 218--231."},{"key":"key-10.1145\/3184558.3186242-38","unstructured":"Hemant Purohit and Amit P Sheth. 2013. Twitris v3: From Citizen Sensing to Analysis, Coordination and Action. Proc. of ICWSM."},{"key":"key-10.1145\/3184558.3186242-39","unstructured":"Vahed Qazvinian, Emily Rosengren, Dragomir R Radev, and Qiaozhu Mei. 2011. Rumor has it: Identifying misinformation in microblogs Proc. of EMNLP. Association for Computational Linguistics, 1589--1599."},{"key":"key-10.1145\/3184558.3186242-40","unstructured":"Alan Ritter, Oren Etzioni, Sam Clark, et almbox. 2012. Open domain event extraction from twitter. In Proc. of KDD. ACM, 1104--1112.","DOI":"10.1145\/2339530.2339704","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-41","unstructured":"Bella Robinson, Robert Power, and Mark Cameron. 2013. A sensitive twitter earthquake detector. In Proc. of WWW. ACM, 999--1002.","DOI":"10.1145\/2487788.2488101","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-42","unstructured":"Jakob Rogstadius, Maja Vukovic, CA Teixeira, Vassilis Kostakos, Evangelos Karapanos, and Jim Alain Laredo. 2013. CrisisTracker: Crowdsourced social media curation for disaster awareness. IBM J. of Research and Development Vol. 57, 5 (2013), 4--1."},{"key":"key-10.1145\/3184558.3186242-43","unstructured":"Koustav Rudra, Siddhartha Banerjee, Niloy Ganguly, Pawan Goyal, Muhammad Imran, and Prasenjit Mitra. 2016. Summarizing Situational and Topical Information During Crises. arXiv preprint arXiv:1610.01561 (2016)."},{"key":"key-10.1145\/3184558.3186242-44","unstructured":"Koustav Rudra, Ashish Sharma, Niloy Ganguly, and Muhammad Imran. 2017. Classifying Information from Microblogs during Epidemics Proceedings of the 2017 International Conference on Digital Health. ACM, 104--108."},{"key":"key-10.1145\/3184558.3186242-45","unstructured":"Takeshi Sakaki, Makoto Okazaki, and Yutaka Matsuo. 2010. Earthquake shakes Twitter users: real-time event detection by social sensors Proc. of WWW. ACM, 851--860.","DOI":"10.1145\/1772690.1772777","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-46","unstructured":"Diane H Sonnenwald and Linda G Pierce. 2000. Information behavior in dynamic group work contexts: interwoven situational awareness, dense social networks and contested collaboration in command and control. Inf. Proc. &#38; Mgmt., Vol. 36, 3 (2000), 461--479.","DOI":"10.1016\/S0306-4573(99)00039-4","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-47","unstructured":"Kate Starbird, Leysia Palen, Amanda L Hughes, and Sarah Vieweg. 2010. Chatter on the red: what hazards threat reveals about the social life of microblogged information. In Proc. of CSCW. ACM, 241--250."},{"key":"key-10.1145\/3184558.3186242-48","unstructured":"Sarah Vieweg, Carlos Castillo, and Muhammad Imran. 2014. Integrating social media communications into the rapid assessment of sudden onset disasters Proc. of SOCINFO. Springer, 444--461."},{"key":"key-10.1145\/3184558.3186242-49","unstructured":"Sarah Vieweg, Amanda L Hughes, Kate Starbird, and Leysia Palen. 2010. Microblogging during two natural hazards events: what twitter may contribute to situational awareness. In Proc. of SIGCHI. ACM, 1079--1088.","DOI":"10.1145\/1753326.1753486","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186242-50","unstructured":"Jianshu Weng and Bu-Sung Lee. 2011. Event detection in twitter. Proc. of ICWSM Vol. 11 (2011), 401--408."},{"key":"key-10.1145\/3184558.3186242-51","unstructured":"Shize Xu, Liang Kong, and Yan Zhang. 2012. A picture paints a thousand words: a method of generating image-text timelines Proc. of CIKM. ACM, 2511--2514.","DOI":"10.1145\/2396761.2398679","doi-asserted-by":"crossref"}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186242&ftid=1958220&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T19:16:34Z","timestamp":1524078994000},"score":1.0,"subtitle":["Survey Summary"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":51,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186242","relation":{"cites":[]}}}