{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:25Z","timestamp":1525103725643},"publisher-location":"New York, New York, USA","reference-count":26,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"Vivesvaraya PhD Scheme for Electronics and IT Ministry of Electronics &#38; Information Technology(MeitY) Government of India","award":["EE\/2016-17\/034\/MLA\/MZAK\/0235"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191621","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Class Specific TF-IDF Boosting for Short-text Classification"],"prefix":"10.1145","author":[{"given":"Samujjwal","family":"Ghosh","sequence":"first","affiliation":[{"name":"IIT Hyderabad, Hyderabad, India"}]},{"given":"Maunendra Sankar","family":"Desarkar","sequence":"additional","affiliation":[{"name":"IIT Hyderabad, Hyderabad, India"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191621-1","unstructured":"Moumita Basu, Anurag Roy, Kripabandhu Ghosh, Somprakash Bandyopadhyay, and Saptarshi Ghosh. 2017. Microblog Retrieval in a Disaster Situation: A New Test Collection for Evaluation. In Proceedings of the First International Workshop on Exploitation of Social Media for Emergency Relief and Preparedness colocated with European Conference on Information Retrieval, SMERP@ECIR 2017, Aberdeen, UK. 22--31. http:\/\/ceur-ws.org\/Vol-1832\/SMERP_2017_peer_review_ paper_3.pdf"},{"key":"key-10.1145\/3184558.3191621-2","unstructured":"Iyad Batal and Milos Hauskrecht. 2009. Boosting KNN text classification accuracy by using supervised term weighting schemes. In Proceedings of the 18th ACM conference on Information and knowledge management. ACM, 2041--2044.","DOI":"10.1145\/1645953.1646296","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191621-3","unstructured":"Constantinos Boulis and Mari Ostendorf. 2005. Text classification by augmenting the bag-of-words representation with redundancy-compensated bigrams. In Proc. of the International Workshop in Feature Selection in Data Mining. Citeseer, 9--16."},{"key":"key-10.1145\/3184558.3191621-4","unstructured":"Corinna Cortes and Vladimir Vapnik. 1995. Support-vector networks. Machine learning 20, 3 (1995), 273--297.","DOI":"10.1007\/BF00994018","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191621-5","unstructured":"George Forman. 2008. BNS feature scaling: an improved representation over tf-idf for svm text classification. In Proceedings of the 17th ACM conference on Information and knowledge management. ACM, 263--270.","DOI":"10.1145\/1458082.1458119","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191621-6","unstructured":"Saptarshi Ghosh and Kripabandhu Ghosh. 2016. Overview of the FIRE 2016 Microblog track: Information Extraction from Microblogs Posted during Disasters. In Working notes of FIRE 2016 - Forum for Information Retrieval Evaluation, Kolkata, India. 56--61. http:\/\/ceur-ws.org\/Vol-1737\/T2--1.pdf"},{"key":"key-10.1145\/3184558.3191621-7","unstructured":"Saptarshi Ghosh, Kripabandhu Ghosh, Debasis Ganguly, Tanmoy Chakraborty, Gareth J.F. Jones, and Marie-Francine Moens. 2017. ECIR 2017 Workshop on Exploitation of Social Media for Emergency Relief and Preparedness (SMERP 2017). SIGIR Forum 51, 1 (Aug. 2017), 36--41. https:\/\/doi.org\/10.1145\/3130332. 3130338","DOI":"10.1145\/3130332","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191621-8","unstructured":"Samujjwal Ghosh, Srijith P. K., and Maunendra Sankar Desarkar. 2017. Using social media for classifying actionable insights in disaster scenario. International Journal of Advances in Engineering Sciences 9, 4 (Dec. 2017), 224--237. https: \/\/doi.org\/10.1007\/s12572-017-0197--2"},{"key":"key-10.1145\/3184558.3191621-9","unstructured":"Muhammad Imran, Prasenjit Mitra, and Carlos Castillo. 2016. Twitter as a Lifeline: Human-annotated Twitter Corpora for NLP of Crisis-related Messages. CoRR abs\/1605.05894 (2016). arXiv:1605.05894 http:\/\/arxiv.org\/abs\/1605.05894"},{"key":"key-10.1145\/3184558.3191621-10","unstructured":"Randy Joy and Magno Ventayen. 2017. Classification of Local Language Disaster Related Tweets in Micro Blogs. In Asia Pacific Journal of Multidisciplinary Research."},{"key":"key-10.1145\/3184558.3191621-11","unstructured":"Prannay Khosla, Moumita Basu, Kripabandhu Ghosh, and Saptarshi Ghosh. 2017. Microblog Retrieval for Post-Disaster Relief: Applying and Comparing Neural IR Models. arXiv preprint arXiv:1707.06112 (2017)."},{"key":"key-10.1145\/3184558.3191621-12","unstructured":"Christine Largeron, Christophe Moulin, and Mathias G&#233;ry. 2011. Entropy based feature selection for text categorization. In Proceedings of the 2011 ACM Symposium on Applied Computing. ACM, 924--928.","DOI":"10.1145\/1982185.1982389","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191621-13","unstructured":"Hongmin Li, Doina Caragea, Cornelia Caragea, and Nic Herndon. 2017. Disaster response aided by tweet classification with a domain adaptation approach. Journal of Contingencies and Crisis Management (2017)."},{"key":"key-10.1145\/3184558.3191621-14","unstructured":"Ying Liu, Han Tong Loh, and Aixin Sun. 2009. Imbalanced text classification: A term weighting approach. Expert systems with Applications 36, 1 (2009), 690--701.","DOI":"10.1016\/j.eswa.2007.10.042","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191621-15","unstructured":"Xinghua Lu, Bin Zheng, Atulya Velivelli, and ChengXiang Zhai. 2006. Enhancing text categorization with semantic-enriched representation and training data augmentation. Journal of the American Medical Informatics Association 13, 5 (2006), 526--535.","DOI":"10.1197\/jamia.M2051","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191621-16","unstructured":"Justin Martineau and Tim Finin. 2009. Delta TFIDF: An Improved Feature Space for Sentiment Analysis. Icwsm 9 (2009), 106."},{"key":"key-10.1145\/3184558.3191621-17","unstructured":"Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems. 3111--3119."},{"key":"key-10.1145\/3184558.3191621-18","unstructured":"Beverly Estephany Parilla-Ferrer, PL Fernandez, and JT Ballena. 2014. Automatic Classification of Disaster-Related Tweets. In Proc. International conference on Innovative Engineering Technologies (ICIET). 62."},{"key":"key-10.1145\/3184558.3191621-19","unstructured":"Robin L Plackett. 1983. Karl Pearson and the chi-squared test. International Statistical Review\/Revue Internationale de Statistique (1983), 59--72."},{"key":"key-10.1145\/3184558.3191621-20","unstructured":"J. R. Ragini and P. M. R. Anand. 2016. An empirical analysis and classification of crisis related tweets. In 2016 IEEE International Conference on Computational Intelligence and Computing Research (ICCIC). 1--4. https:\/\/doi.org\/10.1109\/ICCIC. 2016.7919608"},{"key":"key-10.1145\/3184558.3191621-21","unstructured":"Fuji Ren and Mohammad Golam Sohrab. 2013. Class-indexing-based term weighting for automatic text classification. Information Sciences 236 (2013), 109-- 125.","DOI":"10.1016\/j.ins.2013.02.029","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191621-22","unstructured":"Yang Song, Ding Zhou, Jian Huang, Isaac G Councill, Hongyuan Zha, and C Lee Giles. 2006. Boosting the feature space: Text classification for unstructured data on the web. In Data Mining, 2006. ICDM'06. Sixth International Conference on. IEEE, 1064--1069."},{"key":"key-10.1145\/3184558.3191621-23","unstructured":"Hien To, Sumeet Agrawal, Seon Ho Kim, and Cyrus Shahabi. 2017. On Identifying Disaster-Related Tweets: Matching-based or Learning-based. In Multimedia Big Data (BigMM), 2017 IEEE Third International Conference on. IEEE, 330--337."},{"key":"key-10.1145\/3184558.3191621-24","unstructured":"Hao Wang and Sanhong Deng. 2017. A paper-text perspective: Studies on the influence of feature granularity for Chinese short-text-classification in the Big Data era. The Electronic Library 35, 4 (2017), 689--708. https:\/\/doi.org\/10.1108\/ EL-09--2016-0192"},{"key":"key-10.1145\/3184558.3191621-25","unstructured":"Tao Wang, Yi Cai, Ho-fung Leung, Zhiwei Cai, and Huaqing Min. 2015. Entropybased term weighting schemes for text categorization in VSM. In Tools with Artificial Intelligence (ICTAI), 2015 IEEE 27th International Conference on. IEEE, 325-- 332."},{"key":"key-10.1145\/3184558.3191621-26","unstructured":"Yiming Yang and Jan O Pedersen. 1997. A comparative study on feature selection in text categorization. In International Conference on Machine Learning, Vol. 97. 412--420."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191621&ftid=1958414&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T21:03:41Z","timestamp":1524085421000},"score":1.0,"subtitle":["Application to Short-texts Generated During Disasters"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":26,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191621","relation":{"cites":[]}}}