{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:14Z","timestamp":1523998754276},"publisher-location":"New York, New York, USA","reference-count":24,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"National Science Foundation","award":["IIS-1320527"]},{"name":"Google Faculty Award","award":[]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186153","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Prediction of Sparse User-Item Consumption Rates with Zero-Inflated Poisson Regression"],"prefix":"10.1145","author":[{"given":"Moshe","family":"Lichman","sequence":"first","affiliation":[{"name":"University of California, Irvine, Irvine, CA, USA"}]},{"given":"Padhraic","family":"Smyth","sequence":"additional","affiliation":[{"name":"University of California, Irvine, Irvine, CA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186153-1","unstructured":"Austin R Benson, Ravi Kumar, and Andrew Tomkins. 2016. Modeling user consumption sequences. In Proceedings of the 25th International Conference on World Wide Web. ACM Press, 519--529."},{"key":"key-10.1145\/3178876.3186153-2","unstructured":"A Colin Cameron and Pravin K Trivedi. 2013. Regression Analysis of Count Data. Cambridge University Press."},{"key":"key-10.1145\/3178876.3186153-3","unstructured":"Laurent Charlin, Rajesh Ranganath, James McInerney, and David M Blei. 2015. Dynamic Poisson factorization. In Proceedings of the 9th ACM Conference on Recommender Systems. ACM Press, 155--162.","DOI":"10.1145\/2792838.2800174","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186153-4","unstructured":"Nathaniel D Daw, John P O'Doherty, Peter Dayan, Ben Seymour, and Raymond J Dolan. 2006. Cortical substrates for exploratory decisions in humans. Nature Vol. 441 (2006), 876--879."},{"key":"key-10.1145\/3178876.3186153-5","unstructured":"Peter Diggle, Patrick Heagerty, Kung-Yee Liang, and Scott Zeger. 2002. Analysis of Longitudinal Data. Oxford University Press."},{"key":"key-10.1145\/3178876.3186153-6","unstructured":"Prem Gopalan, Jake M Hofman, and David M Blei. 2015. Scalable recommendation with hierarchical Poisson factorization Proceedings of the 31st Conference on Uncertainty in Artificial Intelligence. 326--335."},{"key":"key-10.1145\/3178876.3186153-7","unstructured":"Daniel B Hall. 2000. Zero-inflated Poisson and binomial regression with random effects: a case study. Biometrics, Vol. 56, 4 (2000), 1030--1039.","DOI":"10.1111\/j.0006-341X.2000.01030.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186153-8","unstructured":"Seyed Abbas Hosseini, Keivan Alizadeh, Ali Khodadadi, Ali Arabzadeh, Mehrdad Farajtabar, Hongyuan Zha, and Hamid R Rabiee. 2017. Recurrent Poisson factorization for temporal recommendation Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM Press, 847--855."},{"key":"key-10.1145\/3178876.3186153-9","unstructured":"Vikas Jain, Nirbhay Modhe, and Piyush Rai. 2017. Scalable generative models for multi-label learning with missing labels Proceedings of the 34th International Conference on Machine Learning. PMLR, 1636--1644."},{"key":"key-10.1145\/3178876.3186153-10","unstructured":"How Jing and Alexander J. Smola. 2017. Neural survival recommender. In Proceedings of the Tenth ACM International Conference on Web Search and Data Mining. ACM Press, 515--524."},{"key":"key-10.1145\/3178876.3186153-11","unstructured":"Komal Kapoor, Vikas Kumar, Loren Terveen, Joseph A. Konstan, and Paul Schrater. 2015 a. &#8220;I like to explore sometime&#8221;: adapting to dynamic user novelty preferences Proceedings of the 9th ACM Conference on Recommender Systems. ACM Press, 19--26."},{"key":"key-10.1145\/3178876.3186153-12","unstructured":"Komal Kapoor, Karthik Subbian, Jaideep Srivastava, and Paul Schrater. 2015 b. Just in time recommendations: modeling the dynamics of boredom in activity streams Proceedings of the Eighth ACM International Conference on Web Search and Data Mining. ACM Press, 233--242."},{"key":"key-10.1145\/3178876.3186153-13","unstructured":"Diederik Kingma and Jimmy Ba. 2015. Adam: A method for stochastic optimization. In International Conference on Learning Representations (ICLR)."},{"key":"key-10.1145\/3178876.3186153-14","unstructured":"Y. Koren, R. Bell, and C. Volinsky. 2009. Matrix factorization techniques for recommender systems. Computer, Vol. 42, 8 (2009), 30--37.","DOI":"10.1109\/MC.2009.263","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186153-15","unstructured":"Diane Lambert. 1992. Zero-inflated Poisson regression, with an application to defects in manufacturing. Technometrics, Vol. 34, 1 (1992), 1--14.","DOI":"10.2307\/1269547","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186153-16","unstructured":"Dawen Liang, Laurent Charlin, James McInerney, and David M. Blei. 2016. Modeling user exposure in recommendation. In Proceedings of the 25th International Conference on World Wide Web. ACM Press, 951--961.","DOI":"10.1145\/2872427.2883090","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186153-17","unstructured":"Dawen Liang, John William Paisley, and Dan Ellis. 2014. Codebook-based scalable music tagging with Poisson matrix factorization Proceedings of the Fifteenth International Society for Music Information Retrieval Conference. 167--172."},{"key":"key-10.1145\/3178876.3186153-18","unstructured":"Li-Ping Liu and David M Blei. 2017. Zero-inflated exponential family embeddings. In International Conference on Machine Learning. PMLR, 2140--2148."},{"key":"key-10.1145\/3178876.3186153-19","unstructured":"Reza Rejaie, Haobo Yu, Mark Handley, and Deborah Estrin. 2000. Multimedia proxy caching mechanism for quality adaptive streaming applications in the internet Proceedings of the Nineteenth Annual Joint Conference of the IEEE Computer and Communications Societies (INFOCOM 2010), Vol. Vol. 2. IEEE Press, 980--989."},{"key":"key-10.1145\/3178876.3186153-20","unstructured":"Martin Ridout, Clarice GB Dem&#233;trio, and John Hinde. 1998. Models for count data with many zeros. In Proceedings of the XIXth International Biometric Conference. 179--192."},{"key":"key-10.1145\/3178876.3186153-21","unstructured":"Matthias W Seeger, David Salinas, and Valentin Flunkert. 2016. Bayesian intermittent demand forecasting for large inventories. Advances in Neural Information Processing Systems 29. Curran Associates, Inc., 4646--4654."},{"key":"key-10.1145\/3178876.3186153-22","unstructured":"Ajit P Singh and Geoffrey J Gordon. 2008. A unified view of matrix factorization models. In Proceedings of the European Conference on Machine Learning and Knowledge Discovery in Databases. Springer Berlin Heidelberg, 358--373."},{"key":"key-10.1145\/3178876.3186153-23","unstructured":"Yingzi Wang, Nicholas Jing Yuan, Defu Lian, Linli Xu, Xing Xie, Enhong Chen, and Yong Rui. 2015. Regularity and Conformity: Location Prediction Using Heterogeneous Mobility Data Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 1275--1284.","DOI":"10.1145\/2783258.2783350","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186153-24","unstructured":"Robert C Wilson, Andra Geana, John M White, Elliot A Ludvig, and Jonathan D Cohen. 2014. Humans use directed and random exploration to solve the explore--exploit dilemma. Journal of Experimental Psychology: General, Vol. 143, 6 (2014), 2074--2081."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186153&ftid=1957446&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:50:13Z","timestamp":1523638213000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":24,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186153","relation":{"cites":[]}}}