{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:12Z","timestamp":1523998752077},"publisher-location":"New York, New York, USA","reference-count":48,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"Srishti Gupta","award":[]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186119","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Collective Classification of Spam Campaigners on Twitter"],"prefix":"10.1145","author":[{"given":"Srishti","family":"Gupta","sequence":"first","affiliation":[{"name":"IIIT-Delhi, Delhi, India"}]},{"given":"Abhinav","family":"Khattar","sequence":"additional","affiliation":[{"name":"IIIT-Delhi, Delhi, India"}]},{"given":"Arpit","family":"Gogia","sequence":"additional","affiliation":[{"name":"DTU, Delhi, India"}]},{"given":"Ponnurangam","family":"Kumaraguru","sequence":"additional","affiliation":[{"name":"IIIT-Delhi, Delhi, India"}]},{"given":"Tanmoy","family":"Chakraborty","sequence":"additional","affiliation":[{"name":"IIIT-Delhi, Delhi, India"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186119-1","unstructured":"Kayode Sakariyah Adewole, Nor Badrul Anuar, Amirrudin Kamsin, and Arun Kumar Sangaiah. 2017. SMSAD: a framework for spam message and spam account detection. Multimedia Tools and Applications (2017), 1--36.","DOI":"10.1007\/s11042-017-5018-x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-2","unstructured":"Fabricio Benevenuto, Gabriel Magno, Tiago Rodrigues, and Virgilio Almeida. 2010. Detecting spammers on twitter. In Collaboration, electronic messaging, anti-abuse and spam conference (CEAS), Vol. Vol. 6. 1--12."},{"key":"key-10.1145\/3178876.3186119-3","unstructured":"Fabr'&#305;cio Benevenuto, Tiago Rodrigues, Virg'&#305;lio Almeida, Jussara Almeida, and Marcos Gonccalves. 2009. Detecting spammers and content promoters in online video social networks Proceedings of the 32nd international ACM SIGIR conference on Research and development in information retrieval. ACM, 620--627."},{"key":"key-10.1145\/3178876.3186119-4","unstructured":"Yazan Boshmaf, Dionysios Logothetis, Georgos Siganos, Jorge Ler'&#305;a, Jose Lorenzo, Matei Ripeanu, and Konstantin Beznosov. 2015. Integro: Leveraging Victim Prediction for Robust Fake Account Detection in OSNs. NDSS, Vol. Vol. 15. 8--11.","DOI":"10.14722\/ndss.2015.23260","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-5","unstructured":"Qiang Cao, Michael Sirivianos, Xiaowei Yang, and Tiago Pregueiro. 2012. Aiding the detection of fake accounts in large scale social online services Proceedings of the 9th USENIX conference on Networked Systems Design and Implementation. USENIX Association, 15--15."},{"key":"key-10.1145\/3178876.3186119-6","unstructured":"Qiang Cao, Xiaowei Yang, Jieqi Yu, and Christopher Palow. 2014. Uncovering large groups of active malicious accounts in online social networks Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security. ACM, 477--488."},{"key":"key-10.1145\/3178876.3186119-7","unstructured":"Nitesh V Chawla, Kevin W Bowyer, Lawrence O Hall, and W Philip Kegelmeyer. 2002. SMOTE: synthetic minority over-sampling technique. Journal of artificial intelligence research Vol. 16 (2002), 321--357."},{"key":"key-10.1145\/3178876.3186119-8","unstructured":"Zi Chu, Indra Widjaja, and Haining Wang. 2012. Detecting social spam campaigns on twitter. In International Conference on Applied Cryptography and Network Security. Springer, 455--472.","DOI":"10.1007\/978-3-642-31284-7_27","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-9","unstructured":"Andrei Costin, Jelena Isacenkova, Marco Balduzzi, Aur&#233;lien Francillon, and Davide Balzarotti. 2013. The role of phone numbers in understanding cyber-crime schemes Privacy, Security and Trust (PST), 2013 Eleventh Annual International Conference on. IEEE, 213--220."},{"key":"key-10.1145\/3178876.3186119-10","unstructured":"George Danezis and Prateek Mittal. 2009. SybilInfer: Detecting Sybil Nodes using Social Networks NDSS. San Diego, CA, 1--15."},{"key":"key-10.1145\/3178876.3186119-11","unstructured":"Clayton Allen Davis, Onur Varol, Emilio Ferrara, Alessandro Flammini, and Filippo Menczer. 2016. Botornot: A system to evaluate social bots. In Proceedings of the 25th International Conference Companion on World Wide Web. International World Wide Web Conferences Steering Committee, 273--274.","DOI":"10.1145\/2872518.2889302","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-12","unstructured":"Manuel Egele, Gianluca Stringhini, Christopher Kruegel, and Giovanni Vigna. 2013. Compa: Detecting compromised accounts on social networks. NDSS. 1--17."},{"key":"key-10.1145\/3178876.3186119-13","unstructured":"Manuel Egele, Gianluca Stringhini, Christopher Kruegel, and Giovanni Vigna. 2017. Towards detecting compromised accounts on social networks. IEEE Transactions on Dependable and Secure Computing, Vol. 14, 4 (2017), 447--460.","DOI":"10.1109\/TDSC.2015.2479616","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-14","unstructured":"Emilio Ferrara, Pasquale De Meo, Salvatore Catanese, and Giacomo Fiumara. 2014. Detecting criminal organizations in mobile phone networks. Expert Systems with Applications Vol. 41, 13 (2014), 5733--5750.","DOI":"10.1016\/j.eswa.2014.03.024","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-15","unstructured":"Emilio Ferrara, Onur Varol, Clayton Davis, Filippo Menczer, and Alessandro Flammini. 2016. The rise of social bots. Commun. ACM Vol. 59, 7 (2016), 96--104.","DOI":"10.1145\/2818717","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-16","unstructured":"Hongyu Gao, Jun Hu, Christo Wilson, Zhichun Li, Yan Chen, and Ben Y Zhao. 2010. Detecting and characterizing social spam campaigns Proceedings of the 10th ACM SIGCOMM conference on Internet measurement. ACM, 35--47."},{"key":"key-10.1145\/3178876.3186119-17","unstructured":"Saptarshi Ghosh, Bimal Viswanath, Farshad Kooti, Naveen Kumar Sharma, Gautam Korlam, Fabricio Benevenuto, Niloy Ganguly, and Krishna Phani Gummadi. 2012. Understanding and combating link farming in the twitter social network Proceedings of the 21st international conference on World Wide Web. ACM, 61--70."},{"key":"key-10.1145\/3178876.3186119-18","unstructured":"Chris Grier, Kurt Thomas, Vern Paxson, and Michael Zhang. 2010. @ spam: the underground on 140 characters or less. Proceedings of the 17th ACM conference on Computer and communications security. ACM, 27--37.","DOI":"10.1145\/1866307.1866311","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-19","unstructured":"Usman US Khan, Mazhar Ali, Assad Abbas, Samee Khan, and Albert Zomaya. 2016. Segregating Spammers and Unsolicited Bloggers from Genuine Experts on Twitter. IEEE Transactions on Dependable and Secure Computing (2016)."},{"key":"key-10.1145\/3178876.3186119-20","unstructured":"Xiangnan Kong, Bokai Cao, and Philip S Yu. 2013 a. Multi-label classification by mining label and instance correlations from heterogeneous information networks. In Proceedings of the 19th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 614--622.","DOI":"10.1145\/2487575.2487577","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-21","unstructured":"Xiangnan Kong, Philip S Yu, Ying Ding, and David J Wild. 2012. Meta path-based collective classification in heterogeneous information networks Proceedings of the 21st ACM international conference on Information and knowledge management. ACM, 1567--1571."},{"key":"key-10.1145\/3178876.3186119-22","unstructured":"Xiangnan Kong, Jiawei Zhang, and Philip S Yu. 2013 b. Inferring anchor links across multiple heterogeneous social networks Proceedings of the 22nd ACM international conference on Information &#38; Knowledge Management. ACM, 179--188."},{"key":"key-10.1145\/3178876.3186119-23","unstructured":"Ni Lao and William W Cohen. 2010. Relational retrieval using a combination of path-constrained random walks. Machine learning, Vol. 81, 1 (2010), 53--67.","DOI":"10.1007\/s10994-010-5205-8","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-24","unstructured":"Kyumin Lee, James Caverlee, and Steve Webb. 2010. Uncovering social spammers: social honeypots"},{"key":"key-10.1145\/3178876.3186119-25","unstructured":"machine learning Proceedings of the 33rd international ACM SIGIR conference on Research and development in information retrieval. ACM, 435--442."},{"key":"key-10.1145\/3178876.3186119-26","unstructured":"Sangho Lee and Jong Kim. 2012. WarningBird: Detecting Suspicious URLs in Twitter Stream. NDSS, Vol. Vol. 12. 1--13."},{"key":"key-10.1145\/3178876.3186119-27","unstructured":"Xiang Li, Ben Kao, Yudian Zheng, and Zhipeng Huang. 2016. On transductive classification in heterogeneous information networks Proceedings of the 25th ACM International on Conference on Information and Knowledge Management. ACM, 811--820."},{"key":"key-10.1145\/3178876.3186119-28","unstructured":"Changchang Liu, Peng Gao, Matthew Wright, and Prateek Mittal. 2015. Exploiting temporal dynamics in sybil defenses. In Proceedings of the 22nd ACM SIGSAC Conference on Computer and Communications Security. ACM, 805--816.","DOI":"10.1145\/2810103.2813693","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-29","unstructured":"Linqing Liu, Yao Lu, Ye Luo, Renxian Zhang, Laurent Itti, and Jianwei Lu. 2016. Detecting\" Smart\" Spammers On Social Network: A Topic Model Approach. arXiv preprint arXiv:1604.08504 (2016)."},{"key":"key-10.1145\/3178876.3186119-30","unstructured":"Changping Meng, Reynold Cheng, Silviu Maniu, Pierre Senellart, and Wangda Zhang. 2015. Discovering meta-paths in large heterogeneous information networks Proceedings of the 24th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 754--764."},{"key":"key-10.1145\/3178876.3186119-31","unstructured":"Xiaofeng Meng, Chuan Shi, Yitong Li, Lei Zhang, and Bin Wu. 2014. Relevance measure in large-scale heterogeneous networks Asia-Pacific Web Conference. Springer, 636--643."},{"key":"key-10.1145\/3178876.3186119-32","unstructured":"Najmeh Miramirkhani, Oleksii Starov, and Nick Nikiforakis. 2017. Dial one for scam: A large-scale analysis of technical support scams Proceedings of the 24th Network and Distributed System Security Symposium (NDSS). 1--15."},{"key":"key-10.1145\/3178876.3186119-33","unstructured":"Shirin Nilizadeh, Franccois Labr&#232;che, Alireza Sedighian, Ali Zand, Jos&#233; Fernandez, Christopher Kruegel, Gianluca Stringhini, and Giovanni Vigna. 2017. POISED: Spotting Twitter Spam Off the Beaten Paths. arXiv preprint arXiv:1708.09058 (2017)."},{"key":"key-10.1145\/3178876.3186119-34","unstructured":"Bhavani Raskutti and Adam Kowalczyk. 2004. Extreme re-balancing for SVMs: a case study. ACM Sigkdd Explorations Newsletter Vol. 6, 1 (2004), 60--69.","DOI":"10.1145\/1007730.1007739","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-35","unstructured":"Prithviraj Sen, Galileo Namata, Mustafa Bilgic, Lise Getoor, Brian Galligher, and Tina Eliassi-Rad. 2008. Collective classification in network data. AI magazine, Vol. 29, 3 (2008), 93.","DOI":"10.1609\/aimag.v29i3.2157","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-36","unstructured":"Chuan Shi, Xiangnan Kong, Yue Huang, S Yu Philip, and Bin Wu. 2014. Hetesim: A general framework for relevance measure in heterogeneous networks. IEEE Transactions on Knowledge and Data Engineering, Vol. 26, 10 (2014), 2479--2492.","DOI":"10.1109\/TKDE.2013.2297920","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-37","unstructured":"Chuan Shi, Xiangnan Kong, Philip S Yu, Sihong Xie, and Bin Wu. 2012. Relevance search in heterogeneous networks. In Proceedings of the 15th International Conference on Extending Database Technology. ACM, 180--191.","DOI":"10.1145\/2247596.2247618","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-38","unstructured":"Gianluca Stringhini, Christopher Kruegel, and Giovanni Vigna. 2010. Detecting spammers on social networks. In Proceedings of the 26th annual computer security applications conference. ACM, 1--9.","DOI":"10.1145\/1920261.1920263","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-39","unstructured":"Gianluca Stringhini, Pierre Mourlanne, Gregoire Jacob, Manuel Egele, Christopher Kruegel, and Giovanni Vigna. 2015. EVILCOHORT: Detecting Communities of Malicious Accounts on Online Services 24th USENIX Security Symposium (USENIX Security 15). USENIX Association, Washington, D.C., 563--578."},{"key":"key-10.1145\/3178876.3186119-40","unstructured":"Yizhou Sun, Jiawei Han, Xifeng Yan, Philip S Yu, and Tianyi Wu. 2011. Pathsim: Meta path-based top-k similarity search in heterogeneous information networks. Proceedings of the VLDB Endowment Vol. 4, 11 (2011), 992--1003."},{"key":"key-10.1145\/3178876.3186119-41","unstructured":"Yizhou Sun, Brandon Norick, Jiawei Han, Xifeng Yan, Philip S Yu, and Xiao Yu. 2013. Pathselclus: Integrating meta-path selection with user-guided object clustering in heterogeneous information networks. ACM Transactions on Knowledge Discovery from Data (TKDD), Vol. 7, 3 (2013), 1--23.","DOI":"10.1145\/2513092.2500492","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-42","unstructured":"Kurt Thomas, Chris Grier, Justin Ma, Vern Paxson, and Dawn Song. 2011 a. Design and evaluation of a real-time url spam filtering service IEEE Symposium on Security and Privacy. IEEE, 447--462."},{"key":"key-10.1145\/3178876.3186119-43","unstructured":"Kurt Thomas, Chris Grier, Dawn Song, and Vern Paxson. 2011 b. Suspended accounts in retrospect: an analysis of twitter spam Proceedings of the 2011 ACM SIGCOMM conference on Internet measurement conference. ACM, 243--258.","DOI":"10.1145\/2068816.2068840","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-44","unstructured":"Bimal Viswanath, Muhammad Ahmad Bashir, Mark Crovella, Saikat Guha, Krishna P Gummadi, Balachander Krishnamurthy, and Alan Mislove. 2014. Towards Detecting Anomalous User Behavior in Online Social Networks. USENIX Security Symposium. 223--238."},{"key":"key-10.1145\/3178876.3186119-45","unstructured":"Sarita Yardi, Daniel Romero, Grant Schoenebeck, et almbox.. 2009. Detecting spam in a twitter network. First Monday, Vol. 15, 1 (2009)."},{"key":"key-10.1145\/3178876.3186119-46","unstructured":"Ezer Osei Yeboah-Boateng and Priscilla Mateko Amanor. 2014. Phishing, SMiShing &#38; Vishing: an assessment of threats against mobile devices. Journal of Emerging Trends in Computing and Information Sciences, Vol. 5, 4 (2014), 297--307."},{"key":"key-10.1145\/3178876.3186119-47","unstructured":"Mingxi Zhang, Hao Hu, Zhenying He, and Wei Wang. 2015. Top-k similarity search in heterogeneous information networks with x-star network schema. Expert Systems with Applications Vol. 42, 2 (2015), 699--712.","DOI":"10.1016\/j.eswa.2014.08.039","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186119-48","unstructured":"Xianchao Zhang, Zhaoxing Li, Shaoping Zhu, and Wenxin Liang. 2016. Detecting Spam and Promoting Campaigns in Twitter. ACM Trans. Web, Vol. 10, 1 (2016), 4:1--4:28."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186119&ftid=1957507&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:34:12Z","timestamp":1523637252000},"score":1.0,"subtitle":["A Hierarchical Meta-Path Based Approach"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":48,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186119","relation":{"cites":[]}}}