{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:27Z","timestamp":1523998767783},"publisher-location":"New York, New York, USA","reference-count":31,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"funder":[{"name":"National Basic Research Program of China (973 Program)","award":["2014CB340505"]},{"name":"National Natural Science Foundation of China","award":["61502253","61532010"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186012","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["An Attention Factor Graph Model for Tweet Entity Linking"],"prefix":"10.1145","author":[{"given":"Chenwei","family":"Ran","sequence":"first","affiliation":[{"name":"Tsinghua University, Beijing, China"}]},{"given":"Wei","family":"Shen","sequence":"additional","affiliation":[{"name":"Nankai University, Tianjin, China"}]},{"given":"Jianyong","family":"Wang","sequence":"additional","affiliation":[{"name":"Tsinghua University & Jiangsu Normal University, Beijing, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186012-1","unstructured":"Razvan C Bunescu and Marius Pasca. 2006. Using Encyclopedic Knowledge for Named entity Disambiguation. EACL, Vol. Vol. 6. 9--16."},{"key":"key-10.1145\/3178876.3186012-2","unstructured":"Jan Chorowski, Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2014. End-to-End Continuous Speech Recognition Using Attention-Based Recurrent NN: First Results NIPS 2014 Workshop on Deep Learning."},{"key":"key-10.1145\/3178876.3186012-3","unstructured":"Silviu Cucerzan. 2007. Large-Scale Named Entity Disambiguation Based on Wikipedia Data Proceedings of the 2007 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning."},{"key":"key-10.1145\/3178876.3186012-4","unstructured":"Diego Marinho de Oliveira, Alberto HF Laender, Adriano Veloso, and Altigran S da Silva. 2013. FS-NER: a Lightweight Filter-Stream Approach to Named Entity Recognition on Twitter Data Proceedings of the 22nd International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 597--604.","DOI":"10.1145\/2487788.2488003","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-5","unstructured":"Yuan Fang and Ming-Wei Chang. 2014. Entity Linking on Microblogs with Spatial and Temporal Signals. Transactions of the Association for Computational Linguistics Vol. 2 (2014), 259--272."},{"key":"key-10.1145\/3178876.3186012-6","unstructured":"Wei Feng and Jianyong Wang. 2012. Incorporating Heterogeneous Information for Personalized Tag Recommendation in Social Tagging Systems. In Proceedings of the 18th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 1276--1284.","DOI":"10.1145\/2339530.2339729","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-7","unstructured":"Wei Feng, Chao Zhang, Wei Zhang, Jiawei Han, Jianyong Wang, Charu Aggarwal, and Jianbin Huang. 2015. STREAMCUBE: Hierarchical Spatio-Temporal Hashtag Clustering for Event Exploration over the Twitter Stream. In 2015 IEEE 31st International Conference on Data Engineering. IEEE, 1561--1572."},{"key":"key-10.1145\/3178876.3186012-8","unstructured":"Stephen Guo, Ming-Wei Chang, and Emre Kiciman. 2013 a. To Link or Not to Link? A Study on End-to-End Tweet Entity Linking Proceedings of The 2013 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 1020--1030."},{"key":"key-10.1145\/3178876.3186012-9","unstructured":"Yuhang Guo, Bing Qin, Ting Liu, and Sheng Li. 2013 b. Microblog Entity Linking by Leveraging Extra Posts Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing. 863--868."},{"key":"key-10.1145\/3178876.3186012-10","unstructured":"Johannes Hoffart, Mohamed Amir Yosef, Ilaria Bordino, Hagen F&#252;rstenau, Manfred Pinkal, Marc Spaniol, Bilyana Taneva, Stefan Thater, and Gerhard Weikum. 2011. Robust Disambiguation of Named Entities in Text. Proceedings of the Conference on Empirical Methods in Natural Language Processing. ACL, 782--792."},{"key":"key-10.1145\/3178876.3186012-11","unstructured":"Wen Hua, Kai Zheng, and Xiaofang Zhou. 2015. Microblog Entity Linking with Social Temporal Context Proceedings of the 2015 ACM SIGMOD International Conference on Management of Data. ACM, 1761--1775."},{"key":"key-10.1145\/3178876.3186012-12","unstructured":"George Karypis and Vipin Kumar. 1995. METIS--Unstructured Graph Partitioning and Sparse Matrix Ordering System, Version 2.0. (1995)."},{"key":"key-10.1145\/3178876.3186012-13","unstructured":"Dominik Kowald, Subhash Chandra Pujari, and Elisabeth Lex. 2017. Temporal Effects on Hashtag Reuse in Twitter: A Cognitive-Inspired Hashtag Recommendation Approach. In Proceedings of the 26th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 1401--1410.","DOI":"10.1145\/3038912.3052605","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-14","unstructured":"Kathy Lee, Ashequl Qadir, Sadid A Hasan, Vivek Datla, Aaditya Prakash, Joey Liu, and Oladimeji Farri. 2017. Adverse Drug Event Detection in Tweets with Semi-Supervised Convolutional Neural Networks Proceedings of the 26th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 705--714."},{"key":"key-10.1145\/3178876.3186012-15","unstructured":"Chenliang Li, Jianshu Weng, Qi He, Yuxia Yao, Anwitaman Datta, Aixin Sun, and Bu-Sung Lee. 2012. Twiner: Named Entity Recognition in Targeted Twitter Stream Proceedings of the 35th international ACM SIGIR Conference on Research and Development in Information Retrieval. ACM, 721--730.","DOI":"10.1145\/2348283.2348380","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-16","unstructured":"Yankai Lin, Shiqi Shen, Zhiyuan Liu, Huanbo Luan, and Maosong Sun. 2016. Neural Relation Extraction with Selective Attention over Instances Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics. ACL."},{"key":"key-10.1145\/3178876.3186012-17","unstructured":"Xiaohua Liu, Yitong Li, Haocheng Wu, Ming Zhou, Furu Wei, and Yi Lu. 2013. Entity Linking for Tweets.. In Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics. 1304--1311."},{"key":"key-10.1145\/3178876.3186012-18","unstructured":"Xiaohua Liu, Shaodian Zhang, Furu Wei, and Ming Zhou. 2011. Recognizing Named Entities in Tweets. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics. ACL, 359--367."},{"key":"key-10.1145\/3178876.3186012-19","unstructured":"Michael Mathioudakis and Nick Koudas. 2010. Twittermonitor: Trend Detection over The Twitter Stream Proceedings of the 2010 ACM SIGMOD International Conference on Management of Data. ACM, 1155--1158.","DOI":"10.1145\/1807167.1807306","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-20","unstructured":"Edgar Meij, Wouter Weerkamp, and Maarten De Rijke. 2012. Adding Semantics to Microblog Posts. In Proceedings of the fifth ACM International Conference on Web Search and Data Mining. ACM, 563--572.","DOI":"10.1145\/2124295.2124364","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-21","unstructured":"David Milne and Ian H. Witten. 2008. An Effective, Low-Cost Measure of Semantic Relatedness Obtained from Wikipedia links WIKIAI."},{"key":"key-10.1145\/3178876.3186012-22","unstructured":"Volodymyr Mnih, Nicolas Heess, Alex Graves, et al. 2014. Recurrent Models of Visual Attention. In Advances in Neural Information Processing Systems. 2204--2212."},{"key":"key-10.1145\/3178876.3186012-23","unstructured":"Kevin P Murphy, Yair Weiss, and Michael I Jordan. 1999. Loopy Belief Propagation for Approximate Inference: An Empirical Study Proceedings of the 15th Conference on Uncertainty in Artificial Intelligence. Morgan Kaufmann Publishers Inc., 467--475."},{"key":"key-10.1145\/3178876.3186012-24","unstructured":"Alan Ritter, Evan Wright, William Casey, and Tom Mitchell. 2015. Weakly Supervised Extraction of Computer Security Events from Twitter Proceedings of the 24th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 896--905."},{"key":"key-10.1145\/3178876.3186012-25","unstructured":"Wei Shen, Jianyong Wang, and Jiawei Han. 2015. Entity linking with a Knowledge Base: Issues, Techniques, and Solutions. IEEE Transactions on Knowledge and Data Engineering, Vol. 27, 2 (2015), 443--460.","DOI":"10.1109\/TKDE.2014.2327028","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-26","unstructured":"Wei Shen, Jianyong Wang, Ping Luo, and Min Wang. 2012. Linden: Linking Named Entities with Knowledge Base via Semantic Knowledge Proceedings of the 21st International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 449--458.","DOI":"10.1145\/2187836.2187898","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-27","unstructured":"Wei Shen, Jianyong Wang, Ping Luo, and Min Wang. 2013. Linking Named Entities in Tweets with Knowledge Base via User Interest Modeling Proceedings of the 19th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 68--76."},{"key":"key-10.1145\/3178876.3186012-28","unstructured":"Jie Tang, Jimeng Sun, Chi Wang, and Zi Yang. 2009. Social Influence Analysis in Large-Scale Networks. Proceedings of the 15th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 807--816.","DOI":"10.1145\/1557019.1557108","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-29","unstructured":"Wenbin Tang, Honglei Zhuang, and Jie Tang. 2011. Learning to Infer Social Ties in Large Networks. Proceedings of the 2011 European Conference on Machine Learning and Knowledge Discovery in Databases. Springer, 381--397.","DOI":"10.1007\/978-3-642-23808-6_25","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186012-30","unstructured":"Zhichun Wang, Juanzi Li, Zhigang Wang, and Jie Tang. 2012. Cross-Lingual Knowledge Linking across Wiki Knowledge Bases Proceedings of the 21st International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 459--468."},{"key":"key-10.1145\/3178876.3186012-31","unstructured":"Yi Yang and Ming-Wei Chang. 2015. S-MART: Novel Tree-based Structured Learning Algorithms Applied to Tweet Entity Linking Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Conference on Natural Language Processing. ACL, 504--513."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186012&ftid=1957403&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:30:35Z","timestamp":1523640635000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":31,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186012","relation":{"cites":[]}}}