{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:27Z","timestamp":1523998767077},"publisher-location":"New York, New York, USA","reference-count":53,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186000","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["HighLife"],"prefix":"10.1145","author":[{"given":"Patrick","family":"Ernst","sequence":"first","affiliation":[{"name":"Max Planck Institute for Informatics, Saarbrücken, Germany"}]},{"given":"Amy","family":"Siu","sequence":"additional","affiliation":[{"name":"Max Planck Institute for Informatics, Saarbrücken, Germany"}]},{"given":"Gerhard","family":"Weikum","sequence":"additional","affiliation":[{"name":"Max Planck Institute for Informatics, Saarbrücken, Germany"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186000-1","unstructured":"C.F. Baker. FrameNet, current collaborations and future goals. Language Resources and Evaluation 46(2): 269--286, 2012.","DOI":"10.1007\/s10579-012-9191-2","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-2","unstructured":"H. Bast, B. Buchhold. An index for efficient semantic full-text search. In ACM Conference on Information and Knowledge Management (CIKM), pages 369--378, 2013.","DOI":"10.1145\/2505515.2505689","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-3","unstructured":"S. L. Berrahou, P. Buche, J. Dibie, M. Roche. Xart system: Discovering and extracting correlated arguments of n-ary relations from text. In International Conference on Web Intelligence, Mining and Semantics (WIMS), pages 8:1--8:12, 2016.%"},{"key":"key-10.1145\/3178876.3186000-4","unstructured":"% J. Bj&#246;rne, J. Heimonen, F. Ginter, A. Airola, T. Pahikkala, and T. Salakoski,% Extracting Contextualized Complex Biological Events with Rich Graph-% Based Feature Sets.% Computational Intelligence, 27:541--557, 2011.","DOI":"10.1111\/j.1467-8640.2011.00399.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-5","unstructured":"R. Brachman, H. Levesque. Knowledge Representation and Reasoning. The Morgan Kaufmann Series in Artificial Intelligence Series. Morgan Kaufmann, 2004."},{"key":"key-10.1145\/3178876.3186000-6","unstructured":"S. Brin. Extracting patterns and relations from the World Wide Web. In International Workshop on The WorldWide Web and Databases (WebDB), pages 172--183, 1998."},{"key":"key-10.1145\/3178876.3186000-7","unstructured":"R. C. Bunescu, R. J. Mooney. A shortest path dependency kernel for relation extraction. In Conference on Human Language Technology and Empirical Methods in Natural Language Processing (EMNLP-HLT), pages 724--731, 2005.","DOI":"10.3115\/1220575.1220666","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-8","unstructured":"A. Carlson, J. Betteridge, R. C. Wang, E. R. Hruschka, Jr., T. M. Mitchell. Coupled semi-supervised learning for information extraction. In International Conference on Web Search and Data Mining (WSDM), pages 101--110, 2010.","DOI":"10.1145\/1718487.1718501","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-9","unstructured":"Y. Chi, Y. Yang, R. R. Muntz. Canonical forms for labelled trees and their applications in frequent subtree mining. Knowledge and Information Systems, 8(2):203--234, 2005.","DOI":"10.1007\/s10115-004-0180-7","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-10","unstructured":"J. Clarke, V. Srikumar, M. Sammons, D. Roth. An NLP Curator (or: How I Learned to Stop Worrying and Love NLP Pipelines). In International Conference on Language Resources and Evaluation (LREC:) pages 3276--3283, 2012."},{"key":"key-10.1145\/3178876.3186000-11","unstructured":"L. Del Corro, R. Gemulla. Clausie: Clause-based open information extraction. In International Conference on World Wide Web (WWW), pages 355--366, 2013.","DOI":"10.1145\/2488388.2488420","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-12","unstructured":"G. R. Doddington, A. Mitchell, M. A. Przybocki, L. A. Ramshaw, S. Strassel, R. M. Weischedel. The Automatic Content Extraction (ACE) Program-Tasks, Data, and Evaluation In Automatic Content Extraction (ACE) Program-Tasks, Data, and Evaluation (LREC), 2004."},{"key":"key-10.1145\/3178876.3186000-13","unstructured":"M. Dylla, I. Miliaraki, M. Theobald. A temporal-probabilistic database model for information extraction. VLDB (Very Large Data Bases) Endowment, 6(14):1810--1821, 2013."},{"key":"key-10.1145\/3178876.3186000-14","unstructured":"P. Ernst, A. Siu, D. Milchevski, J. Hoffart, G. Weikum. DeepLife: An entity-aware search, analytics and exploration platform for health and life sciences. In Annual Meeting of the Association for Computational Linguistics (ACL), pages 1017--1024, 2016.","DOI":"10.18653\/v1\/P16-4004","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-15","unstructured":"P. Ernst, A. Siu, G. Weikum. KnowLife: A versatile approach for constructing a large knowledge graph for biomedical sciences. BMC Bioinformatics, 16(1):1--13, 2015.","DOI":"10.1186\/s12859-015-0549-5","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-16","unstructured":"G. Garrido, A. Pe nas, B. Cabaleiro, A. Rodrigo. Temporally anchored relation extraction. In Annual Meeting of the Association for Computational Linguistics (ACL), pages 107--116, 2012."},{"key":"key-10.1145\/3178876.3186000-17","unstructured":"D. Gildea, D. Jurafsky. Automatic labeling of semantic roles. Computational Linguistics, 28(3):245--288, 2002.","DOI":"10.1162\/089120102760275983","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-18","unstructured":"J. Hoffart, D. Milchevski, G. Weikum. Stics: Searching with strings, things, and cats. In International ACM SIGIR Conference on Research &#38; Development in Information Retrieval (SIGIR), pages 1247--1248, 2014.","DOI":"10.1145\/2600428.2611177","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-19","unstructured":"J. Hoffart, F. M. Suchanek, K. Berberich, G. Weikum. YAGO2: A spatially and temporally enhanced knowledge base from wikipedia. Artificial Intelligence, 194:28 -- 61, 2013.","DOI":"10.1016\/j.artint.2012.06.001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-20","unstructured":"J. Hoffart, M. A. Yosef, I. Bordino, H. F&#252;rstenau, M. Pinkal, M. Spaniol, B. Taneva, S. Thater, G. Weikum. Robust disambiguation of named entities in text. In Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 782--792, 2011."},{"key":"key-10.1145\/3178876.3186000-21","unstructured":"S. Krause, L. Hennig, A. Moro, D. Weissenborn, F. Xu, H. Uszkoreit, R. Navigli. Sar-graphs: A language resource connecting linguistic knowledge with semantic relations from knowledge graphs. Web Semantics: Science, Services and Agents on the World Wide Web, 37, 38:112 -- 131, 2016.","DOI":"10.1016\/j.websem.2016.03.004","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-22","unstructured":"S. Krause, H. Li, H. Uszkoreit, F. Xu. Large-scale learning of relation-extraction rules with distant supervision from the web. In International Semantic Web Conference (ISWC), pages 263--278, 2012.","DOI":"10.1007\/978-3-642-35176-1_17","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-23","unstructured":"E. Kuzey, J. Vreeken, G. Weikum. A fresh look on knowledge bases: Distilling named events from news. In ACM International Conference on Information and Knowledge Management (CIKM), pages 1689--1698, 2014.","DOI":"10.1145\/2661829.2661984","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-24","unstructured":"E. Kuzey, G. Weikum. Extraction of temporal facts and events from wikipedia. In Temporal Web Analytics Workshop (TempWeb), pages 25--32, 2012.","DOI":"10.1145\/2169095.2169101","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-25","unstructured":"H. Li, S. Krause, F. Xu, A. Moro, H. Uszkoreit, R. Navigli. Improvement of n-ary Relation Extraction by Adding Lexical Semantics to Distant-Supervision Rule Learning In International Conference on Agents and Artificial Intelligence (ICAART), Volume 2, 2015.","DOI":"10.5220\/0005187303170324","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-26","unstructured":"H. Liu, L. Hunter, V. Keselj, K. Verspoor. Approximate subgraph matching-based literature mining for biomedical events and relations. PLoS ONE, 8(4):1--16, 2013.","DOI":"10.1371\/journal.pone.0060954","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-27","unstructured":"V. Markl, P. J. Haas, M. Kutsch, N. Megiddo, U. Srivastava, T. M. Tran. Consistent selectivity estimation via maximum entropy. The VLDB (Very Large Data Bases) Journal, 16(1):55--76, 2007."},{"key":"key-10.1145\/3178876.3186000-28","unstructured":"Mausam, M. Schmitz, R. Bart, S. Soderland, O. Etzioni. Open language learning for information extraction. In Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning (EMNLP-CoNLL), pages 523--534, 2012."},{"key":"key-10.1145\/3178876.3186000-29","unstructured":"D. McClosky, S. Riedel, M. Surdeanu, A. McCallum, C. D. Manning. Combining joint models for biomedical event extraction. BMC Bioinformatics, 13(11):1--12, 2012.","DOI":"10.1186\/1471-2105-13-S11-S9","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-30","unstructured":"R. McDonald, F. Pereira, S. Kulick, S. Winters, Y. Jin, P. White. Simple algorithms for complex relation extraction with applications to biomedical ie. In Annual Meeting on Association for Computational Linguistics (ACL), pages 491--498, 2005.","DOI":"10.3115\/1219840.1219901","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-31","unstructured":"F. Mesquita, J. Schmidek, D. Barbosa. Effectiveness and efficiency of open relation extraction. In Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 447--457, 2013."},{"key":"key-10.1145\/3178876.3186000-32","unstructured":"M. Mintz, S. Bills, R. Snow, D. Jurafsky. Distant supervision for relation extraction without labeled data. In Annual Meeting on Association for Computational Linguistics (ACL), pages 1003--1011, 2009.","DOI":"10.3115\/1690219.1690287","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-33","unstructured":"M. Miwa, P. Thompson, J. McNaught, D. B. Kell, S. Ananiadou. Extracting semantically enriched events from biomedical literature. BMC Bioinformatics, 13(1):1--24, 2012.","DOI":"10.1186\/1471-2105-13-108","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-34","unstructured":"A. Moschitti. Making tree kernels practical for natural language learning. In European Chapter of the Association for Computational Linguistics (EACL), pages 113--120, 2006."},{"key":"key-10.1145\/3178876.3186000-35","unstructured":"N. Nakashole, M. Theobald, G. Weikum. Scalable knowledge harvesting with high precision and high recall. In International Conference on Web Search and Data Mining (WSDM), pages 227--236, 2011.","DOI":"10.1145\/1935826.1935869","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-36","unstructured":"M. Palmer, D. Gildea, P. Kingsbury The Proposition Bank: An Annotated Corpus of Semantic Roles. Computational Linguistics 28, 31(1):71--106, 2005."},{"key":"key-10.1145\/3178876.3186000-37","unstructured":"M. Palmer, D. Gildea, N. Xue Semantic role labeling Synthesis Lectures on Human Language Technologies, 3(1):1--103, 2011."},{"key":"key-10.1145\/3178876.3186000-38","unstructured":"N. Peng, H. Poon, C. Quirk, K. Toutanova, W. Yih. Cross-Sentence N-ary Relation Extraction with Graph LSTMs. Transactions of the ACL (TACL) 5:101--115, 2017."},{"key":"key-10.1145\/3178876.3186000-39","unstructured":"V. Punyakanok, D. Roth, W. Yih. The Importance of Syntactic Parsing and Inference in Semantic Role Labeling. Computational Linguistics 28, 34(2):257--287, 2008."},{"key":"key-10.1145\/3178876.3186000-40","unstructured":"L. Ratinov, D. Roth. Design Challenges and Misconceptions in Named Entity Recognition. In Conference on Computational Natural Language Learning (CoNLL), pages 147--155, 2009.%","DOI":"10.3115\/1596374.1596399","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-41","unstructured":"%J. Ruppenhofer, M. Ellsworth, M. Petruck, C. Johnson, C. Baker, J. Scheffczyk. FrameNet II: Extended Theory and Practice. framenet2.icsi.berkeley.edu\/docs\/r1.7\/book.pdf, 2016."},{"key":"key-10.1145\/3178876.3186000-42","unstructured":"D. Shahaf, C. Guestrin. Connecting two (or less) dots: Discovering structure in news articles. ACM Transactions on Knowledge Discovery from Data, 5(4):24:1--24:31, 2012.%"},{"key":"key-10.1145\/3178876.3186000-43","unstructured":"%A. Siu, D. B. Nguyen, and G. Weikum. Fast entity recognition in biomedical text.% In Workshop on Data Mining for Healthcare (DMH) at the 19th ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD) 2013, Chicago, USA, August 2013. Association for Computing Machinery (ACM)."},{"key":"key-10.1145\/3178876.3186000-44","unstructured":"V. Srikumar, D. Roth. Modeling Semantic Relations Expressed by Prepositions. Transactions of the ACL (TACL) 1, pages 231--242, 2013."},{"key":"key-10.1145\/3178876.3186000-45","unstructured":"F. Suchanek, M. Sozio, G. Weikum. Sofie: A self-organizing framework for information extraction. In International World Wide Web Conference (WWW), pages 631--640, 2009.","DOI":"10.1145\/1526709.1526794","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-46","unstructured":"M. Surdeanu, J. Heng. Overview of the English slot filling track at the TAC2014 knowledge base population evaluation. In Text Analysis Conference Knowledge Base Population Workshop (TAC-KBP), 2014."},{"key":"key-10.1145\/3178876.3186000-47","unstructured":"G. Szarvas, V. Vincze, R. Farkas, G. Mora, I. Gurevych. Cross-genre and cross-domain detection of semantic uncertainty. Computational Linguistics, 38(2):335--367, 2012.","DOI":"10.1162\/COLI_a_00098","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-48","unstructured":"P. P. Talukdar, D. Wijaya, T. Mitchell. Coupled temporal scoping of relational facts. In ACM International Conference on Web Search and Data Mining (WSDM), pages 73--82, 2012.","DOI":"10.1145\/2124295.2124307","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-49","unstructured":"M. Valenzuela, V. Ha, O. Etzioni. Identifying meaningful citations. In Workshop on Scholarly Big Data at AAAI, 2015."},{"key":"key-10.1145\/3178876.3186000-50","unstructured":"S. Van Landeghem, J. B&#246;rne, C.-H. Wei, K. Hakala, S. Pyysalo, S. Ananiadou, H.-Y. Kao, Z. Lu, T. Salakoski, Y. Van de Peer, F. Ginter. Large-scale event extraction from literature with multi-level gene normalization. PLoS ONE, 8(4):1--12, 2013.","DOI":"10.1371\/journal.pone.0055814","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-51","unstructured":"D. Vrandecic, M. Kr&#246;tzsch. Wikidata: A free collaborative knowledgebase. Communications of the ACM, 57(10):78--85, 2014.","DOI":"10.1145\/2629489","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-52","unstructured":"Y. Wang, B. Yang, L. Qu, M. Spaniol, G. Weikum. Harvesting facts from textual web sources by constrained label propagation. In ACM International Conference on Information and Knowledge Management (CIKM), pages 837--846, 2011.","DOI":"10.1145\/2063576.2063698","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186000-53","unstructured":"C. Wang, J. Fan. Medical Relation Extraction with Manifold Models In Annual Meeting of the Association for Computational Linguistics (ACL), pages 828--838, 2014.","DOI":"10.3115\/v1\/P14-1078","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186000&ftid=1957373&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:20:07Z","timestamp":1523640007000},"score":1.0,"subtitle":["Higher-arity Fact Harvesting"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":53,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186000","relation":{"cites":[]}}}