{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:27Z","timestamp":1523998767907},"publisher-location":"New York, New York, USA","reference-count":43,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"funder":[{"name":"SUNY Binghamton","award":[]},{"name":"NSF","award":["CCF-1740850","IIS-1703331"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186019","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["A Structured Approach to Understanding Recovery and Relapse in AA"],"prefix":"10.1145","author":[{"given":"Yue","family":"Zhang","sequence":"first","affiliation":[{"name":"SUNY Binghamton, Binghamton, NY, USA"}]},{"given":"Arti","family":"Ramesh","sequence":"additional","affiliation":[{"name":"SUNY Binghamton, Binghamton, NY, USA"}]},{"given":"Jennifer","family":"Golbeck","sequence":"additional","affiliation":[{"name":"University of Maryland, College Park, College Park, MD, USA"}]},{"given":"Dhanya","family":"Sridhar","sequence":"additional","affiliation":[{"name":"University of California, Santa Cruz, Santa Cruz, CA, USA"}]},{"given":"Lise","family":"Getoor","sequence":"additional","affiliation":[{"name":"University of California, Santa Cruz, Santa Cruz, CA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186019-1","unstructured":"American Psychological Association. 2012. Recovery principles. http:\/\/www.apa.org\/monitor\/2012\/01\/recovery-principles.aspx. (2012)."},{"key":"key-10.1145\/3178876.3186019-2","unstructured":"Stephen H. Bach, Matthias Broecheler, Bert Huang, and Lise Getoor. 2017. Hinge-Loss Markov Random Fields and Probabilistic Soft Logic. Journal of Machine Learning Research (JMLR) Vol. 18 (2017), 1--67."},{"key":"key-10.1145\/3178876.3186019-3","unstructured":"Sairam Balani and Munmun De Choudhury. 2015. Detecting and Characterizing Mental Health Related Self-Disclosure in Social Media Proceedings of the Annual ACM Conference on Human Factors in Computing Systems."},{"key":"key-10.1145\/3178876.3186019-4","unstructured":"Steven Bird. 2006. NLTK: the natural language toolkit. In Proceedings of the COLING\/ACL on Interactive presentation sessions.","DOI":"10.3115\/1225403.1225421","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-5","unstructured":"Munmun De Choudhury and Emre Kiciman. 2017. The Language of Social Support in Social Media and its Effect on Suicidal Ideation Risk Proceedings of the International Conference on Web and Social Media (ICWSM)."},{"key":"key-10.1145\/3178876.3186019-6","unstructured":"Neil S Coulson. 2005. Receiving social support online: an analysis of a computer-mediated support group for individuals living with irritable bowel syndrome. Journal of CyberPsychology &#38; Behavior (2005), 580--584."},{"key":"key-10.1145\/3178876.3186019-7","unstructured":"Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity. Proceedings of the International Conference on Web and Social Media (ICWSM)."},{"key":"key-10.1145\/3178876.3186019-8","unstructured":"Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting depression via social media.. In Proceedings of the International Conference on Web and Social Media (ICWSM)."},{"key":"key-10.1145\/3178876.3186019-9","unstructured":"M. Dredze. 2012. How Social Media Will Change Public Health. Journal of IEEE Intelligent Systems Vol. 27 (2012), 81--84.","DOI":"10.1109\/MIS.2012.76","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-10","unstructured":"Marica Ferri, Laura Amato, and Marina Davoli. 2006. Alcoholics Anonymous and other 12-step programmes for alcohol dependence. The Cochrane Library (2006)."},{"key":"key-10.1145\/3178876.3186019-11","unstructured":"Christian Greiner, Anne Chatton, and Yasser Khazaal. 2017. Online self-help forums on cannabis: A content assessment. Journal of Patient Education and Counseling (2017)."},{"key":"key-10.1145\/3178876.3186019-12","unstructured":"Haripriya Harikumar, Thin Nguyen, Sunil Gupta, Santu Rana, Ramachandra Kaimal, and Svetha Venkatesh. 2016. Understanding Behavioral Differences Between Short and Long-Term Drinking Abstainers from Social Media. In Proceedings of the International Conference on Advanced Data Mining and Applications (ADMA).","DOI":"10.1007\/978-3-319-49586-6_36","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-13","unstructured":"Misra K. Epner A. Cooper G. M. Horvath, T.. 2010. Social Learning Theory of Addiction and Recovery Implications. http:\/\/www.amhc.org\/1408-addictions\/article\/48347-social-learning-theory-of-addiction-and-recovery-implications. (2010)."},{"key":"key-10.1145\/3178876.3186019-14","unstructured":"Nabil Hossain, Tianran Hu, Roghayeh Feizi, Ann Marie White, Jiebo Luo, and Henry A. Kautz. 2016. Precise Localization of Homes and Activities: Detecting Drinking-While-Tweeting Patterns in Communities. In Proceedings of the International Conference on Web and Social Media (ICWSM)."},{"key":"key-10.1145\/3178876.3186019-15","unstructured":"Hsiao-Ying Huang and Masooda Bashir. 2016. Online Community and Suicide Prevention: Investigating the Linguistic Cues and Reply Bias. In Proceedings of the Conference on Human Factors in Computing Systems."},{"key":"key-10.1145\/3178876.3186019-16","unstructured":"George M Hunt and Nathan H Azrin. 1973. A community-reinforcement approach to alcoholism. Journal of Behaviour Research and Therapy Vol. 11 (1973), 91--104.","DOI":"10.1016\/0005-7967(73)90072-7","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-17","unstructured":"Rosenquist J, Murabito J, Fowler JH, and Christakis NA. 2010. The spread of alcohol consumption behavior in a large social network. Journal of Annals of Internal Medicine Vol. 152 (2010), 426--433.","DOI":"10.7326\/0003-4819-152-7-201004060-00007","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-18","unstructured":"Jagadeesh Jagarlamudi, Hal Daum&#233;, III, and Raghavendra Udupa. 2012. Incorporating Lexical Priors into Topic Models. In Proceedings of the Conference of the European Chapter of the Association for Computational Linguistics (EACL)."},{"key":"key-10.1145\/3178876.3186019-19","unstructured":"Hua Jin, Sean B Rourke, Thomas L Patterson, Michael J Taylor, and Igor Grant. 1998. Predictors of relapse in long-term abstinent alcoholics. Journal of Studies on Alcohol Vol. 59 (1998), 640--646.","DOI":"10.15288\/jsa.1998.59.640","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-20","unstructured":"Yoram M. Kalman, Kathleen Geraghty, Cynthia K. Thompson, and Darren Gergle. 2012. Detecting Linguistic HCI Markers in an Online Aphasia Support Group Proceedings of the International ACM Conference on Computers and Accessibility (SIGACCESS)."},{"key":"key-10.1145\/3178876.3186019-21","unstructured":"Animesh Koratana, Mark Dredze, Margaret S Chisolm, Matthew W Johnson, and Michael J Paul. 2016. Studying Anonymous Health Issues and Substance Use on College Campuses with Yik Yak AAAI Workshop: WWW and Population Health Intelligence."},{"key":"key-10.1145\/3178876.3186019-22","unstructured":"Adam D. I. Kramer, Susan R. Fussell, and Leslie D. Setlock. 2004. Text Analysis As a Tool for Analyzing Conversation in Online Support Groups Proceedings of the Conference on Human Factors in Computing Systems."},{"key":"key-10.1145\/3178876.3186019-23","unstructured":"Diana MacLean, Sonal Gupta, Anna Lembke, Christopher Manning, and Jeffrey Heer. 2015. Forum77: An analysis of an online health forum dedicated to addiction recovery In proceedings of the ACM Conference on Computer Supported Cooperative Work &#38; Social Computing (CSCW).","DOI":"10.1145\/2675133.2675146","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-24","unstructured":"Stephen A Maisto, Kate B Carey, and Clara M Bradizza. 1999. Social learning theory. Journal of Psychological Theories of Drinking and Alcoholism Vol. 2 (1999), 106--163."},{"key":"key-10.1145\/3178876.3186019-25","unstructured":"Lydia Manikonda, Heather Pon-Barry, Subbarao Kambhampati, Eric Hekler, and David W McDonald. 2014. Discourse analysis of user forums in an online weight loss application Proceedings of the joint workshop on social dynamics and personal attributes in social media."},{"key":"key-10.1145\/3178876.3186019-26","unstructured":"David J McIver, Jared B Hawkins, Rumi Chunara, Arnaub K Chatterjee, Aman Bhandari, Timothy P Fitzgerald, Sachin H Jain, and John S Brownstein. 2015. Characterizing sleep issues using Twitter. Journal of Medical Internet Research Vol. 17 (2015)."},{"key":"key-10.1145\/3178876.3186019-27","unstructured":"Yelena Mejova, Ingmar Weber, and Michael W Macy. 2015. Twitter: a digital socioscope. Cambridge University Press."},{"key":"key-10.1145\/3178876.3186019-28","unstructured":"Liesbeth Mercken, Christian Steglich, Ronald Knibbe, and Hein de Vries. 2012. Dynamics of Friendship Networks and Alcohol Use in Early and Mid-Adolescence. Journal of Studies on Alcohol and Drugs Vol. 73 (2012), 99--110.","DOI":"10.15288\/jsad.2012.73.99","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-29","unstructured":"Megan A Moreno and Jennifer M Whitehill. 2014. Influence of social media on alcohol use in adolescents and young adults. Journal of Alcohol Research: Current Reviews Vol. 36 (2014), 91."},{"key":"key-10.1145\/3178876.3186019-30","unstructured":"World Health Organization and World Health Organization. Management of Substance Abuse Unit. 2014. Global status report on alcohol and health, 2014. World Health Organization."},{"key":"key-10.1145\/3178876.3186019-31","unstructured":"Michael J Paul and Mark Dredze. 2011. You are what you Tweet: Analyzing Twitter for public health. Proceedings of the International Conference on Web and Social Media (ICWSM)."},{"key":"key-10.1145\/3178876.3186019-32","unstructured":"Michael J. Paul and Mark Dredze. 2014. Discovering Health Topics in Social Media Using Topic Models. Journal of PLOS ONE Vol. 9 (2014), e103408.","DOI":"10.1371\/journal.pone.0103408","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-33","unstructured":"James W Pennebaker, Martha E Francis, and Roger J Booth. 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology Vol. 29(1) (2010), 24--54."},{"key":"key-10.1145\/3178876.3186019-34","unstructured":"Julie Repper and Rachel Perkins. 2003. Social inclusion and recovery: A model for mental health practice. Elsevier Health Sciences."},{"key":"key-10.1145\/3178876.3186019-35","unstructured":"Nicolas Rey-Villamizar, Prasha Shrestha, Farig Sadeque, Steven Bethard, Ted Pedersen, Arjun Mukherjee, and Thamar Solorio. 2016. Analysis of anxious word usage on online health forums Proceedings of the International Workshop on Health Text Mining and Information Analysis."},{"key":"key-10.1145\/3178876.3186019-36","unstructured":"Bruce Simons-Morton. 2007. Social influences on adolescent substance use. American Journal of Health Behavior Vol. 31 (2007), 672--684.","DOI":"10.5993\/AJHB.31.6.13","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-37","unstructured":"Acar Tamersoy, Duen Horng Chau, and Munmun De Choudhury. 2017. Analysis of Smoking and Drinking Relapse in an Online Community Proceedings of the International Conference on Digital Health."},{"key":"key-10.1145\/3178876.3186019-38","unstructured":"Morgan Walker, Laura Thornton, Munmun De Choudhury, Jaime Teevan, Cynthia M. Bulik, Cheri A. Levinson, and Stephanie Zerwas. 2015. Facebook Use and Disordered Eating in College-Aged Women. Journal of Adolescent Health Vol. 57 (2015), 157--163.","DOI":"10.1016\/j.jadohealth.2015.04.026","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-39","unstructured":"Yi-Chia Wang, Robert Kraut, and John M Levine. 2012. To stay or leave?: the relationship of emotional and informational support to commitment in online health support groups. In Proceedings of the ACM conference on Computer Supported Cooperative Work (CSCW).","DOI":"10.1145\/2145204.2145329","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-40","unstructured":"Marsha White and Steve M Dorman. 2001. Receiving social support online: implications for health education. Journal of Health Education Research Vol. 16 (2001), 693--707.","DOI":"10.1093\/her\/16.6.693","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186019-41","unstructured":"Andrew J Winzelberg, Catherine Classen, Georg W Alpers, Heidi Roberts, Cheryl Koopman, Robert E Adams, Heidemarie Ernst, Parvati Dev, and C Barr Taylor. 2003. Evaluation of an internet support group for women with primary breast cancer. Journal of Cancer Vol. 97 (2003), 1164--1173."},{"key":"key-10.1145\/3178876.3186019-42","unstructured":"Mark D Wood, Jennifer P Read, Roger E Mitchell, and Nancy H Brand. 2004. Do parents still matter? Parent and peer influences on alcohol involvement among recent high school graduates. Journal of Psychology of Addictive Behaviors Vol. 18 (2004), 19."},{"key":"key-10.1145\/3178876.3186019-43","unstructured":"Ronghua Xu and Qingpeng Zhang. 2016. Understanding online health groups for depression: social network and linguistic perspectives. Journal of Medical Internet Research Vol. 18, 3 (2016).","DOI":"10.2196\/jmir.5042","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186019&ftid=1957437&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:35:56Z","timestamp":1523640956000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":43,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186019","relation":{"cites":[]}}}