{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:27Z","timestamp":1523998767427},"publisher-location":"New York, New York, USA","reference-count":67,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186004","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Never-Ending Learning for Open-Domain Question Answering over Knowledge Bases"],"prefix":"10.1145","author":[{"given":"Abdalghani","family":"Abujabal","sequence":"first","affiliation":[{"name":"Max Planck Institute for Informatics, Saarbruecken, Germany"}]},{"given":"Rishiraj","family":"Saha Roy","sequence":"additional","affiliation":[{"name":"Max Planck Institute for Informatics, Saarbruecken, Germany"}]},{"given":"Mohamed","family":"Yahya","sequence":"additional","affiliation":[{"name":"Bloomberg L.P., London, United Kingdom"}]},{"given":"Gerhard","family":"Weikum","sequence":"additional","affiliation":[{"name":"Max Planck Institute for Informatics, Saarbruecken, Germany"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186004-1","unstructured":"Abdalghani Abujabal, Mohamed Yahya, Mirek Riedewald, and Gerhard Weikum. 2017. Automated Template Generation for Question Answering over Knowledge Graphs WWW."},{"key":"key-10.1145\/3178876.3186004-2","unstructured":"Eugene Agichtein, Eric Brill, and Susan Dumais. 2006 a. Improving Web search ranking by incorporating user behavior information SIGIR."},{"key":"key-10.1145\/3178876.3186004-3","unstructured":"Eugene Agichtein, Eric Brill, Susan Dumais, and Robert Ragno. 2006 b. Learning user interaction models for predicting Web search result preferences SIGIR."},{"key":"key-10.1145\/3178876.3186004-4","unstructured":"Krisztian Balog, Marc Bron, and Maarten de Rijke. 2011. Query modeling for entity search based on terms, categories, and examples. TOIS (2011)."},{"key":"key-10.1145\/3178876.3186004-5","unstructured":"Junwei Bao, Nan Duan, Zhao Yan, Ming Zhou, and Tiejun Zhao. 2016. Constraint-Based Question Answering with Knowledge Graph COLING."},{"key":"key-10.1145\/3178876.3186004-6","unstructured":"Hannah Bast and Elmar Haussmann. 2015. More Accurate Question Answering on Freebase. In CIKM.","DOI":"10.1145\/2806416.2806472","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-7","unstructured":"Emily M. Bender, Dan Flickinger, Stephan Oepen, Woodley Packard, and Ann A. Copestake. 2015. Layers of Interpretation: On Grammar and Compositionality International Conference on Computational Semantics."},{"key":"key-10.1145\/3178876.3186004-8","unstructured":"Michael Bendersky, Xuanhui Wang, Donald Metzler, and Marc Najork. 2017. Learning from user interactions in personal search via attribute parameterization WSDM."},{"key":"key-10.1145\/3178876.3186004-9","unstructured":"Jonathan Berant, Andrew Chou, Roy Frostig, and Percy Liang. 2013. Semantic Parsing on Freebase from Question-Answer Pairs EMNLP."},{"key":"key-10.1145\/3178876.3186004-10","unstructured":"Jonathan Berant and Percy Liang. 2014. Semantic Parsing via Paraphrasing. In ACL.","DOI":"10.3115\/v1\/P14-1133","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-11","unstructured":"Roi Blanco, Peter Mika, and Sebastiano Vigna. 2011. Effective and Efficient Entity Search in RDF Data ISWC."},{"key":"key-10.1145\/3178876.3186004-12","unstructured":"Kurt Bollacker, Colin Evans, Praveen Paritosh, Tim Sturge, and Jamie Taylor. 2008. Freebase: A Collaboratively Created Graph Database for Structuring Human Knowledge SIGMOD."},{"key":"key-10.1145\/3178876.3186004-13","unstructured":"Antoine Bordes, Sumit Chopra, and Jason Weston. 2014. Question Answering with Subgraph Embeddings. In EMNLP.","DOI":"10.3115\/v1\/D14-1067","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-14","unstructured":"Antoine Bordes, Nicolas Usunier, Sumit Chopra, and Jason Weston. 2015. Large-scale simple question answering with memory networks. arXiv (2015)."},{"key":"key-10.1145\/3178876.3186004-15","unstructured":"Eric Brill, Susan Dumais, and Michele Banko. 2002. An analysis of the AskMSR question-answering system EMNLP."},{"key":"key-10.1145\/3178876.3186004-16","unstructured":"Qingqing Cai and Alexander Yates. 2013. Large-scale Semantic Parsing via Schema Matching and Lexicon Extension ACL."},{"key":"key-10.1145\/3178876.3186004-17","unstructured":"Danqi Chen and Christopher D. Manning. 2014. A Fast and Accurate Dependency Parser using Neural Networks EMNLP."},{"key":"key-10.1145\/3178876.3186004-18","unstructured":"Long Chen, Joemon M. Jose, Haitao Yu, Fajie Yuan, and Dell Zhang. 2016. A Semantic Graph based Topic Model for Question Retrieval in Community Question Answering WSDM."},{"key":"key-10.1145\/3178876.3186004-19","unstructured":"Jeffrey Dalton, Laura Dietz, and James Allan. 2014. Entity query feature expansion using knowledge base links SIGIR."},{"key":"key-10.1145\/3178876.3186004-20","unstructured":"Andrew Carlson et al.. 2010. Toward an Architecture for Never-Ending Language Learning AAAI."},{"key":"key-10.1145\/3178876.3186004-21","unstructured":"S&#246;ren Auer et al.. 2007. DBpedia: A Nucleus for a Web of Open Data. In ISWC.","DOI":"10.1007\/978-3-540-76298-0_52","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-22","unstructured":"Tom M. Mitchell et al.. 2015. Never-Ending Learning Conference on AI."},{"key":"key-10.1145\/3178876.3186004-23","unstructured":"Anthony Fader, Luke Zettlemoyer, and Oren Etzioni. 2013. Paraphrase-Driven Learning for Open Question Answering ACL."},{"key":"key-10.1145\/3178876.3186004-24","unstructured":"Anthony Fader, Luke Zettlemoyer, and Oren Etzioni. 2014. Open Question Answering over Curated and Extracted Knowledge Bases KDD."},{"key":"key-10.1145\/3178876.3186004-25","unstructured":"Evgeniy Gabrilovich, Michael Ringgaard, and Amarnag Subramanya. 2013. FACC1: Freebase annotation of ClueWeb corpora. (2013)."},{"key":"key-10.1145\/3178876.3186004-26","unstructured":"Sanda M. Harabagiu, Marius Pasca, and Steven J. Maiorano. 2000. Experiments with Open-Domain Textual Question Answering COLING."},{"key":"key-10.1145\/3178876.3186004-27","unstructured":"Marti A. Hearst. 1992. Automatic Acquisition of Hyponyms from Large Text Corpora COLING."},{"key":"key-10.1145\/3178876.3186004-28","unstructured":"Srinivasan Iyer, Ioannis Konstas, Alvin Cheung, Jayant Krishnamurthy, and Luke Zettlemoyer. 2017. Learning a Neural Semantic Parser from User Feedback ACL."},{"key":"key-10.1145\/3178876.3186004-29","unstructured":"Jiwoon Jeon, W. Bruce Croft, and Joon Ho Lee. 2005. Finding similar questions in large question and answer archives CIKM."},{"key":"key-10.1145\/3178876.3186004-30","unstructured":"Thorsten Joachims. 2002. Optimizing search engines using clickthrough data. KDD.","DOI":"10.1145\/775047.775067","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-31","unstructured":"Mandar Joshi, Uma Sawant, and Soumen Chakrabarti. 2014. Knowledge Graph and Corpus Driven Segmentation and Answer Inference for Telegraphic Entity-seeking Queries. In EMNLP.","DOI":"10.3115\/v1\/D14-1117","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-32","unstructured":"Jyrki Kivinen, Alexander J Smola, and Robert C Williamson. 2004. Online learning with kernels. IEEE Trans. on Signal Processing."},{"key":"key-10.1145\/3178876.3186004-33","unstructured":"Jayant Krishnamurthy and Tom M. Mitchell. 2015. Learning a Compositional Semantics for Freebase with an Open Predicate Vocabulary. TACL (2015)."},{"key":"key-10.1145\/3178876.3186004-34","unstructured":"Tom Kwiatkowski, Eunsol Choi, Yoav Artzi, and Luke S. Zettlemoyer. 2013. Scaling Semantic Parsers with On-the-Fly Ontology Matching EMNLP."},{"key":"key-10.1145\/3178876.3186004-35","unstructured":"Fei Li and Hosagrahar Visvesvaraya Jagadish. 2014. NaLIR: an interactive natural language interface for querying relational databases SIGMOD."},{"key":"key-10.1145\/3178876.3186004-36","unstructured":"Liangda Li, Hongbo Deng, Anlei Dong, Yi Chang, Ricardo Baeza-Yates, and Hongyuan Zha. 2017. Exploring Query Auto-Completion and Click Logs for Contextual-Aware Web Search and Query Suggestion. In WWW.","DOI":"10.1145\/3038912.3052593","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-37","unstructured":"Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient Estimation of Word Representations in Vector Space. arXiv (2013)."},{"key":"key-10.1145\/3178876.3186004-38","unstructured":"Mike Mintz, Steven Bills, Rion Snow, and Daniel Jurafsky. 2009. Distant supervision for relation extraction without labeled data ACL."},{"key":"key-10.1145\/3178876.3186004-39","unstructured":"Filip Radlinski and Thorsten Joachims. 2005. Query chains: learning to rank from implicit feedback KDD.","DOI":"10.1145\/1081870.1081899","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-40","unstructured":"Siva Reddy, Oscar T\"ackstr&#246;m, Michael Collins, Tom Kwiatkowski, Dipanjan Das, Mark Steedman, and Mirella Lapata. 2016. Transforming Dependency Structures to Logical Forms for Semantic Parsing. TACL."},{"key":"key-10.1145\/3178876.3186004-41","unstructured":"Kiril Ribarov. 2004. Review: Open-Domain Question Answering from Large Text Collections, by Marius Pasca. Prague Bull. Math. Linguistics (2004)."},{"key":"key-10.1145\/3178876.3186004-42","unstructured":"Denis Savenkov and Eugene Agichtein. 2016. When a Knowledge Base Is Not Enough: Question Answering over Knowledge Bases with External Text Data. In SIGIR."},{"key":"key-10.1145\/3178876.3186004-43","unstructured":"Uma Sawant and Soumen Chakrabarti. 2013. Learning Joint Query Interpretation and Response Ranking WWW."},{"key":"key-10.1145\/3178876.3186004-44","unstructured":"Yu Su, Shengqi Yang, Huan Sun, Mudhakar Srivatsa, Sue Kase, Michelle Vanni, and Xifeng Yan. 2015. Exploiting relevance feedback in knowledge graph search KDD.","DOI":"10.1145\/2783258.2783320","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-45","unstructured":"Fabian M. Suchanek, Gjergji Kasneci, and Gerhard Weikum. 2007. Yago: A Core of Semantic Knowledge. In WWW.","DOI":"10.1145\/1242572.1242667","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-46","unstructured":"Huan Sun, Hao Ma, Wen-tau Yih, Chen-Tse Tsai, Jingjing Liu, and Ming-Wei Chang. 2015. Open Domain Question Answering via Semantic Enrichment WWW."},{"key":"key-10.1145\/3178876.3186004-47","unstructured":"Thanh Tran, Philipp Cimiano, Sebastian Rudolph, and Rudi Studer. 2007. Ontology-Based Interpretation of Keywords for Semantic Search ISWC."},{"key":"key-10.1145\/3178876.3186004-48","unstructured":"Christina Unger, Lorenz B&#252;hmann, Jens Lehmann, Axel-Cyrille Ngonga Ngomo, Daniel Gerber, and Philipp Cimiano. 2012. Template-based question answering over RDF data. WWW.","DOI":"10.1145\/2187836.2187923","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-49","unstructured":"Ellen M. Voorhees. 2001. The Philosophy of Information Retrieval Evaluation CLEF."},{"key":"key-10.1145\/3178876.3186004-50","unstructured":"Kai Wang, Zhaoyan Ming, and Tat-Seng Chua. 2009. A syntactic tree matching approach to finding similar questions in community-based QA services. In SIGIR.","DOI":"10.1145\/1571941.1571975","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-51","unstructured":"Sida I. Wang, Percy Liang, and Christopher D. Manning. 2016. Learning Language Games through Interaction. In ACL.","DOI":"10.18653\/v1\/P16-1224","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-52","unstructured":"Yushi Wang, Jonathan Berant, and Percy Liang. 2015. Building a Semantic Parser Overnight. In ACL.","DOI":"10.3115\/v1\/P15-1129","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-53","unstructured":"Keenon Werling, Arun Tejasvi Chaganty, Percy Liang, and Christopher D. Manning. 2015. On-the-Job Learning with Bayesian Decision Theory. Conference on Neural Information Processing Systems."},{"key":"key-10.1145\/3178876.3186004-54","unstructured":"Kun Xu, Yansong Feng, Songfang Huang, and Dongyan Zhao. 2016 a. Hybrid Question Answering over Knowledge Base and Free Text COLING."},{"key":"key-10.1145\/3178876.3186004-55","unstructured":"Kun Xu, Siva Reddy, Yansong Feng, Songfang Huang, and Dongyan Zhao. 2016 b. Question Answering on Freebase via Relation Extraction and Textual Evidence ACL."},{"key":"key-10.1145\/3178876.3186004-56","unstructured":"Mohamed Yahya, Denilson Barbosa, Klaus Berberich, Qiuyue Wang, and Gerhard Weikum. 2016. Relationship Queries on Extended Knowledge Graphs. WSDM.","DOI":"10.1145\/2835776.2835795","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-57","unstructured":"Mohamed Yahya, Klaus Berberich, Shady Elbassuoni, and Gerhard Weikum. 2013. Robust question answering over the web of linked data CIKM."},{"key":"key-10.1145\/3178876.3186004-58","unstructured":"Min-Chul Yang, Nan Duan, Ming Zhou, and Hae-Chang Rim. 2014. Joint Relational Embeddings for Knowledge-based Question Answering EMNLP."},{"key":"key-10.1145\/3178876.3186004-59","unstructured":"Yi Yang and Ming-Wei Chang. 2015. S-MART: Novel Tree-based Structured Learning Algorithms Applied to Tweet Entity Linking ACL."},{"key":"key-10.1145\/3178876.3186004-60","unstructured":"Xuchen Yao and Benjamin Van Durme. 2014. Information Extraction over Structured Data: Question Answering with Freebase ACL."},{"key":"key-10.1145\/3178876.3186004-61","unstructured":"Wen-tau Yih, Ming-Wei Chang, Xiaodong He, and Jianfeng Gao. 2015. Semantic Parsing via Staged Query Graph Generation: Question Answering with Knowledge Base ACL."},{"key":"key-10.1145\/3178876.3186004-62","unstructured":"Pengcheng Yin, Nan Duan, Ben Kao, Junwei Bao, and Ming Zhou. 2015. Answering Questions with Complex Semantic Constraints on Open Knowledge Bases CIKM."},{"key":"key-10.1145\/3178876.3186004-63","unstructured":"Kai Zhang, Wei Wu, Fang Wang, Ming Zhou, and Zhoujun Li. 2016. Learning Distributed Representations of Data in Community Question Answering for Question Retrieval. In WSDM.","DOI":"10.1145\/2835776.2835786","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-64","unstructured":"Kai Zhang, Wei Wu, Haocheng Wu, Zhoujun Li, and Ming Zhou. 2014. Question Retrieval with High Quality Answers in Community Question Answering CIKM."},{"key":"key-10.1145\/3178876.3186004-65","unstructured":"Weiguo Zheng, Lei Zou, Xiang Lian, Jeffrey Xu Yu, Shaoxu Song, and Dongyan Zhao. 2015. How to Build Templates for RDF Question\/Answering: An Uncertain Graph Similarity Join Approach. In Conference on Management of Data.","DOI":"10.1145\/2723372.2747648","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-66","unstructured":"Guangyou Zhou, Tingting He, Jun Zhao, and Po Hu. 2015. Learning Continuous Word Embedding with Metadata for Question Retrieval in Community Question Answering. In ACL.","DOI":"10.3115\/v1\/P15-1025","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186004-67","unstructured":"Lei Zou, Ruizhe Huang, Haixun Wang, Jeffrey Xu Yu, Wenqiang He, and Dongyan Zhao. 2014. Natural language question answering over RDF: A graph data driven approach Conference on Management of Data."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186004&ftid=1957344&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:22:52Z","timestamp":1523640172000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":67,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186004","relation":{"cites":[]}}}