{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:58:52Z","timestamp":1523998732874},"publisher-location":"New York, New York, USA","reference-count":47,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186087","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["An Automated Approach to Auditing Disclosure of Third-Party Data Collection in Website Privacy Policies"],"prefix":"10.1145","author":[{"given":"Timothy","family":"Libert","sequence":"first","affiliation":[{"name":"University of Oxford, Oxford, United Kingdom"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186087-1","unstructured":"Gunes Acar, Christian Eubank, Steven Englehardt, Marc Juarez, Arvind Narayanan, and Claudia Diaz. 2014. The web never forgets: Persistent tracking mechanisms in the wild Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security. ACM, 674--689.","DOI":"10.1145\/2660267.2660347","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-2","unstructured":"Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science Vol. 347, 6221 (2015), 509--514.","DOI":"10.1126\/science.aaa1465","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-3","unstructured":"Alessandro Acquisti and Jens Grossklags. 2005. Privacy and rationality in individual decision making. IEEE Security &#38; Privacy Vol. 2 (2005), 24--30.","DOI":"10.1109\/MSP.2005.22","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-4","unstructured":"American Association of Advertising Agencies, Association of National Advertisers, Council of Better Business Bureaus, Direct Marketing Association, and the Interactive Advertising Bureau. 2010. Self-Regulatory Principles for Online Behavioral Advertising. (2010)."},{"key":"key-10.1145\/3178876.3186087-5","unstructured":"Solon Barocas and Helen Nissenbaum. 2009. On notice: The trouble with Notice and Consent. In Proceedings of the Engaging Data Forum: The First International Forum on the Application and Management of Personal Electronic Information."},{"key":"key-10.1145\/3178876.3186087-6","unstructured":"Muhammad Ahmad Bashir, Sajjad Arshad, William K Robertson, and Christo Wilson. 2016. Tracing Information flows Between Ad Exchanges Using Retargeted Ads. USENIX Security Symposium. 481--496."},{"key":"key-10.1145\/3178876.3186087-7","unstructured":"Ceren Budak, Sharad Goel, Justin Rao, and Georgios Zervas. 2016. Understanding emerging threats to online advertising Proceedings of the 2016 ACM Conference on Economics and Computation. ACM, 561--578."},{"key":"key-10.1145\/3178876.3186087-8","unstructured":"Aaron Cahn, Scott Alfeld, Paul Barford, and S Muthukrishnan. 2016. An empirical study of web cookies. In Proceedings of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 891--901.","DOI":"10.1145\/2872427.2882991","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-9","unstructured":"Fred H Cate. 2006. The Failure of Fair Information Practice Principles. In Consumer Protection in the Age of the `Information Economy'. Routledge."},{"key":"key-10.1145\/3178876.3186087-10","unstructured":"Lorrie Faith Cranor, Pedro Giovanni Leon, and Blase Ur. 2016. A large-scale evaluation of US financial institutions' standardized privacy notices. ACM Transactions on the Web (TWEB) Vol. 10, 3 (2016), 17.","DOI":"10.1145\/2911988","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-11","unstructured":"Lorrie Faith Cranor, Joseph Reagle, and Mark S Ackerman. 2000. Beyond concern: Understanding net users' attitudes about online privacy. Cambridge, MA: MIT Press."},{"key":"key-10.1145\/3178876.3186087-12","unstructured":"Steven Englehardt and Arvind Narayanan. 2016. Online tracking: A 1-million-site measurement and analysis Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security. ACM, 1388--1401.","DOI":"10.1145\/2976749.2978313","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-13","unstructured":"Steven Englehardt, Dillon Reisman, Christian Eubank, Peter Zimmerman, Jonathan Mayer, Arvind Narayanan, and Edward W Felten. 2015. Cookies that give you away: The surveillance implications of web tracking Proceedings of the 24th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 289--299.","DOI":"10.1145\/2736277.2741679","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-14","unstructured":"Oscar H Gandy. 2003. Public opinion surveys and the formation of privacy policy. Journal of Social Issues Vol. 59, 2 (2003), 283--299.","DOI":"10.1111\/1540-4560.00065","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-15","unstructured":"Robert Gellman. 2016. Fair information practices: A basic history. Self Published (2016)."},{"key":"key-10.1145\/3178876.3186087-16","unstructured":"Phillipa Gill, Vijay Erramilli, Augustin Chaintreau, Balachander Krishnamurthy, Konstantina Papagiannaki, and Pablo Rodriguez. 2013. Follow the money: understanding economics of online aggregation and advertising Proceedings of the 2013 conference on Internet measurement conference. ACM, 141--148."},{"key":"key-10.1145\/3178876.3186087-17","unstructured":"Christian Hauschke. 2016. Third-Party-Elemente in deutschen Bibliothekswebseiten. Informationspraxis Vol. 2, 2 (2016)."},{"key":"key-10.1145\/3178876.3186087-18","unstructured":"Jacob Kastrenakes. 2013. Google's chief internet evangelist says `privacy may actually be an anomaly'. (November. 2013). deftempurl%https:\/\/www.theverge.com\/2013\/11\/20\/5125922\/vint-cerf-google-internet-evangelist-says-privacy-may-be-anomaly tempurl"},{"key":"key-10.1145\/3178876.3186087-19","unstructured":"Christian Kohlsch&#252;tter, Peter Fankhauser, and Wolfgang Nejdl. 2010. Boilerplate detection using shallow text features. In Proceedings of the third ACM international conference on Web search and data mining. ACM, 441--450.","DOI":"10.1145\/1718487.1718542","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-20","unstructured":"Saranga Komanduri, Richard Shay, Greg Norcie, and Blase Ur. 2011. Adchoices-compliance with online behavioral advertising notice and choice requirements. ISJLP Vol. 7 (2011), 603."},{"key":"key-10.1145\/3178876.3186087-21","unstructured":"Balachander Krishnamurthy and Craig Wills. 2009. Privacy diffusion on the web: a longitudinal perspective Proceedings of the 18th International Conference on World Wide Web. ACM, 541--550.","DOI":"10.1145\/1526709.1526782","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-22","unstructured":"Balachander Krishnamurthy and Craig E Wills. 2006. Generating a privacy footprint on the internet. In Proceedings of the 6th ACM SIGCOMM Conference on Internet Measurement. ACM, 65--70.","DOI":"10.1145\/1177080.1177088","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-23","unstructured":"Adam Lerner, Anna Kornfeld Simpson, Tadayoshi Kohno, and Franziska Roesner. 2016. Internet Jones and the Raiders of the Lost Trackers: An Archaeological Study of Web Tracking from 1996 to 2016.. In USENIX Security Symposium."},{"key":"key-10.1145\/3178876.3186087-24","unstructured":"Timothy Libert. 2015 a. Exposing the Hidden Web: Third-Party HTTP Requests On One Million Websites. International Journal of Communication (2015)."},{"key":"key-10.1145\/3178876.3186087-25","unstructured":"Timothy Libert. 2015 b. Privacy Implications of Health Information Seeking on the Web. Commun. ACM (2015)."},{"key":"key-10.1145\/3178876.3186087-26","unstructured":"Mary Madden. 2014. Public Perceptions of Privacy and Security in the Post-Snowden Era. Pew Research Center (2014)."},{"key":"key-10.1145\/3178876.3186087-27","unstructured":"Jonathan R Mayer and Arvind Narayanan. 2011. Do Not Track: A Universal Third-Party Web Tracking Opt Out. Internet Engineering Task Force Vol. http:\/\/www.ietf.org\/archive\/id\/draft-mayer-do-not-track-00.txt (2011)."},{"key":"key-10.1145\/3178876.3186087-28","unstructured":"Aleecia M McDonald and Lorrie Faith Cranor. 2008. The Cost of reading privacy policies. I\/S: A Journal Of Law And Policy For The Information Society Vol. 4 (2008), 543."},{"key":"key-10.1145\/3178876.3186087-29","unstructured":"Aleecia M McDonald, Robert W Reeder, Patrick Gage Kelley, and Lorrie Faith Cranor. 2009. A comparative study of online privacy policies and formats Privacy Enhancing Technologies. Springer, 37--55."},{"key":"key-10.1145\/3178876.3186087-30","unstructured":"National Institutes of Health, History of Medicine Division. 2002. Greek Medicine. http:\/\/www.nlm.nih.gov\/hmd\/greek\/greek_oath.html (2002)."},{"key":"key-10.1145\/3178876.3186087-31","unstructured":"Network Advertising Initiative. 2011. NAI Code of Conduct. Network Advertising Initiative (2011)."},{"key":"key-10.1145\/3178876.3186087-32","unstructured":"Joel R Reidenberg, Travis Breaux, Lorrie Faith Cranor, Brian French, Amanda Grannis, James T Graves, Fei Liu, Aleecia M McDonald, Thomas B Norton, Rohan Ramanath, et almbox.. 2014. Disagreeable privacy policies: Mismatches between meaning and users' understanding. Berkeley Technology Law Journal (2014)."},{"key":"key-10.1145\/3178876.3186087-33","unstructured":"Franziska Roesner, Tadayoshi Kohno, and David Wetherall. 2012. Detecting and defending against third-party tracking on the web Proceedings of the 9th USENIX conference on Networked Systems Design and Implementation. USENIX Association, 12--12."},{"key":"key-10.1145\/3178876.3186087-34","unstructured":"Marc Rotenberg. 2001. Fair information practices and the architecture of privacy (What Larry doesn't get). Stanford Technology Law Review (2001), 1."},{"key":"key-10.1145\/3178876.3186087-35","unstructured":"Yaokai Feng Danilo Vasconcellos Vargas Kouichi Sakurai Shiqian Yu, Tomohisa Ishikawa. 2017. Privacy Leakage of Job-related Information Seeking in Online Social Networks. Information Processing Society of Japan SIG Technical Report (2017)."},{"key":"key-10.1145\/3178876.3186087-36","unstructured":"Daniel J Solove. 2012. Introduction: Privacy self-management and the consent dilemma. Harvard Law Review Vol. 126 (2012), 1880."},{"key":"key-10.1145\/3178876.3186087-37","unstructured":"Alex Spengler and Patrick Gallinari. 2010. Document structure meets page layout: loopy random fields for web news content extraction. In Proceedings of the 10th ACM symposium on Document engineering. ACM, 151--160.","DOI":"10.1145\/1860559.1860590","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-38","unstructured":"Jeffrey Han Steven Englehardt and Arvind Narayanan. 2018. I never signed up for this! Privacy implications of email tracking. Proceedings on Privacy Enhancing Technologies (2018)."},{"key":"key-10.1145\/3178876.3186087-39","unstructured":"Martino Trevisan, Stefano Traverso, Hassan Metwalley, and Marco Mellia. 2017. Uncovering the Flop of the EU Cookie Law. arXiv preprint arXiv:1705.08884 (2017)."},{"key":"key-10.1145\/3178876.3186087-40","unstructured":"Joseph Turow and Michael Hennessy. 2007. Internet privacy and institutional trust insights from a national survey. New Media &#38; Society Vol. 9, 2 (2007), 300--318.","DOI":"10.1177\/1461444807072219","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-41","unstructured":"Joseph Turow, Michael Hennessy, and Nora A Draper. 2015. The Tradeoff Fallacy, How Marketers are Misrepresenting American Consumers and Opening Them Up to Exploitation. The Annenberg School for Communication, University of Pennsylvania (2015)."},{"key":"key-10.1145\/3178876.3186087-42","unstructured":"United States Federal Trade Commission. 2009. FTC staff report: Self-regulatory principles for online behavioral advertising. (2009)."},{"key":"key-10.1145\/3178876.3186087-43","unstructured":"United States Federal Trade Commission. 2012. Prepared Statement of the Federal Trade Commission On The Need For Privacy Protections: Perspectives From the Administration and the Federal Trade Commission. (May. 2012)."},{"key":"key-10.1145\/3178876.3186087-44","unstructured":"Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, useful, scary, creepy: perceptions of online behavioral advertising Proceedings of the Eighth Symposium on Usable Privacy and Security. ACM, 4.","DOI":"10.1145\/2335356.2335362","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-45","unstructured":"Max Van Kleek, Ilaria Liccardi, Reuben Binns, Jun Zhao, Daniel J Weitzner, and Nigel Shadbolt. 2017. Better the devil you know: Exposing the data sharing practices of smartphone apps. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5208--5220.","DOI":"10.1145\/3025453.3025556","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-46","unstructured":"Shomir Wilson, Florian Schaub, Rohan Ramanath, Norman Sadeh, Fei Liu, Noah A Smith, and Frederick Liu. 2016. Crowdsourcing Annotations for Websites' Privacy Policies: Can It Really Work? Proceedings of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 133--143.","DOI":"10.1145\/2872427.2883035","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186087-47","unstructured":"Jinyan Zang, Krysta Dummit, James Graves, Paul Lisker, and Latanya Sweeney. 2015. Who knows what about me? A survey of behind the scenes personal data sharing to third parties by mobile apps. Technology Science Vol. 30 (2015)."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186087&ftid=1957529&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:08:46Z","timestamp":1523635726000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":47,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186087","relation":{"cites":[]}}}