{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:14Z","timestamp":1523998754519},"publisher-location":"New York, New York, USA","reference-count":33,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186154","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Latent Relational Metric Learning via Memory-based Attention for Collaborative Ranking"],"prefix":"10.1145","author":[{"given":"Yi","family":"Tay","sequence":"first","affiliation":[{"name":"Nanyang Technological University, Singapore, Singapore"}]},{"given":"Luu","family":"Anh Tuan","sequence":"additional","affiliation":[{"name":"Agency for Science and Technology Research, Singapore, Singapore"}]},{"given":"Siu Cheung","family":"Hui","sequence":"additional","affiliation":[{"name":"Nanyang Technological University, Singapore, Singapore"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186154-1","unstructured":"Immanuel Bayer, Xiangnan He, Bhargav Kanagal, and Steffen Rendle. 2017. A Generic Coordinate Descent Framework for Learning from Implicit Feedback Proceedings of the 26th International Conference on World Wide Web, WWW 2017, Perth, Australia, April 3--7, 2017. 1341--1350. deftempurl%https:\/\/doi.org\/10.1145\/3038912.3052694showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-2","unstructured":"Antoine Bordes, Nicolas Usunier, Alberto Garc'&#305;a-Dur&#225;n, Jason Weston, and Oksana Yakhnenko. 2013. Translating Embeddings for Modeling Multi-relational Data Advances in Neural Information Processing Systems 26: 27th Annual Conference on Neural Information Processing Systems 2013. Proceedings of a meeting held December 5--8, 2013, Lake Tahoe, Nevada, United States. 2787--2795."},{"key":"key-10.1145\/3178876.3186154-3","unstructured":"Jingyuan Chen, Hanwang Zhang, Xiangnan He, Liqiang Nie, Wei Liu, and Tat-Seng Chua. 2017. Attentive Collaborative Filtering: Multimedia Recommendation with Item- and Component-Level Attention. In Proceedings of the 40th International ACM SIGIR Conference on Research and Development in Information Retrieval, Shinjuku, Tokyo, Japan, August 7--11, 2017. 335--344. deftempurl%https:\/\/doi.org\/10.1145\/3077136.3080797showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-4","unstructured":"Qiming Diao, Minghui Qiu, Chao-Yuan Wu, Alexander J. Smola, Jing Jiang, and Chong Wang. 2014. Jointly modeling aspects, ratings and sentiments for movie recommendation (JMARS) The 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD '14, New York, NY, USA - August 24 - 27, 2014. 193--202. deftempurl%https:\/\/doi.org\/10.1145\/2623330.2623758showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-5","unstructured":"F. Maxwell Harper and Joseph A. Konstan. 2016. The MovieLens Datasets: History and Context. TiiS Vol. 5, 4 (2016), 19:1--19:19. deftempurl%https:\/\/doi.org\/10.1145\/2827872showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-6","unstructured":"Ruining He, Wang-Cheng Kang, and Julian McAuley. 2017 a. Translation-based Recommendation. In Proceedings of the Eleventh ACM Conference on Recommender Systems (RecSys '17). ACM, New York, NY, USA, 161--169. deftempurl%https:\/\/doi.org\/10.1145\/3109859.3109882showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-7","unstructured":"Xiangnan He, Lizi Liao, Hanwang Zhang, Liqiang Nie, Xia Hu, and Tat-Seng Chua. 2017 b. Neural Collaborative Filtering. In Proceedings of the 26th International Conference on World Wide Web (WWW '17). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 173--182. deftempurl%https:\/\/doi.org\/10.1145\/3038912.3052569showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-8","unstructured":"Xiangnan He, Hanwang Zhang, Min-Yen Kan, and Tat-Seng Chua. 2016. Fast Matrix Factorization for Online Recommendation with Implicit Feedback Proceedings of the 39th International ACM SIGIR conference on Research and Development in Information Retrieval, SIGIR 2016, Pisa, Italy, July 17--21, 2016. 549--558. deftempurl%https:\/\/doi.org\/10.1145\/2911451.2911489showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-9","unstructured":"Cheng-Kang Hsieh, Longqi Yang, Yin Cui, Tsung-Yi Lin, Serge J. Belongie, and Deborah Estrin. 2017. Collaborative Metric Learning. In Proceedings of the 26th International Conference on World Wide Web, WWW 2017, Perth, Australia, April 3--7, 2017. 193--201. deftempurl%https:\/\/doi.org\/10.1145\/3038912.3052639showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-10","unstructured":"Yifan Hu, Yehuda Koren, and Chris Volinsky. 2008. Collaborative Filtering for Implicit Feedback Datasets Proceedings of the 8th IEEE International Conference on Data Mining (ICDM 2008), December 15--19, 2008, Pisa, Italy. 263--272. deftempurl%https:\/\/doi.org\/10.1109\/ICDM.2008.22showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-11","unstructured":"Kalervo J\"arvelin and Jaana Kek\"al\"ainen. 2002. Cumulated gain-based evaluation of IR techniques. ACM Trans. Inf. Syst. Vol. 20, 4 (2002), 422--446. deftempurl%https:\/\/doi.org\/10.1145\/582415.582418showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-12","unstructured":"Diederik P. Kingma and Jimmy Ba. 2014. Adam: A Method for Stochastic Optimization. CoRR Vol. abs\/1412.6980 (2014)."},{"key":"key-10.1145\/3178876.3186154-13","unstructured":"Yehuda Koren. 2008. Factorization meets the neighborhood: a multifaceted collaborative filtering model. In Proceedings of the 14th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, Las Vegas, Nevada, USA, August 24--27, 2008. 426--434. deftempurl%https:\/\/doi.org\/10.1145\/1401890.1401944showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-14","unstructured":"Xiaopeng Li and James She. 2017. Collaborative Variational Autoencoder for Recommender Systems Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, Halifax, NS, Canada, August 13 - 17, 2017. 305--314. deftempurl%https:\/\/doi.org\/10.1145\/3097983.3098077showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-15","unstructured":"Yankai Lin, Zhiyuan Liu, Maosong Sun, Yang Liu, and Xuan Zhu. 2015. Learning Entity and Relation Embeddings for Knowledge Graph Completion Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence, January 25--30, 2015, Austin, Texas, USA. 2181--2187."},{"key":"key-10.1145\/3178876.3186154-16","unstructured":"Minh-Thang Luong, Hieu Pham, and Christopher D Manning. 2015. Effective approaches to attention-based neural machine translation. arXiv preprint arXiv:1508.04025 (2015)."},{"key":"key-10.1145\/3178876.3186154-17","unstructured":"Yao Ma, Zhaochun Ren, Ziheng Jiang, Jiliang Tang, and Dawei Yin. 2018. Multi-Dimensional Network Embedding with Hierarchical Structure Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining (WSDM '18)."},{"key":"key-10.1145\/3178876.3186154-18","unstructured":"Tomas Mikolov, Ilya Sutskever, Kai Chen, Gregory S. Corrado, and Jeffrey Dean. 2013. Distributed Representations of Words and Phrases and their Compositionality Advances in Neural Information Processing Systems 26: 27th Annual Conference on Neural Information Processing Systems 2013. Proceedings of a meeting held December 5--8, 2013, Lake Tahoe, Nevada, United States. 3111--3119."},{"key":"key-10.1145\/3178876.3186154-19","unstructured":"Alexander Miller, Adam Fisch, Jesse Dodge, Amir-Hossein Karimi, Antoine Bordes, and Jason Weston. 2016. Key-value memory networks for directly reading documents. arXiv preprint arXiv:1606.03126 (2016)."},{"key":"key-10.1145\/3178876.3186154-20","unstructured":"Volodymyr Mnih, Nicolas Heess, Alex Graves, and Koray Kavukcuoglu. 2014. Recurrent Models of Visual Attention. In Advances in Neural Information Processing Systems 27: Annual Conference on Neural Information Processing Systems 2014, December 8--13 2014, Montreal, Quebec, Canada. 2204--2212."},{"key":"key-10.1145\/3178876.3186154-21","unstructured":"Bryan Perozzi, Rami Al-Rfou, and Steven Skiena. 2014. DeepWalk: online learning of social representations The 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD '14, New York, NY, USA - August 24 - 27, 2014. 701--710. deftempurl%https:\/\/doi.org\/10.1145\/2623330.2623732showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-22","unstructured":"Tuan-Anh Nguyen Pham, Xutao Li, Gao Cong, and Zhenjie Zhang. 2015. A general graph-based model for recommendation in event-based social networks 31st IEEE International Conference on Data Engineering, ICDE 2015, Seoul, South Korea, April 13--17, 2015. 567--578. deftempurl%https:\/\/doi.org\/10.1109\/ICDE.2015.7113315showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-23","unstructured":"Minh C. Phan, Aixin Sun, Yi Tay, Jialong Han, and Chenliang Li. 2017. NeuPL: Attention-based Semantic Matching and Pair-Linking for Entity Disambiguation. In Proceedings of the 2017 ACM on Conference on Information and Knowledge Management, CIKM 2017, Singapore, November 06 - 10, 2017. 1667--1676. deftempurl%https:\/\/doi.org\/10.1145\/3132847.3132963showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-24","unstructured":"Steffen Rendle. 2010. Factorization Machines. In ICDM 2010, The 10th IEEE International Conference on Data Mining, Sydney, Australia, 14--17 December 2010. 995--1000. deftempurl%https:\/\/doi.org\/10.1109\/ICDM.2010.127showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-25","unstructured":"Steffen Rendle, Christoph Freudenthaler, Zeno Gantner, and Lars Schmidt-Thieme. 2009. BPR: Bayesian Personalized Ranking from Implicit Feedback UAI 2009, Proceedings of the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence, Montreal, QC, Canada, June 18--21, 2009. 452--461."},{"key":"key-10.1145\/3178876.3186154-26","unstructured":"Tim Rockt\"aschel, Edward Grefenstette, Karl Moritz Hermann, Tom&#225;vs Kovcisk&#7923;, and Phil Blunsom. 2015. Reasoning about entailment with neural attention. arXiv preprint arXiv:1509.06664 (2015)."},{"key":"key-10.1145\/3178876.3186154-27","unstructured":"Badrul M. Sarwar, George Karypis, Joseph A. Konstan, and John Riedl. 2001. Item-based collaborative filtering recommendation algorithms Proceedings of the Tenth International World Wide Web Conference, WWW 10, Hong Kong, China, May 1--5, 2001. 285--295. deftempurl%https:\/\/doi.org\/10.1145\/371920.372071showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-28","unstructured":"Sainbayar Sukhbaatar, Arthur Szlam, Jason Weston, and Rob Fergus. 2015. End-To-End Memory Networks. In Advances in Neural Information Processing Systems 28: Annual Conference on Neural Information Processing Systems 2015, December 7--12, 2015, Montreal, Quebec, Canada. 2440--2448."},{"key":"key-10.1145\/3178876.3186154-29","unstructured":"Jian Tang, Meng Qu, Mingzhe Wang, Ming Zhang, Jun Yan, and Qiaozhu Mei. 2015. LINE: Large-scale Information Network Embedding. In Proceedings of the 24th International Conference on World Wide Web, WWW 2015, Florence, Italy, May 18--22, 2015. 1067--1077. deftempurl%https:\/\/doi.org\/10.1145\/2736277.2741093showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-30","unstructured":"Jiaxi Tang and Ke Wang. 2018. Personalized Top-N Sequential Recommendation via Convolutional Sequence Embedding Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining (WSDM '18)."},{"key":"key-10.1145\/3178876.3186154-31","unstructured":"Yi Tay, Anh Tuan Luu, and Siu Cheung Hui. 2017 a. Learning to Attend via Word-Aspect Associative Fusion for Aspect-based Sentiment Analysis. (2017). s:\/\/doi.org\/10.1145\/3077136.3080689showDOItempurl"},{"key":"key-10.1145\/3178876.3186154-32","unstructured":"Lei Zheng, Vahid Noroozi, and Philip S. Yu. 2017. Joint Deep Modeling of Users and Items Using Reviews for Recommendation Proceedings of the Tenth ACM International Conference on Web Search and Data Mining, WSDM 2017, Cambridge, United Kingdom, February 6--10, 2017. 425--434."},{"key":"key-10.1145\/3178876.3186154-33","unstructured":"Cai-Nicolas Ziegler, Sean M. McNee, Joseph A. Konstan, and Georg Lausen. 2005. Improving recommendation lists through topic diversification Proceedings of the 14th international conference on World Wide Web, WWW 2005, Chiba, Japan, May 10--14, 2005. 22--32. deftempurl%https:\/\/doi.org\/10.1145\/1060745.1060754showDOItempurl"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186154&ftid=1957467&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:50:13Z","timestamp":1523638213000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":33,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186154","relation":{"cites":[]}}}