{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:25Z","timestamp":1525103725761},"publisher-location":"New York, New York, USA","reference-count":37,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"European Union's Horizon 2020 research and innovation programme","award":["No 636160-2"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191627","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Detection of Stress and Relaxation Magnitudes for Tweets"],"prefix":"10.1145","author":[{"given":"Reshmi","family":"Gopalakrishna Pillai","sequence":"first","affiliation":[{"name":"University of Wolverhampton, Wolverhampton, United Kingdom"}]},{"given":"Mike","family":"Thelwall","sequence":"additional","affiliation":[{"name":"University of Wolverhampton, Wolverhampton, United Kingdom"}]},{"given":"Constantin","family":"Orasan","sequence":"additional","affiliation":[{"name":"University of Wolverhampton, wolverhampton, United Kingdom"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191627-1","unstructured":"Mike Thelwall. 2017. TensiStrength: stress and relaxation magnitude detection for social media texts. Journal of Information Processing and Management. (2017); 53: 106--121","DOI":"10.1016\/j.ipm.2016.06.009","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-2","unstructured":"Hans Selye. 1956. The Stress of Life. New York, McGraw-Hill Book Company, Inc."},{"key":"key-10.1145\/3184558.3191627-3","unstructured":"J. Choi and R. Gutierrez-Osuna. Using heart rate monitors to detect mental stress, Proc. 6th Int. Workshop Wearable Implantable BSN, pp. 219--223, 2009.","DOI":"10.1109\/BSN.2009.13","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-4","unstructured":"Y. Shi, N. Ruiz, R. Taib, E. Choi and F. Chen. 2007. \"Galvanic skin response (GSR) as an index of cognitive load\", Proc. CHI Ext. Abstr. Human Factors Comput. Syst., pp. 2651--2656.","DOI":"10.1145\/1240866.1241057","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-5","unstructured":"P. Ren, A. Barreto, J. Huang, Y. Gao, F.R. Ortega, and M. Adjouadi. 2014. Off-line and on-line stress detection through processing of the pupil diameter signal Ann. Biomed. Eng., 42 (1) pp. 162--176, 10.1007\/s10439-013-0880--9"},{"key":"key-10.1145\/3184558.3191627-6","unstructured":"F. Kittel, M. Kornitzer and M. Dramaix. 1986. Evaluation of type A personality. Postgraduate Medical Journal 62(730):781--3.","DOI":"10.1136\/pgmj.62.730.781","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-7","unstructured":"T.H. Holmes and R. H. Rahe. 1967. The social readjustment rating scale. Journal of psychosomatic research,. Elsevier"},{"key":"key-10.1145\/3184558.3191627-8","unstructured":"R. Kotikalapudi, S. Chellappan, F. Montgomery. 2012. Associating Internet usage with depressive behavior among college students. IEEE Technol Soc Mag.;31:73--80.","DOI":"10.1109\/MTS.2012.2225462","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-9","unstructured":"M. A. Moreno, L. A. Jelenchick, K. G. Egan, E. Cox, H. Young, K. E. Gannon et. al. 2011. Feeling bad on Facebook: Depression disclosure by college students on a social networking site. Depression and Anxiety, 28(6), 447--455.","DOI":"10.1002\/da.20805","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-10","unstructured":"M. De Choudhury, M. Gamon, S. Counts, and E. Horvitz. 2013. Predicting depression via social media. In Proceedings of the International AAAI Conference on Weblogs and Social Media (ICWSM)."},{"key":"key-10.1145\/3184558.3191627-11","unstructured":"G. A. Coppersmith, C. T. Harman, and M. Dredze. 2014. Measuring post traumatic stress disorder in Twitter. In Proceedings of the International AAAI Conference on Weblogs and Social Media (ICWSM)."},{"key":"key-10.1145\/3184558.3191627-12","unstructured":"M. De Choudhury, S. Counts and E. Horvitz. 2013. Social media as a measurement tool of depression in populations. In Proceedings of the 5th Annual ACM Web Science Conference (WebSci '13). ACM, New York, NY, USA, 47--56. DOI=http:\/\/dx.doi.org\/10.1145\/2464464.","DOI":"10.1145\/2464464","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-13","unstructured":"M. De Choudhury, S. Counts, and E. Horvitz. 2013. Predicting postpartum changes in emotion and behavior via social media. In Proceedings of the ACM Annual Conference on Human Factors in Computing Systems (CHI), 3267-- 3276.","DOI":"10.1145\/2470654.2466447","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-14","unstructured":"G. Coppersmith, M. Dredze, C. Harman. 2014. Quantifying Mental Health Signals in Twitter. In: Proceedings of the Workshop on Computational Linguistics and Clinical Psychology: From Linguistic Signal to Clinical Reality. ACL; 2014. p. 51--60.","DOI":"10.3115\/v1\/W14-3207","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-15","unstructured":"Y. R. Tausczik and J. W. Pennebaker, 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of language and social psychology, 29(1), 24--54.","DOI":"10.1177\/0261927X09351676","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-16","unstructured":"P. J. Stone, D. C. Dunphy, M. S. Smith and D. M. Ogilvie. 1966. The general inquirer: A computer approach to content analysis. Cambridge, MA: The MIT Press."},{"key":"key-10.1145\/3184558.3191627-17","unstructured":"M. Thelwall, K. Buckley G. Paltoglou, D. Cai and A. Kappas. 2010. Sentiment strength detection in short informal text. Journal of the American Society for Information Science and Technology, 61(12), 2544--2558.","DOI":"10.1002\/asi.21416","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-18","unstructured":"H. Lin, J. Jia, J. J. Qiu, et al. 2017. Detecting stress based on social interactions in social networks. IEEE Transactions on Knowledge and Data Engineering.","DOI":"10.1109\/TKDE.2017.2686382","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-19","unstructured":"H. Lin, J. Jia, J. Huang. et al. 2016. Moodee: An Intelligent Mobile Companion for Sensing Your Stress from Your Social Media Postings. Thirtieth AAAI Conference on Artificial Intelligence."},{"key":"key-10.1145\/3184558.3191627-20","unstructured":"H. Lin, J. Jia, J. Huang. et al. 2014. Psychological stress detection from cross-media microblog data using deep sparse neural network. In proceedings of IEEE International Conference on Multimedia &#38; Expo.","DOI":"10.1109\/ICME.2014.6890213","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-21","unstructured":"H. Lin, J. Jia, J. Huang. et al. 2014. User-level psychological stress detection from social media using deep neural network. In Proceedings of ACM Int. Conference on Multimedia.","DOI":"10.1145\/2647868.2654945","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-22","unstructured":"H. Lin, J. Jia, L. Nie, G. Shen, and T. S. Chua, 2016. What does social media say about your stress In Proceedings of the Twenty-Fifth International Joint Conference on Artificial Intelligence, 3775--3781."},{"key":"key-10.1145\/3184558.3191627-23","unstructured":"R. Navigli. 2009. Word Sense Disambiguation: A survey. ACM Computing Surveys, 41 (2009), 1--69.","DOI":"10.1145\/1459352.1459355","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-24","unstructured":"C. Sumanth and D. Inkpen. 2015. How much does word sense disambiguation help in sentiment analysis of micropost data In Proceedings of the 6th Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis, 115--121, Lisbon.","DOI":"10.18653\/v1\/W15-2916","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-25","unstructured":"V. Rentoumi, G. Giannakopoulos, V. Karkaletsis, and G. Vouros. 2009. Sentiment analysis of figurative language using a word sense disambiguation approach. In Proc. of the International Conference RANLP'09, pages 370-- 375, Borovets, Bulgaria."},{"key":"key-10.1145\/3184558.3191627-26","unstructured":"C. Hung, S. J. CHEN, 2013: Word sense disambiguation based sentiment lexicons for sentiment classification. Decision Support Systems, vol. 55, no. 3, pp. 685--697."},{"key":"key-10.1145\/3184558.3191627-27","unstructured":"I. Hulpus, N. Prangnawarat, C. Hayes. 2015. Path-based semantic relatedness on linked data and its use to word and entity disambiguation, Proc. 14th Int. Semantic Web Conf., pp. 442--457.","DOI":"10.1007\/978-3-319-25007-6_26","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-28","unstructured":"B. Razon and C. Cheng. 2011. Word Sense Disambiguation of Opinionated Words Using Extended Gloss Overlap. 2011. In Proceedings of the 8th National Natural Language Processing Research Symposium, 1--5, Manilla."},{"key":"key-10.1145\/3184558.3191627-29","unstructured":"S. Banerjee and T. Peterson 2003. Extended Gloss Overlaps as a Measure of Semantic Relatedness. In Proceedings of the 18th International Joint Conference on Artificial Intelligence, 802--810, Mexico."},{"key":"key-10.1145\/3184558.3191627-30","unstructured":"G. Z. Bautista, M. A. Garcia and R. J. Tan. 2010. VoxPop: Automated Opinion Detection and Classification with Data Clustering. Manila."},{"key":"key-10.1145\/3184558.3191627-31","unstructured":"J. Pennington, R. Socher and C. D. Manning. 2014. Glove: Global Vectors for Word Representation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP) (October 2014), 1532--1543.","DOI":"10.3115\/v1\/D14-1162","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-32","unstructured":"T. Mikolov, K. Chen, G. Corrado and J. Dean. 2013. Efficient Estimation of Word Representation in Vector Space. arXiv preprint arXiv:1301.3781,1--12."},{"key":"key-10.1145\/3184558.3191627-33","unstructured":"T. Mikolov, I. Sutskever, K. Chen, G. Corrado and J. Dean. 2013. Distributed Representations of Words, Advances in neural information processing systems, 3111--3119."},{"key":"key-10.1145\/3184558.3191627-34","unstructured":"A. Trask, P. Michalak, and J. Liu. 2015. Sense2vec-a fast and accurate method for word sense disambiguation in neural word embeddings. arXiv preprint arXiv:1511.06388."},{"key":"key-10.1145\/3184558.3191627-35","unstructured":"X. Chen, Z. Liu and M. Sun. 2014. A unified model for word sense representation and disambiguation. In EMNLP. 1025--1035.","DOI":"10.3115\/v1\/D14-1110","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-36","unstructured":"F. Godin, B. Vandersmissen, W. De Neve and R. Van de Walle. 2015. Named entity recognition for Twitter microposts using distributed word representations. In Proceedings of the Workshop on Noisy User-generated Text, pages 146-- 153, Beijing, China, July 2015. Association for Computational Linguistics.","DOI":"10.18653\/v1\/W15-4322","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191627-37","unstructured":"K. Krippendorff. 2004. Content analysis: An introduction to its methodology. Thousand Oaks, CA: Sage."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191627&ftid=1958385&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T21:06:28Z","timestamp":1524085588000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":37,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191627","relation":{"cites":[]}}}