{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:23Z","timestamp":1523998763328},"publisher-location":"New York, New York, USA","reference-count":63,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"National Science Foundation Graduate Research Fellowship Program","award":["DGE 1322106"]},{"name":"Leverhulme Trust via the CFI","award":[]},{"name":"The Alan Turing Institute under EPSRC grant","award":["EP\/N510129\/1 & TU\/B\/000074"]},{"name":"David MacKay Newton research fellowship at Darwin College","award":[]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186138","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Human Perceptions of Fairness in Algorithmic Decision Making"],"prefix":"10.1145","author":[{"given":"Nina","family":"Grgic-Hlaca","sequence":"first","affiliation":[{"name":"Max Planck Institute for Software Systems (MPI-SWS) & Saarland University, Saarbrücken, Germany"}]},{"given":"Elissa M.","family":"Redmiles","sequence":"additional","affiliation":[{"name":"University of Maryland, College Park, MD, USA"}]},{"given":"Krishna P.","family":"Gummadi","sequence":"additional","affiliation":[{"name":"Max Planck Institute for Software Systems (MPI-SWS) & Saarland University, Saarbrücken, Germany"}]},{"given":"Adrian","family":"Weller","sequence":"additional","affiliation":[{"name":"Cambridge University & Alan Turing Institute, Cambridge, United Kingdom"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186138-1","unstructured":"Amanda Y Agan and Sonja B Starr. 2016. Ban the Box, Criminal Records, and Statistical Discrimination: A Field Experiment. (2016)."},{"key":"key-10.1145\/3178876.3186138-2","unstructured":"Fatima M Albar and Antonie J Jetter. 2009. Heuristics in Decision Making. In PICMET."},{"key":"key-10.1145\/3178876.3186138-3","unstructured":"Richard M Alston, James R Kearl, and Michael B Vaughan. 1992. Is There a Consensus among Economists in the 1990's? The American Economic Review (1992)."},{"key":"key-10.1145\/3178876.3186138-4","unstructured":"Elizabeth S Anderson. 1999. What is the Point of Equality? Ethics (1999)."},{"key":"key-10.1145\/3178876.3186138-5","unstructured":"Julia Angwin, Jeff Larson, Surya Mattu, and Lauren Kirchner. 2016. Machine Bias: There's Software Used Across the Country to Predict Future Criminals. And it's Biased Against Blacks. https:\/\/www.propublica.org\/article\/ machine-bias-risk-assessments-in-criminal-sentencing. (2016)."},{"key":"key-10.1145\/3178876.3186138-6","unstructured":"Richard J Arneson. 2000. Luck Egalitarianism and Prioritarianism. Ethics (2000)."},{"key":"key-10.1145\/3178876.3186138-7","unstructured":"Solon Barocas and Andrew D. Selbst. 2016. Big Data's Disparate Impact. California Law Review (2016)."},{"key":"key-10.1145\/3178876.3186138-8","unstructured":"Francesco Bonchi, Sara Hajian, Bud Mishra, and Daniele Ramazzotti. 2017. Exposing the Probabilistic Causal Structure of Discrimination. International Journal of Data Science and Analytics (2017)."},{"key":"key-10.1145\/3178876.3186138-9","unstructured":"Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology (2006)."},{"key":"key-10.1145\/3178876.3186138-10","unstructured":"Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2011. Amazon's Mechanical Turk: A New Source of Inexpensive, yet High-Quality, Data? Perspectives on Psychological Science (2011).","DOI":"10.1177\/1745691610393980","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186138-11","unstructured":"Kenneth P Burnham and David R Anderson. 2003. Model Selection and Multimodel Inference: A Practical Information-Theoretic Approach. Springer Science &#38; Business Media."},{"key":"key-10.1145\/3178876.3186138-12","unstructured":"Alexandra Chouldechova. 2016. Fair Prediction with Disparate Impact: A Study of Bias in Recidivism Prediction Instruments. arXiv:1610.07524 (2016)."},{"key":"key-10.1145\/3178876.3186138-13","unstructured":"Civil Rights Act. 1964. Civil Rights Act of 1964, Title VII, Equal Employment Opportunities. (1964)."},{"key":"key-10.1145\/3178876.3186138-14","unstructured":"Sam Corbett-Davies, Emma Pierson, Avi Feller, Sharad Goel, and Aziz Huq. 2017. Algorithmic Decision Making and the Cost of Fairness. In KDD.","DOI":"10.1145\/3097983.3098095","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186138-15","unstructured":"Daubert v. Merrell Dow Pharmaceuticals, Inc. 509 U.S. 579 1993. (1993)."},{"key":"key-10.1145\/3178876.3186138-16","unstructured":"Marc Dupuis, Barbara Endicott-Popovsky, and Robert Crossler. 2013. An Analysis of the Use of Amazon's Mechanical Turk for Survey Research in the Cloud. In ICCSM."},{"key":"key-10.1145\/3178876.3186138-17","unstructured":"Cynthia Dwork, Moritz Hardt, Toniann Pitassi, and Omer Reingold. 2012. Fairness Through Awareness. In ITCSC.","DOI":"10.1145\/2090236.2090255","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186138-18","unstructured":"Hillel J Einhorn and Robin M Hogarth. 1981. Behavioral Decision Theory: Processes of Judgement and Choice. Annual Review of Psychology (1981)."},{"key":"key-10.1145\/3178876.3186138-19","unstructured":"Federal Rules of Evidence, Rule 401. Test for Relevant Evidence 2015. (2015)."},{"key":"key-10.1145\/3178876.3186138-20","unstructured":"Federal Rules of Evidence, Rule 402. General Admissibility of Relevant Evidence 2015. (2015)."},{"key":"key-10.1145\/3178876.3186138-21","unstructured":"Michael Feldman, Sorelle A. Friedler, John Moeller, Carlos Scheidegger, and Suresh Venkatasubramanian. 2015. Certifying and Removing Disparate Impact. In KDD.","DOI":"10.1145\/2783258.2783311","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186138-22","unstructured":"Anthony W. Flores, Christopher T. Lowenkamp, and Kristin Bechtel. 2016. False Positives, False Negatives, and False Analyses: A Rejoinder to \"Machine Bias: There's Software Used Across the Country to Predict Future Criminals. And it's Biased Against Blacks.\". (2016)."},{"key":"key-10.1145\/3178876.3186138-23","unstructured":"Bruno S Frey, Werner W Pommerehne, Friedrich Schneider, and Guy Gilbert. 1984. Consensus and Dissension Among Economists: An Empirical Inquiry. The American Economic Review (1984)."},{"key":"key-10.1145\/3178876.3186138-24","unstructured":"Sorelle A. Friedler, Carlos Scheidegger, and Suresh Venkatasubramanian. 2016. On the (im)possibility of Fairness. arXiv:1609.07236 (2016)."},{"key":"key-10.1145\/3178876.3186138-25","unstructured":"Duncan Gallie, Serge Paugam, and Sheila Jacobs. 2003. Unemployment, Poverty and Social Isolation: Is There a Vicious Circle of Social Exclusion? European Societies (2003)."},{"key":"key-10.1145\/3178876.3186138-26","unstructured":"Bernard Gert and Joshua Gert. 2017. The Definition of Morality. In The Stanford Encyclopedia of Philosophy, Edward N. Zalta (Ed.). Metaphysics Research Lab, Stanford University."},{"key":"key-10.1145\/3178876.3186138-27","unstructured":"Gerd Gigerenzer and Wolfgang Gaissmaier. 2011. Heuristic Decision Making. Annual Review of Psychology (2011)."},{"key":"key-10.1145\/3178876.3186138-28","unstructured":"Nina Grgi&#263;-Hla&#269;a, Muhammad Bilal Zafar, Krishna P Gummadi, and Adrian Weller. 2016. The Case for Process Fairness in Learning: Feature Selection for Fair Decision Making. In NIPS Symposium on Machine Learning and the Law."},{"key":"key-10.1145\/3178876.3186138-29","unstructured":"Nina Grgi&#263;-Hla&#269;a, Muhammad Bilal Zafar, Krishna P Gummadi, and Adrian Weller. 2018. Beyond Distributive Fairness in Algorithmic Decision Making: Feature Selection for Procedurally Fair Learning. In AAAI."},{"key":"key-10.1145\/3178876.3186138-30","unstructured":"Enrique Herrera-Viedma, Jos&#233; Luis Garc&#237;a-Lapresta, Janusz Kacprzyk, Mario Fedrizzi, Hannu Nurmi, and S&#322;awomir Zadrozny. 2011. Consensual Processes. Springer.","DOI":"10.1007\/978-3-642-20533-0","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186138-31","unstructured":"Panagiotis G Ipeirotis. 2010. Demographics of Mechanical Turk. (2010)."},{"key":"key-10.1145\/3178876.3186138-32","unstructured":"Faisal Kamiran and Toon Calders. 2010. Classification with No Discrimination by Preferential Sampling. In BENELEARN."},{"key":"key-10.1145\/3178876.3186138-33","unstructured":"Katz v. United States, 389 U.S. 347, 88 S. Ct. 507, 19 L. Ed. 2d 576 1967. (1967)."},{"key":"key-10.1145\/3178876.3186138-34","unstructured":"Niki Kilbertus, Mateo Rojas-Carulla, Giambattista Parascandolo, Moritz Hardt, Dominik Janzing, and Bernhard Sch&#246;lkopf. 2017. Avoiding Discrimination through Causal Reasoning. In NIPS."},{"key":"key-10.1145\/3178876.3186138-35","unstructured":"Jon Kleinberg, Sendhil Mullainathan, and Manish Raghavan. 2017. Inherent Trade-Offs in the Fair Determination of Risk Scores. In ITCS."},{"key":"key-10.1145\/3178876.3186138-36","unstructured":"J. A. Krosnick. 2010. Handbook of Survey Research."},{"key":"key-10.1145\/3178876.3186138-37","unstructured":"Solomon Kullback and Richard A Leibler. 1951. On Information and Sufficiency. The Annals of Mathematical Statistics (1951)."},{"key":"key-10.1145\/3178876.3186138-38","unstructured":"Kumho Tire Co. v. Carmichael, 526 U.S. 137 1999. (1999)."},{"key":"key-10.1145\/3178876.3186138-39","unstructured":"Matt J. Kusner, Joshua R. Loftus, Chris Russell, and Ricardo Silva. 2017. Counterfactual Fairness. In NIPS."},{"key":"key-10.1145\/3178876.3186138-40","unstructured":"Binh Thanh Luong, Salvatore Ruggieri, and Franco Turini. 2011. kNN as an Implementation of Situation Testing for Discrimination Discovery and Prevention. In KDD."},{"key":"key-10.1145\/3178876.3186138-41","unstructured":"Paul Mosley and Arjan Verschoor. 2005. Risk Attitudes and the 'Vicious Circle of Poverty'. The European Journal of Development Research (2005)."},{"key":"key-10.1145\/3178876.3186138-42","unstructured":"Razieh Nabi and Ilya Shpitser. 2018. Fair Inference on Outcomes. In AAAI."},{"key":"key-10.1145\/3178876.3186138-43","unstructured":"Laurens Naudts. 2017. Fair or Unfair Algorithmic Differentiation? Luck Egalitarianism As a Lens for Evaluating Algorithmic Decision-Making. (2017)."},{"key":"key-10.1145\/3178876.3186138-44","unstructured":"J&#281;drzej Niklas, Karolina Sztandar-Sztanderska, and Katarzyna Szymielewicz. 2015. Profiling the Unemployed in Poland: Social and Political Implications of Algorithmic Decision Making. https:\/\/panoptykon.org\/sites\/default\/files\/leadimagebiblioteka\/panoptykon_profiling_report_final.pdf. (2015)."},{"key":"key-10.1145\/3178876.3186138-45","unstructured":"Gabriele Paolacci, Jesse Chandler, and Panagiotis G Ipeirotis. 2010. Running Experiments on Amazon Mechanical Turk. (2010)."},{"key":"key-10.1145\/3178876.3186138-46","unstructured":"F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research (2011)."},{"key":"key-10.1145\/3178876.3186138-47","unstructured":"Dino Pedreschi, Salvatore Ruggieri, and Franco Turini. 2008. Discriminationaware Data Mining. In KDD."},{"key":"key-10.1145\/3178876.3186138-48","unstructured":"Pew Research Center. 2016. 2016 Party Identification Detailed Tables. (2016). http: \/\/www.people-press.org\/2016\/09\/13\/2016-party-identification-detailed-tables\/"},{"key":"key-10.1145\/3178876.3186138-49","unstructured":"Stanley Presser, Mick P. Couper, Judith T. Lessler, Elizabeth Martin, Jean Martin, Jennifer M. Rothgeb, and Eleanor Singer. 2004. Methods for Testing and Evaluating Survey Questions. Public Opinion Quarterly (2004)."},{"key":"key-10.1145\/3178876.3186138-50","unstructured":"ProPublica. 2016. COMPAS CORE Sample Risk Asessment Questionnaire. https:\/\/www.documentcloud.org\/documents\/ 2702103-Sample-Risk-Assessment-COMPAS-CORE.html. (2016)."},{"key":"key-10.1145\/3178876.3186138-51","unstructured":"Bilal Qureshi, Faisal Kamiran, Asim Karim, and Salvatore Ruggieri. 2016. Causal Discrimination Discovery Through Propensity Score Analysis. arXiv preprint arXiv:1608.03735 (2016)."},{"key":"key-10.1145\/3178876.3186138-52","unstructured":"Elissa M Redmiles, Yasemin Acar, Sascha Fahl, and Michelle L Mazurek. 2017. A Summary of Survey Methodology Best Practices for Security and Privacy Researchers. Technical Report."},{"key":"key-10.1145\/3178876.3186138-53","unstructured":"Joel Ross, Lilly Irani, M Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who Are The Crowdworkers?: Shifting Demographics in Mechanical Turk. In CHI."},{"key":"key-10.1145\/3178876.3186138-54","unstructured":"Chris Russell, Matt J Kusner, Joshua Loftus, and Ricardo Silva. 2017. When Worlds Collide: Integrating Different Counterfactual Assumptions in Fairness. In NIPS."},{"key":"key-10.1145\/3178876.3186138-55","unstructured":"Claude E Shannon. 1948. A Mathematical Theory of Communication. The Bell System Technical Journal (1948)."},{"key":"key-10.1145\/3178876.3186138-56","unstructured":"William J Tastle and Mark J Wierman. 2007. Consensus and Dissention: A Measure of Ordinal Dispersion. International Journal of Approximate Reasoning (2007)."},{"key":"key-10.1145\/3178876.3186138-57","unstructured":"U.S. Census Bureau. 2016. American Community Survey 5-Year Estimates. (2016)."},{"key":"key-10.1145\/3178876.3186138-58","unstructured":"Weeks v. United States, 232 U.S. 383, 34 S.Ct. 341, 58 L.Ed. 652 1914. (1914)."},{"key":"key-10.1145\/3178876.3186138-59","unstructured":"Gordon B. Willis. 2005. Cognitive Interviewing: A Tool for Improving Questionnaire Design."},{"key":"key-10.1145\/3178876.3186138-60","unstructured":"Muhammad Bilal Zafar, Isabel Valera, Manuel Gomez Rodriguez, and Krishna P. Gummadi. 2017. Fairness Beyond Disparate Treatment &#38; Disparate Impact: Learning Classification without Disparate Mistreatment. In WWW."},{"key":"key-10.1145\/3178876.3186138-61","unstructured":"Muhammad Bilal Zafar, Isabel Valera, Manuel Gomez Rodriguez, and Krishna P. Gummadi. 2017. Fairness Constraints: Mechanisms for Fair Classification. In AISTATS."},{"key":"key-10.1145\/3178876.3186138-62","unstructured":"R. Zemel, Y. Wu, K. Swersky, T. Pitassi, and C. Dwork. 2013. Learning Fair Representations. In ICML."},{"key":"key-10.1145\/3178876.3186138-63","unstructured":"Lu Zhang and Xintao Wu. 2017. Anti-Discrimination Learning: A Causal Modeling-Based Framework. International Journal of Data Science and Analytics (2017)."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186138&ftid=1957481&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:09:15Z","timestamp":1523639355000},"score":1.0,"subtitle":["A Case Study of Criminal Risk Prediction"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":63,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186138","relation":{"cites":[]}}}