{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:13Z","timestamp":1523998753095},"publisher-location":"New York, New York, USA","reference-count":42,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186151","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Learning Causal Effects From Many Randomized Experiments Using Regularized Instrumental Variables"],"prefix":"10.1145","author":[{"given":"Alexander","family":"Peysakhovich","sequence":"first","affiliation":[{"name":"Facebook Artificial Intelligence Research, New York, NY, USA"}]},{"given":"Dean","family":"Eckles","sequence":"additional","affiliation":[{"name":"Massachusetts Institute of Technology, Cambridge, MA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186151-1","unstructured":"Joshua D Angrist, Guido W Imbens, and Donald B Rubin. 1996. Identification of causal effects using instrumental variables. J. Amer. Statist. Assoc. Vol. 91, 434 (1996), 444--455."},{"key":"key-10.1145\/3178876.3186151-2","unstructured":"Joshua D Angrist and Alan B Krueger. 1995. Split-sample instrumental variables estimates of the return to schooling. Journal of Business &#38; Economic Statistics Vol. 13, 2 (1995), 225--235."},{"key":"key-10.1145\/3178876.3186151-3","unstructured":"Joshua D Angrist and J&#246;rn-Steffen Pischke. 2008. Mostly Harmless Econometrics: An Empiricist's Companion. Princeton university press."},{"key":"key-10.1145\/3178876.3186151-4","unstructured":"Susan Athey and Guido Imbens. 2016. Recursive partitioning for heterogeneous causal effects. Proceedings of the National Academy of Sciences, Vol. 113, 27 (2016), 7353--7360.","DOI":"10.1073\/pnas.1510489113","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-5","unstructured":"E. Bakshy, D. Eckles, and M. S. Bernstein. 2014. Designing and Deploying Online Field Experiments. Proceedings of the 23rd ACM conference on the World Wide Web. ACM.","DOI":"10.1145\/2566486.2567967","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-6","unstructured":"Abhijit Banerjee and Esther Duflo. 2012. Poor Economics: A Radical Rethinking of the Way to Fight Global Poverty. PublicAffairs."},{"key":"key-10.1145\/3178876.3186151-7","unstructured":"Paul A Bekker. 1994. Alternative approximations to the distributions of instrumental variable estimators. Econometrica: Journal of the Econometric Society (1994), 657--681."},{"key":"key-10.1145\/3178876.3186151-8","unstructured":"Alexandre Belloni, Daniel Chen, Victor Chernozhukov, and Christian Hansen. 2012. Sparse models and methods for optimal instruments with an application to eminent domain. Econometrica, Vol. 80, 6 (2012), 2369--2429.","DOI":"10.3982\/ECTA9626","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-9","unstructured":"L&#233;on Bottou. 2014. From machine learning to machine reasoning. Machine Learning, Vol. 94, 2 (2014), 133--149.","DOI":"10.1007\/s10994-013-5335-x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-10","unstructured":"L&#233;on Bottou, Jonas Peters, Joaquin Quinonero Candela, Denis Xavier Charles, Max Chickering, Elon Portugaly, Dipankar Ray, Patrice Y Simard, and Ed Snelson. 2013. Counterfactual reasoning and learning systems: The example of computational advertising. Journal of Machine Learning Research Vol. 14, 1 (2013), 3207--3260."},{"key":"key-10.1145\/3178876.3186151-11","unstructured":"Bob Carpenter, Andrew Gelman, Matt Hoffman, Daniel Lee, Ben Goodrich, Michael Betancourt, Michael A Brubaker, Jiqiang Guo, Peter Li, and Allen Riddell. 2016. Stan: A probabilistic programming language. Journal of Statistical Software (2016)."},{"key":"key-10.1145\/3178876.3186151-12","unstructured":"Gary Chamberlain and Guido Imbens. 2004. Random effects estimators with many instrumental variables. Econometrica, Vol. 72, 1 (2004), 295--306.","DOI":"10.1111\/j.1468-0262.2004.00485.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-13","unstructured":"Dean Eckles, Ren&#233; F Kizilcec, and Eytan Bakshy. 2016. Estimating peer effects in networks with peer encouragement designs. Proceedings of the National Academy of Sciences, Vol. 113, 27 (2016), 7316--7322.","DOI":"10.1073\/pnas.1511201113","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-14","unstructured":"Ziv Epstein, Alexander Peysakhovich, and David G Rand. 2016. The good, the bad, and the unflinchingly selfish: Cooperative decision-making can be predicted with high accuracy when using only three behavioral types Proceedings of the 2016 ACM Conference on Economics and Computation. ACM, 547--559.","DOI":"10.1145\/2940716.2940761","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-15","unstructured":"John C Gittins. 1979. Bandit processes and dynamic allocation indices. Journal of the Royal Statistical Society. Series B (Methodological) (1979), 148--177."},{"key":"key-10.1145\/3178876.3186151-16","unstructured":"Mathew Goldman and Justin M Rao. 2014. Experiments as Instruments: Heterogeneous Position Effects in Sponsored Search Auctions. Available at SSRN 2524688 (2014)."},{"key":"key-10.1145\/3178876.3186151-17","unstructured":"Donald P Green, Shang E Ha, and John G Bullock. 2010. Enough already about &#8220;black box&#8221; experiments: Studying mediation is more difficult than most scholars suppose. The Annals of the American Academy of Political and Social Science, Vol. 628, 1 (2010), 200--208."},{"key":"key-10.1145\/3178876.3186151-18","unstructured":"Justin Grimmer, Solomon Messing, and Sean J Westwood. 2014. Estimating heterogeneous treatment effects and the effects of heterogeneous treatments with ensemble methods. Unpublished manuscript, Stanford University, Stanford, CA (2014)."},{"key":"key-10.1145\/3178876.3186151-19","unstructured":"Christian Hansen and Damian Kozbur. 2014. Instrumental variables estimation with many weak instruments using regularized JIVE. Journal of Econometrics Vol. 182, 2 (2014), 290--308.","DOI":"10.1016\/j.jeconom.2014.04.022","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-20","unstructured":"Jason Hartford, Greg Lewis, Kevin Leyton-Brown, and Matt Taddy. 2016. Counterfactual Prediction with Deep Instrumental Variables Networks. arXiv preprint arXiv:1612.09596 (2016)."},{"key":"key-10.1145\/3178876.3186151-21","unstructured":"Lars G Hemkens, Despina G Contopoulos-Ioannidis, and John PA Ioannidis. 2016. Agreement of treatment effects for mortality from routinely collected data and subsequent randomized trials: Meta-epidemiological survey. British Medical Journal Vol. 352 (2016)."},{"key":"key-10.1145\/3178876.3186151-22","unstructured":"Kosuke Imai, Dustin Tingley, and Teppei Yamamoto. 2013. Experimental designs for identifying causal mechanisms. Journal of the Royal Statistical Society: Series A (Statistics in Society), Vol. 176, 1 (2013), 5--51.","DOI":"10.1111\/j.1467-985X.2012.01032.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-23","unstructured":"Guido Imbens, Joshua Angrist, and Alan Krueger. 1999. Jackknife Instrumental Variables Estimation. Journal of Applied Econometrics Vol. 14, 1 (1999)."},{"key":"key-10.1145\/3178876.3186151-24","unstructured":"Jongbin Jung, Connor Concannon, Ravi Shroff, Sharad Goel, and Daniel G Goldstein. 2017. Simple rules for complex decisions. arXiv preprint arXiv:1702.04690 (2017)."},{"key":"key-10.1145\/3178876.3186151-25","unstructured":"Ron Kohavi, Alex Deng, Brian Frasca, Toby Walker, Ya Xu, and Nils Pohlmann. 2013. Online controlled experiments at large scale. In Proceedings of the 19th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1168--1176.","DOI":"10.1145\/2487575.2488217","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-26","unstructured":"Robert J LaLonde. 1986. Evaluating the econometric evaluations of training programs with experimental data. The American Economic Review (1986), 604--620."},{"key":"key-10.1145\/3178876.3186151-27","unstructured":"Finnian Lattimore, Tor Lattimore, and Mark D Reid. 2016. Causal Bandits: Learning Good Interventions via Causal Inference Advances in Neural Information Processing Systems. 1181--1189."},{"key":"key-10.1145\/3178876.3186151-28","unstructured":"Lihong Li, Wei Chu, John Langford, and Robert E Schapire. 2010. A contextual-bandit approach to personalized news article recommendation Proceedings of the 19th international conference on World wide web. ACM, 661--670."},{"key":"key-10.1145\/3178876.3186151-29","unstructured":"Michelle N Meyer. 2015. Two cheers for corporate experimentation: The A\/B illusion and the virtues of data-driven innovation. J. on Telecomm. &#38; High Tech. L. Vol. 13 (2015), 273."},{"key":"key-10.1145\/3178876.3186151-30","unstructured":"Art B. Owen. 2016. Monte Carlo Theory, Methods and Examples. http:\/\/statweb.stanford.edu\/ owen\/mc\/"},{"key":"key-10.1145\/3178876.3186151-31","unstructured":"Judea Pearl. 2009. Causality. Cambridge University Press.","DOI":"10.1017\/CBO9780511803161","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-32","unstructured":"Alexander Peysakhovich and Jeffrey Naecker. 2017. Using methods from machine learning to evaluate behavioral models of choice under risk and ambiguity. Journal of Economic Behavior &#38; Organization Vol. 133 (2017), 373--384.","DOI":"10.1016\/j.jebo.2016.08.017","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186151-33","unstructured":"Olav Reiers&#246;l. 1945. Confluence analysis by means of instrumental sets of variables. Ph.D. Dissertation. bibinfoschoolStockholm College."},{"key":"key-10.1145\/3178876.3186151-34","unstructured":"Uri Shalit, Fredrik Johansson, and David Sontag. 2016. Bounding and Minimizing Counterfactual Error. arXiv preprint arXiv:1606.03976 (2016)."},{"key":"key-10.1145\/3178876.3186151-35","unstructured":"Douglas Staiger and James H Stock. 1997. Instrumental Variables Regression with Weak Instruments. Econometrica (1997), 557--586."},{"key":"key-10.1145\/3178876.3186151-36","unstructured":"James H Stock, Jonathan H Wright, and Motohiro Yogo. 2012. A survey of weak instruments and weak identification in generalized method of moments. Journal of Business &#38; Economic Statistics (2012)."},{"key":"key-10.1145\/3178876.3186151-37","unstructured":"James H Stock and Motohiro Yogo. 2005. Testing for weak instruments in linear IV regression. Identification and Inference for Econometric Models: Essays in Honor of Thomas Rothenberg. Cambridge University Press, 80--108."},{"key":"key-10.1145\/3178876.3186151-38","unstructured":"Richard S Sutton and Andrew G Barto. 1998. Reinforcement learning: An introduction. Vol. Vol. 1. MIT press Cambridge."},{"key":"key-10.1145\/3178876.3186151-39","unstructured":"Hal Varian. 2016. Intelligent Technology. Finance and Development Vol. 53, 3 (2016)."},{"key":"key-10.1145\/3178876.3186151-40","unstructured":"Jeffrey M Wooldridge. 2010. Econometric Analysis of Cross Section and Panel Data. MIT Press."},{"key":"key-10.1145\/3178876.3186151-41","unstructured":"Philip Green Wright. 1928. The Tariff on Animal and Vegetable Oils. The Macmillan Co."},{"key":"key-10.1145\/3178876.3186151-42","unstructured":"Ya Xu, Nanyu Chen, Addrian Fernandez, Omar Sinno, and Anmol Bhasin. 2015. From infrastructure to culture: A\/B testing challenges in large scale social networks Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 2227--2236.","DOI":"10.1145\/2783258.2788602","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186151&ftid=1957500&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:49:25Z","timestamp":1523638165000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":42,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186151","relation":{"cites":[]}}}