{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:24Z","timestamp":1523998764883},"publisher-location":"New York, New York, USA","reference-count":75,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"NSF","award":["IIS-1408345","IIS-1553088"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186143","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Auditing the Personalization and Composition of Politically-Related Search Engine Results Pages"],"prefix":"10.1145","author":[{"given":"Ronald E.","family":"Robertson","sequence":"first","affiliation":[{"name":"Northeastern University, Boston, MA, USA"}]},{"given":"David","family":"Lazer","sequence":"additional","affiliation":[{"name":"Northeastern University, Boston, MA, USA"}]},{"given":"Christo","family":"Wilson","sequence":"additional","affiliation":[{"name":"Northeastern University, Boston, MA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186143-1","unstructured":"Ahmed Allam, Peter Johannes Schulz, and Kent Nakamoto. 2014. The impact of search engine selection and sorting criteria on vaccination beliefs and attitudes: two experiments manipulating Google output. Journal of Medical Internet Research 16, 4 (2014), e100."},{"key":"key-10.1145\/3178876.3186143-2","unstructured":"Hunt Allcott and Matthew Gentzkow. 2017. Social media and fake news in the 2016 election. Journal of Economic Perspectives 31, 2 (May 2017), 211--236. https:\/\/doi.org\/10.1257\/jep.31.2.211","DOI":"10.1257\/jep.31.2.211","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-3","unstructured":"Solomon E Asch. 1946. Forming impressions of personality. The Journal of Abnormal and Social Psychology 41, 3 (1946), 258--290."},{"key":"key-10.1145\/3178876.3186143-4","unstructured":"Eytan Bakshy, Solomon Messing, and Lada A Adamic. 2015. Exposure to ideologically diverse news and opinion on Facebook. Science 348, 6239 (2015), 1130--1132.","DOI":"10.1126\/science.aaa1160","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-5","unstructured":"Andrea Ballatore, Mark Graham, and Shilad Sen. 2017. Digital hegemonies: the localness of search engine results. Annals of the American Association of Geographers (2017), 1--22.","DOI":"10.1080\/24694452.2017.1308240","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-6","unstructured":"Adam J Berinsky, Gregory A Huber, and Gabriel S Lenz. 2012. Evaluating online labor markets for experimental research: Amazon. com's Mechanical Turk. Political Analysis 20, 3 (2012), 351--368."},{"key":"key-10.1145\/3178876.3186143-7","unstructured":"Edelman Berland. 2017. 2017 Edelman Trust Barometer. http:\/\/www.edelman. com\/trust2017\/. (2017). Accessed: 2017-03-07."},{"key":"key-10.1145\/3178876.3186143-8","unstructured":"SEO Blog. 2014. How to Turn Off Google Personalized Search Results. http: \/\/www.seoblog.com\/2014\/09\/turn-google-personalized-search-results\/. (2014). Accessed: 2017--10-01."},{"key":"key-10.1145\/3178876.3186143-9","unstructured":"Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2011. Amazon's Mechanical Turk a new source of inexpensive, yet high-quality, data? Perspectives on Psychological Science 6, 1 (2011), 3--5.","DOI":"10.1177\/1745691610393980","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-10","unstructured":"Georg Buscher, Edward Cutrell, and Meredith Ringel Morris. 2009. What do you see when you're surfing?: using eye tracking to predict salient regions of web pages. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 21--30.","DOI":"10.1145\/1518701.1518705","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-11","unstructured":"Traffic Generation Cafe. 2017. Google Incognito: How to Search Google Without Being Tracked. https:\/\/trafficgenerationcafe.com\/ search-engine-ranking-tip-incognito-search\/. (2017). Accessed: 2017--10-01."},{"key":"key-10.1145\/3178876.3186143-12","unstructured":"Le Chen, Alan Mislove, and Christo Wilson. 2015. Peeking Beneath the Hood of Uber. In Proceedings of the 2015 ACM Conference on Internet Measurement.","DOI":"10.1145\/2815675.2815681","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-13","unstructured":"Le Chen, Alan Mislove, and Christo Wilson. 2016. An Empirical Analysis of Algorithmic Pricing on Amazon Marketplace. In Proceedings of the 25th International World Wide Web Conference.","DOI":"10.1145\/2872427.2883089","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-14","unstructured":"Chitika. 2012. Ask.com Has The Most Long-Winded Searchers, Report Says. Technical Report. Chitika. http:\/\/searchengineland.com\/ ask-com-has-the-most-long-winded-searchers-report-says-109202"},{"key":"key-10.1145\/3178876.3186143-15","unstructured":"Inc comScore. 2017. comScore Explicit Core Search Query Report (Desktop Only). https:\/\/www.comscore.com\/Insights\/Rankings. (2017). Accessed: 2017-02--12."},{"key":"key-10.1145\/3178876.3186143-16","unstructured":"Nick Diakopoulos. 2013. Algorithmic defamation: The case of the shameless autocomplete. http:\/\/www.nickdiakopoulos.com\/2013\/08\/06\/ algorithmic-defamation-the-case-of-the-shameless-autocomplete\/. (2013)."},{"key":"key-10.1145\/3178876.3186143-17","unstructured":"Nick Diakopoulos. 2013. Sex, Violence, and Autocomplete Algorithms: Methods and Context. http:\/\/www.nickdiakopoulos.com\/2013\/08\/01\/ sex-violence-and-autocomplete-algorithms-methods-and-context\/. (2013)."},{"key":"key-10.1145\/3178876.3186143-18","unstructured":"Nicholas Diakopoulos. 2014. Algorithmic accountability reporting: On the investigation of black boxes. Tow Center for Digital Journalism, Columbia University (2014)."},{"key":"key-10.1145\/3178876.3186143-19","unstructured":"Dimitar Dimitrov, Philipp Singer, Florian Lemmerich, and Markus Strohmaier. 2016. Visual positions of links and clicks on wikipedia. In Proceedings of the 25th International Conference Companion on World Wide Web. International World Wide Web Conferences Steering Committee, 27--28.","DOI":"10.1145\/2872518.2889388","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-20","unstructured":"Hermann Ebbinghaus. 1913. Memory: A contribution to experimental psychology. Number 3. University Microfilms.","DOI":"10.1037\/10011-000","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-21","unstructured":"Robert Epstein and Ronald E Robertson. 2015. The search engine manipulation effect (SEME) and its possible impact on the outcomes of elections. Proceedings of the National Academy of Sciences 112, 33 (2015), E4512--E4521.","DOI":"10.1073\/pnas.1419828112","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-22","unstructured":"Robert Epstein, Ronald E. Robertson, David Lazer, and Christo Wilson. 2017. Suppressing the search engine manipulation effect (SEME). Proceedings of the ACM: Human-Computer Interaction 1, 42 (2017). Issue 2."},{"key":"key-10.1145\/3178876.3186143-23","unstructured":"Eyal Ert and Aliza Fleischer. 2016. Mere Position Effect in Booking Hotels Online. Journal of Travel Research 55, 3 (2016), 311--321.","DOI":"10.1177\/0047287514559035","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-24","unstructured":"Motahhare Eslami, Amirhossein Aleyasen, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. Feedvis: A path for exploring news feed curation algorithms. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work &#38; Social Computing.","DOI":"10.1145\/2685553.2702690","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-25","unstructured":"Gallup. 2017. Presidential Approval Ratings -- Donald Trump. http:\/\/news.gallup. com\/poll\/203198\/presidential-approval-ratings-donald-trump.aspx. (2017). Accessed: 2017--10-08."},{"key":"key-10.1145\/3178876.3186143-26","unstructured":"Florian Geigl, Kristina Lerman, Simon Walk, Markus Strohmaier, and Denis Helic. 2016. Assessing the Navigational Effects of Click Biases and Link Insertion on the Web. In Proceedings of the 27th ACM Conference on Hypertext and Social Media. ACM, 37--47.","DOI":"10.1145\/2914586.2914594","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-27","unstructured":"David F Gleich, Paul G Constantine, Abraham D Flaxman, and Asela Gunawardana. 2010. Tracking the random surfer: empirically measured teleportation parameters in PageRank. In Proceedings of the 19th International Conference on World Wide Web. ACM, 381--390."},{"key":"key-10.1145\/3178876.3186143-28","unstructured":"Google. 2017. Google Chrome Privacy Notice. https:\/\/www.google.com\/chrome\/ browser\/privacy\/#browser-modes. (2017). Accessed: 2017-04-01."},{"key":"key-10.1145\/3178876.3186143-29","unstructured":"Google. 2017. Search using autocomplete. https:\/\/support.google.com\/websearch\/ answer\/106230. (2017). Accessed: 2017-04-01."},{"key":"key-10.1145\/3178876.3186143-30","unstructured":"Andrew Guess, Brendan Nyhan, and Jason Reifler. 2018. Selective Exposure to Misinformation: Evidence from the consumption of fake news during the 2016 US presidential campaign. (2018)."},{"key":"key-10.1145\/3178876.3186143-31","unstructured":"Xunhua Guo, Mingyue Zhang, Chenyue Yang, et al. 2016. Order Effects in Online Product Recommendation: A Scenario-based Analysis. In Proceedings of the 22nd Americas Conference on Information Systems."},{"key":"key-10.1145\/3178876.3186143-32","unstructured":"Aniko Hannak, Piotr Sapiezynski, Arash Molavi Kakhki, Balachander Krishnamurthy, David Lazer, Alan Mislove, and Christo Wilson. 2013. Measuring Personalization of Web Search. In Proceedings of the 22nd International World Wide Web Conference.","DOI":"10.1145\/2488388.2488435","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-33","unstructured":"Aniko Hannak, Gary Soeller, David Lazer, Alan Mislove, and Christo Wilson. 2014. Measuring Price Discrimination and Steering on E-commerce Web Sites. In Proceedings of the 2014 ACM Conference on Internet Measurement.","DOI":"10.1145\/2663716.2663744","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-34","unstructured":"Robin M Hogarth and Hillel J Einhorn. 1992. Order effects in belief updating: The belief-adjustment model. Cognitive Psychology 24, 1 (1992), 1--55.","DOI":"10.1016\/0010-0285(92)90002-J","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-35","unstructured":"Adrianne Jeffries. 2017. Google's featured snippets are worse than fake news. https:\/\/theoutline.com\/post\/1192\/ google-s-featured-snippets-are-worse-than-fake-news. (2017). Accessed: 2017--10-08."},{"key":"key-10.1145\/3178876.3186143-36","unstructured":"Chloe Kliman-Silver, Aniko Hannak, David Lazer, Christo Wilson, and Alan Mislove. 2015. Location, Location, Location: The Impact of Geolocation on Web Search Personalization. In Proceedings of the 2015 ACM Conference on Internet Measurement.","DOI":"10.1145\/2815675.2815714","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-37","unstructured":"Certified Knowledge. 2012. Ask.com Has The Most Long-Winded Searchers, Report Says. Technical Report. Certified Knowledge. http:\/\/certifiedknowledge.org\/ blog\/are-search-queries-becoming-even-more-unique-statistics-from-google\/"},{"key":"key-10.1145\/3178876.3186143-38","unstructured":"Juhi Kulshrestha, Motahhare Eslami, Johnnatan Messias, Muhammad Bilal Zafar, Saptarshi Ghosh, Krishna P Gummadi, and Karrie Karahalios. 2017. Quantifying search bias: Investigating sources of bias for political searches in social media. In 20th ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW 2017)."},{"key":"key-10.1145\/3178876.3186143-39","unstructured":"David M. J. Lazer, Matthew A. Baum, Yochai Benkler, Adam J. Berinsky, Kelly M. Greenhill, Filippo Menczer, Miriam J. Metzger, Brendan Nyhan, Gordon Pennycook, David Rothschild, Michael Schudson, Steven A. Sloman, Cass R. Sunstein, Emily A. Thorson, Duncan J. Watts, and Jonathan L. Zittrain. 2018. The Science of Fake News. Science 359, 6380 (March 2018), 1094--1096. https: \/\/doi.org\/10.1126\/science.aao2998","DOI":"10.1126\/science.aao2998","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-40","unstructured":"Kristina Lerman and Tad Hogg. 2014. Leveraging position bias to improve peer recommendation. PloS one 9, 6 (2014), e98914."},{"key":"key-10.1145\/3178876.3186143-41","unstructured":"Xiaolu Lu, Alistair Moffat, and J Shane Culpepper. 2016. The effect of pooling and evaluation depth on IR metrics. Information Retrieval Journal 19, 4 (2016), 416--445.","DOI":"10.1007\/s10791-016-9282-6","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-42","unstructured":"Ramona Ludolph, Ahmed Allam, and Peter J Schulz. 2016. Manipulating Google's Knowledge Graph box to counter biased information processing during an online search on vaccination: application of a technological debiasing strategy. Journal of Medical Internet research 18, 6 (2016).","DOI":"10.2196\/jmir.5430","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-43","unstructured":"Connor McMahon, Isaac Johnson, and Brent Hecht. 2017. The Substantial Interdependence of Wikipedia and Google: A Case Study on the Relationship Between Peer Production Communities and Information Technologies. (2017)."},{"key":"key-10.1145\/3178876.3186143-44","unstructured":"Nicco Mele, David Lazer, Matthew Baum, Nir Grinberg, Lisa Friedland, Kenneth Joseph, Will Hobbs, and Carolina Mattsson. 2017. Combating fake news: An agenda for research and action. (2017)."},{"key":"key-10.1145\/3178876.3186143-45","unstructured":"P Takis Metaxas and Yada Pruksachatkun. 2017. Manipulation of Search Engine Results during the 2016 US Congressional Elections. In ICIW."},{"key":"key-10.1145\/3178876.3186143-46","unstructured":"Peter J. Meyers. 2013. 101 Google Answer Boxes: A Journey into the Knowledge Graph. https:\/\/moz.com\/blog\/ 101-google-answer-boxes-a-journey-into-the-knowledge-graph. (2013). Accessed: 2017--10-08."},{"key":"key-10.1145\/3178876.3186143-47","unstructured":"Jakub Mikians, L&#225;szl&#243; Gyarmati, Vijay Erramilli, and Nikolaos Laoutaris. 2012. Detecting price and search discrimination on the Internet. In Proceedings of the 11th ACM Workshop on Hot Topics in Networks.","DOI":"10.1145\/2390231.2390245","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-48","unstructured":"Jakub Mikians, L&#225;szl&#243; Gyarmati, Vijay Erramilli, and Nikolaos Laoutaris. 2013. Crowd-assisted search for price discrimination in e-commerce: First results. In Proceedings of the Ninth ACM Conference on Emerging Networking Experiments and Technologies.","DOI":"10.1145\/2535372.2535415","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-49","unstructured":"Ronald B Mincy. 1993. The Urban Institute audit studies: their research and policy context. Clear and Convincing Evidence: Measurement of Discrimination in America (1993), 165--86."},{"key":"key-10.1145\/3178876.3186143-50","unstructured":"Amy Mitchell, Jeffrey Gottfried, Elisa Shearer, and Kristine Lu. 2017. How Americans Encounter, Recall and Act Upon Digital News. Technical Report. Pew Research Center."},{"key":"key-10.1145\/3178876.3186143-51","unstructured":"Alistair Moffat and Justin Zobel. 2008. Rank-biased precision for measurement of retrieval effectiveness. ACM Transactions on Information Systems (TOIS) 27, 1 (2008), 2."},{"key":"key-10.1145\/3178876.3186143-52","unstructured":"Motherboard. 2017. Go Ahead, Ask Google ?What Happened to the Dinosaurs?. https:\/\/motherboard.vice.com\/en_us\/article\/pga4wg\/ go-ahead-ask-google-what-happened-to-the-dinosaurs. (2017). Accessed: 2017--10-08."},{"key":"key-10.1145\/3178876.3186143-53","unstructured":"Moz. 2012. Face-off - 4 Ways to De-personalize Google. https:\/\/moz.com\/blog\/ face-off-4-ways-to-de-personalize-google. (2012). Accessed: 2017--10-01."},{"key":"key-10.1145\/3178876.3186143-54","unstructured":"Sean A Munson, Stephanie Y Lee, and Paul Resnick. 2013. Encouraging Reading of Diverse Political Viewpoints with a Browser Widget.. In ICWSM."},{"key":"key-10.1145\/3178876.3186143-55","unstructured":"Bennet B Murdock. 1962. The serial position effect of free recall. Journal of Experimental Psychology 64, 5 (1962), 482--488."},{"key":"key-10.1145\/3178876.3186143-56","unstructured":"Jamie Murphy, Charles Hofacker, and Richard Mizerski. 2006. Primacy and recency effects on clicking behavior. Journal of Computer-Mediated Communication 11, 2 (2006), 522--535.","DOI":"10.1111\/j.1083-6101.2006.00025.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-57","unstructured":"Nic Newman, Richard Fletcher, Antonis Kalogeropoulos, David A. L. Levy, and Rasmus Kleis Nielsen. 2017. Reuters Institute Digital News Report 2017. Technical Report. Reuters Institute for the Study of Journalism."},{"key":"key-10.1145\/3178876.3186143-58","unstructured":"Helen Nissenbaum. 1996. Accountability in a computerized society. Science and Engineering Ethics 2, 1 (1996), 25--42.","DOI":"10.1007\/BF02639315","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-59","unstructured":"Alamir Novin and Eric Meyers. 2017. Making sense of conflicting science information: Exploring bias in the search engine result page. In Proceedings of the 2017 Conference on Human Information Interaction and Retrieval. ACM, 175--184.","DOI":"10.1145\/3020165.3020185","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-60","unstructured":"Bing Pan, Helene Hembrooke, Thorsten Joachims, Lori Lorigo, Geri Gay, and Laura Granka. 2007. In google we trust: Users' decisions on rank, position, and relevance. Journal of Computer-Mediated Communication 12, 3 (2007), 801--823.","DOI":"10.1111\/j.1083-6101.2007.00351.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-61","unstructured":"Eli Pariser. 2011. The filter bubble: What the Internet is hiding from you. Penguin UK."},{"key":"key-10.1145\/3178876.3186143-62","unstructured":"Parse.ly. 2017. The authority report: How audiences find articles, by topic. Technical Report. Parse.ly. http:\/\/learn.parsely.com\/rs\/314-EBB-255\/images\/ authority-report-13.pdf"},{"key":"key-10.1145\/3178876.3186143-63","unstructured":"Frank Pasquale. 2015. The black box society: The secret algorithms that control money and information. Harvard University Press, Cambridge, MA.","DOI":"10.4159\/harvard.9780674736061","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-64","unstructured":"Eyal Peer, Laura Brandimarte, Sonam Samat, and Alessandro Acquisti. 2017. Beyond the Turk: alternative platforms for crowdsourcing behavioral research. Journal of Experimental Social Psychology 70 (2017), 153--163.","DOI":"10.1016\/j.jesp.2017.01.006","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-65","unstructured":"Eyal Peer, Joachim Vosgerau, and Alessandro Acquisti. 2014. Reputation as a sufficient condition for data quality on Amazon Mechanical Turk. Behavior research methods 46, 4 (2014), 1023--1031.","DOI":"10.3758\/s13428-013-0434-y","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-66","unstructured":"Kristen Purcell, Joanna Brenner, and Lee Rainie. 2012. Search engine use 2012. Technical Report. Pew Research Center's Internet and American Life Project."},{"key":"key-10.1145\/3178876.3186143-67","unstructured":"Advanced Web Ranking. 2017. CTR Study February 2017. https:\/\/www. advancedwebranking.com\/cloud\/ctrstudy. (2017). Accessed: 2017-04-01."},{"key":"key-10.1145\/3178876.3186143-68","unstructured":"Christian Sandvig, Kevin Hamilton, Karrie Karahalios, and Cedric Langbort. 2014. Auditing algorithms: Research methods for detecting discrimination on internet platforms. In Proceedings of 'Data and Discrimination: Converting Critical Concerns into Productive Inquiry?, a Productivereconference at the 64th Annual Meeting of the International Communication Association."},{"key":"key-10.1145\/3178876.3186143-69","unstructured":"Gary Soeller, Karrie Karahalios, Christian Sandvig, and Christo Wilson. 2016. MapWatch: Detecting and Monitoring International Border Personalization on Online Maps. In Proceedings of the 25th International World Wide Web Conference.","DOI":"10.1145\/2872427.2883016","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-70","unstructured":"Lauren Starling. 2013. How to remove a word from Google autocomplete. (2013). http:\/\/www.laurenstarling.org\/ how-to-remove-a-word-from-google-autocomplete\/"},{"key":"key-10.1145\/3178876.3186143-71","unstructured":"Danny Sullivan. 2017. Google's 'One True Answer' problem when featured snippets go bad. https:\/\/searchengineland.com\/ googles-one-true-answer-problem-featured-snippets-270549. (2017). Accessed: 2017--10-08."},{"key":"key-10.1145\/3178876.3186143-72","unstructured":"Sander van der Linden, Anthony Leiserowitz, Seth Rosenthal, and Edward Maibach. 2017. Inoculating the public against misinformation about climate change. Global Challenges 1, 2 (2017).","DOI":"10.1002\/gch2.201600008","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186143-73","unstructured":"Soroush Vosoughi, Deb Roy, and Sinan Aral. 2018. The Spread of True and False News Online. Science 359, 6380 (March 2018), 1146--1151. https:\/\/doi.org\/10. 1126\/science.aap9559"},{"key":"key-10.1145\/3178876.3186143-74","unstructured":"William Webber, Alistair Moffat, and Justin Zobel. 2010. A similarity measure for indefinite rankings. ACM Transactions on Information Systems (TOIS) 28, 4 (2010), 20."},{"key":"key-10.1145\/3178876.3186143-75","unstructured":"Wiideman. 2010. Beat the autocomplete - A study of Google auto-suggest. (2010). https:\/\/www.wiideman.com\/research\/google-autocomplete\/study-results"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186143&ftid=1957449&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:15:45Z","timestamp":1523639745000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":75,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186143","relation":{"cites":[]}}}