{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:58:53Z","timestamp":1523998733196},"publisher-location":"New York, New York, USA","reference-count":39,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186093","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Incognito"],"prefix":"10.1145","author":[{"given":"Rahat","family":"Masood","sequence":"first","affiliation":[{"name":"Data61-CSIRO & UNSW, Sydney, Australia"}]},{"given":"Dinusha","family":"Vatsalan","sequence":"additional","affiliation":[{"name":"Data61-CSIRO, Sydney, Australia"}]},{"given":"Muhammad","family":"Ikram","sequence":"additional","affiliation":[{"name":"Data61-CSIRO & UNSW, Sydney, Australia"}]},{"given":"Mohamed Ali","family":"Kaafar","sequence":"additional","affiliation":[{"name":"Data61-CSIRO & Macquarie University & Optus Macquarie University Cyber Security Hub, Sydney, Australia"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186093-1","unstructured":"2018. gensim: Topic modelling for humans. https:\/\/radimrehurek.com\/gensim\/. (2018). Accessed on: 12-01--2018."},{"key":"key-10.1145\/3178876.3186093-2","unstructured":"2018. Natural Language Toolkit. http:\/\/www.nltk.org. (2018). Accessed on: 12-01--2018."},{"key":"key-10.1145\/3178876.3186093-3","unstructured":"Ero Balsa, Carmela Troncoso, and Claudia D&#237;az. 2012. OB-PWS: ObfuscationBased Private Web Search. In IEEE Symposium on Security and Privacy, SP 2012, 21--23 May 2012, San Francisco, California, USA. 491--505.","DOI":"10.1109\/SP.2012.36","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-4","unstructured":"Joanna Biega, Ida Mele, and Gerhard Weikum. 2014. Probabilistic Prediction of Privacy Risks in User Search Histories. In Proceedings of the First International Workshop on Privacy and Secuirty of Big Data, PSBD@CIKM 2014, Shanghai, China, November 7, 2014. 29--36.","DOI":"10.1145\/2663715.2669609","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-5","unstructured":"Joanna Asia Biega, Krishna P. Gummadi, Ida Mele, Dragan Milchevski, Christos Tryfonopoulos, and Gerhard Weikum. 2016. R-Susceptibility: An IR-Centric Approach to Assessing Privacy Risks for Users in Online Communities. In Proceedings of the 39th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '16). ACM, New York, NY, USA, 365--374.","DOI":"10.1145\/2911451.2911533","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-6","unstructured":"Prima Chairunnanda, Nam Pham, and Urs Hengartner. 2011. Privacy: Gone with the Typing! Identifying Web Users by Their Typing Patterns. In PASSAT\/SocialCom 2011, Privacy, Security, Risk and Trust (PASSAT), 2011 IEEE Third International Conference on and 2011 IEEE Third International Conference on Social Computing (SocialCom), Boston, MA, USA, 9--11 Oct., 2011. 974--980."},{"key":"key-10.1145\/3178876.3186093-7","unstructured":"Terence Chen, Roksana Boreli, Mohamed Ali K&#226;afar, and Arik Friedman. 2014. On the Efectiveness of Obfuscation Techniques in Online Social Networks. In Privacy Enhancing Technologies - 14th International Symposium, PETS 2014, Amsterdam, The Netherlands, July 16--18, 2014. Proceedings. 42-62."},{"key":"key-10.1145\/3178876.3186093-8","unstructured":"Richard Chow and Philippe Golle. 2009. Faking contextual data for fun, proit, and privacy. (2009), 105--108."},{"key":"key-10.1145\/3178876.3186093-9","unstructured":"Anupam Das, Nikita Borisov, and Matthew Caesar. 2014. Do You Hear What I Hear?: Fingerprinting Smart Devices Through Embedded Acoustic Components. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (CCS), Scottsdale, AZ, USA, November 3--7, 2014. 441--452.","DOI":"10.1145\/2660267.2660325","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-10","unstructured":"Anupam Das, Nikita Borisov, and Matthew Caesar. 2016. Tracking Mobile Web Users Through Motion Sensors: Attacks and Defenses. In 23rd Annual Network and Distributed System Security Symposium (NDSS), San Diego, California, USA, February 21--24, 2016. The Internet Society."},{"key":"key-10.1145\/3178876.3186093-11","unstructured":"Sanorita Dey, Nirupam Roy, Wenyuan Xu, Romit Roy Choudhury, and Srihari Nelakuditi. 2014. AccelPrint: Imperfections of Accelerometers Make Smartphones Trackable. In 21st Annual Network and Distributed System Security Symposium (NDSS), San Diego, California, USA, February 23--26, 2014. The Internet Society."},{"key":"key-10.1145\/3178876.3186093-12","unstructured":"Josep Domingo-Ferrer, Agusti Solanas, and Jordi Castell&#224;-Roca. 2009. h (k)-Private information retrieval from privacy-uncooperative queryable databases. Online Information Review 33, 4 (2009), 720--744.","DOI":"10.1108\/14684520910985693","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-13","unstructured":"Peter Eckersley. 2010. How Unique Is Your Web Browser?. In Privacy Enhancing Technologies, 10th International Symposium, PETS 2010, Berlin, Germany, July 21--23, 2010. Proceedings. 1--18."},{"key":"key-10.1145\/3178876.3186093-14","unstructured":"Arthur Gervais, Reza Shokri, Adish Singla, Srdjan Capkun, and Vincent Lenders. 2014. Quantifying Web-Search Privacy. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (CCS '14). ACM, New York, NY, USA, 966--977.","DOI":"10.1145\/2660267.2660367","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-15","unstructured":"Jiawei Han, Micheline Kamber, and Jian Pei. 2011. Data Mining: Concepts and Techniques, 3rd edition. Morgan Kaufmann."},{"key":"key-10.1145\/3178876.3186093-16","unstructured":"Saul Hansell. 2006. AOL Removes Search Data on Vast Group of Web Users. http:\/\/query.nytimes.com\/gst\/fullpage.html?res=9504e5d81e3f93ba3575bc 0a9609c8b63. New York Times (2006)."},{"key":"key-10.1145\/3178876.3186093-17","unstructured":"Bunke Horst and Caelli Terry Michael. 2001. Hidden Markov models: Applications In Computer Vision. Vol. 45. World Scientiic."},{"key":"key-10.1145\/3178876.3186093-18","unstructured":"Daniel C Howe and Helen Nissenbaum. 2009. TrackMeNot: Resisting surveillance in web search. Lessons from the Identity Trail: Anonymity, Privacy, and Identity in a Networked Society 23 (2009), 417--436."},{"key":"key-10.1145\/3178876.3186093-19","unstructured":"Ling Huang, Anthony D. Joseph, Blaine Nelson, Benjamin I. P. Rubinstein, and J. D. Tygar. 2011. Adversarial machine learning. In Proceedings of the 4th ACM Workshop on Security and Artiicial Intelligence, AISec 2011, Chicago, IL, USA, October 21, 2011. 43--58.","DOI":"10.1145\/2046684.2046692","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-20","unstructured":"Muhammad Ikram and Mohamed Ali K&#226;afar. 2017. A irst look at mobile AdBlocking apps. In 16th IEEE International Symposium on Network Computing and Applications, NCA 2017, Cambridge, MA, USA, October 30 - November 1, 2017. 343--350.","DOI":"10.1109\/NCA.2017.8171376","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-21","unstructured":"Andreas Kurtz, Hugo Gascon, Tobias Becker, Konrad Rieck, and Felix C. Freiling. 2016. Fingerprinting Mobile Devices Using Personalized Conigurations. PoPETs 2016, 1 (2016), 4--19."},{"key":"key-10.1145\/3178876.3186093-22","unstructured":"Pierre Laperdrix, Walter Rudametkin, and Benoit Baudry. 2016. Beauty and the Beast: Diverting Modern Web Browsers to Build Unique Browser Fingerprints. Proceedings - IEEE Symposium on Security and Privacy, SP 2016 (2016), 878--894."},{"key":"key-10.1145\/3178876.3186093-23","unstructured":"Chen Li, Houtan Shirani-Mehr, and Xiaochun Yang. 2007. Protecting Individual Information Against Inference Attacks in Data Publishing. In Proceedings of the 12th International Conference on Database Systems for Advanced Applications (DASFAA'07). Springer-Verlag, Berlin, Heidelberg, 422-433.","DOI":"10.1007\/978-3-540-71703-4_37","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-24","unstructured":"Yuhua Li, David McLean, Zuhair A Bandar, James D O'shea, and Keeley Crockett. 2006. Sentence similarity based on semantic nets and corpus statistics. IEEE transactions on knowledge and data engineering 18, 8 (2006), 1138--1150.","DOI":"10.1109\/TKDE.2006.130","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-25","unstructured":"Yuhua Li, David McLean, Zuhair A. Bandar, James D. O'Shea, and Keeley Crockett. 2006. Sentence Similarity Based on Semantic Nets and Corpus Statistics. IEEE Trans. on Knowl. and Data Eng. 18, 8 (Aug. 2006), 1138--1150.","DOI":"10.1109\/TKDE.2006.130","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-26","unstructured":"Kun Liu and Evimaria Terzi. 2010. A Framework for Computing the Privacy Scores of Users in Online Social Networks. ACM Trans. Knowl. Discov. Data 5, 1, Article 6 (Dec. 2010), 30 pages."},{"key":"key-10.1145\/3178876.3186093-27","unstructured":"Rahat Masood, Benjamin Zi Hao Zhao, Hassan Jameel Asghar, and Moahmed Ali K&#226;afar. 2017. POSTER: TouchTrack: How Unique are your Touch Gestures'. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security, CCS 2017, Dallas, TX, USA, October 30 - November 03, 2017. 2555--2557.","DOI":"10.1145\/3133956.3138850","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-28","unstructured":"Arvind Narayanan and Vitaly Shmatikov. 2008. Robust De-anonymization of Large Sparse Datasets. In Proceedings of the 2008 IEEE Symposium on Security and Privacy (SP '08). IEEE Computer Society, Washington, DC, USA, 111--125.","DOI":"10.1109\/SP.2008.33","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-29","unstructured":"&#321;ukasz Olejnik, Claude Castelluccia, and Artur Janc. 2012. Why Johnny Can't Browse in Peace: On the Uniqueness of Web Browsing History Patterns. 5th Workshop on Hot Topics in Privacy Enhancing Technologies (HotPETs 2012), 1--16."},{"key":"key-10.1145\/3178876.3186093-30","unstructured":"Sai Teja Peddinti and Nitesh Saxena. 2010. On the Privacy of Web Search Based on Query Obfuscation: A Case Study of TrackMeNot. In Proceedings of the 10th International Conference on Privacy Enhancing Technologies (PETS'10). SpringerVerlag, Berlin, Heidelberg, 19--37.","DOI":"10.1007\/978-3-642-14527-8_2","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-31","unstructured":"Salman Salamatian, Amy Zhang, Fl&#225;vio du Pin Calmon, Sandilya Bhamidipati, Nadia Fawaz, Branislav Kveton, Pedro Oliveira, and Nina Taft. 2013. How to Hide the Elephant- or the Donkey- in the Room: Practical Privacy Against Statistical Inference for Large Data. In IEEE Global Conference on Signal and Information Processing, GlobalSIP 2013, Austin, TX, USA, December 3--5, 2013. 269--272."},{"key":"key-10.1145\/3178876.3186093-32","unstructured":"Bracha Shapira, Yuval Elovici, Adlay Meshiach, and Tsvi Kulik. 2005. PRAW - A PRivAcy Model for the Web. Journal of the American Society for Information Science and Technology (JASIST) 56, 2 (2005), 159--172.","DOI":"10.1002\/asi.20107","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-33","unstructured":"Jessica Su, Ansh Shukla, Sharad Goel, and Arvind Narayanan. 2017. Deanonymizing Web Browsing Data with Social Networks. In Proceedings of the 26th International Conference on World Wide Web, (WWW) 2017, Perth, Australia, April 3--7, 2017. 1261--1269."},{"key":"key-10.1145\/3178876.3186093-34","unstructured":"Latanya Sweeney. 1997. Weaving technology and policy together to maintain conidentiality. The Journal of Law, Medicine &#38; Ethics 25, 2--3 (1997), 98--110."},{"key":"key-10.1145\/3178876.3186093-35","unstructured":"Latanya Sweeney. 2000. Simple Demographics Often Identify People Uniquely. Carnegie Mellon University, Data Privacy Working Paper 3. Pittsburgh 2000 (2000), 1--34. http:\/\/dataprivacylab.org\/projects\/identiiability\/paper1.pdf"},{"key":"key-10.1145\/3178876.3186093-36","unstructured":"Robert Tibshirani, Guenther Walther, and Trevor Hastie. 2001. Estimating the number of clusters in a data set via the gap statistic. Journal of the Royal Statistical Society: Series B (Statistical Methodology) 63, 2 (2001), 411--423.","DOI":"10.1111\/1467-9868.00293","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-37","unstructured":"Udi Weinsberg, Smriti Bhagat, Stratis Ioannidis, and Nina Taft. 2012. BlurMe: Inferring and Obfuscating User Gender Based on Ratings. In Proceedings of the Sixth ACM Conference on Recommender Systems (RecSys '12). ACM, New York, NY, USA, 195--202.","DOI":"10.1145\/2365952.2365989","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186093-38","unstructured":"Ting-Fang Yen, Yinglian Xie, Fang Yu, Roger Peng Yu, and Mart&#237;n Abadi. 2012. Host Fingerprinting and Tracking on the Web: Privacy and Security Implications. In 19th Annual Network and Distributed System Security Symposium (NDSS), San Diego, California, USA, February 5--8, 2012. The Internet Society."},{"key":"key-10.1145\/3178876.3186093-39","unstructured":"Zhe Zhou, Wenrui Diao, Xiangyu Liu, and Kehuan Zhang. 2014. Acoustic Fingerprinting Revisited: Generate Stable Device ID Stealthily with Inaudible Sound. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (CCS '14). ACM, New York, NY, USA, 429--440.","DOI":"10.1145\/2660267.2660300","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186093&ftid=1957534&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:14:02Z","timestamp":1523636042000},"score":1.0,"subtitle":["A Method for Obfuscating Web Data"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":39,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186093","relation":{"cites":[]}}}