{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:58:43Z","timestamp":1523998723145},"publisher-location":"New York, New York, USA","reference-count":62,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186034","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Web-Based VR Experiments Powered by the Crowd"],"prefix":"10.1145","author":[{"given":"Xiao","family":"Ma","sequence":"first","affiliation":[{"name":"Cornell Tech & Cornell University, New York, NY, USA"}]},{"given":"Megan","family":"Cackett","sequence":"additional","affiliation":[{"name":"Cornell University, Ithaca, NY, USA"}]},{"given":"Leslie","family":"Park","sequence":"additional","affiliation":[{"name":"Cornell University, Ithaca, NY, USA"}]},{"given":"Eric","family":"Chien","sequence":"additional","affiliation":[{"name":"Cornell Tech & Cornell University, New York, NY, USA"}]},{"given":"Mor","family":"Naaman","sequence":"additional","affiliation":[{"name":"Cornell Tech & Cornell University, New York, NY, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186034-1","unstructured":"Sun Joo-Grace Ahn, Amanda Minh Tran Le, and Jeremy Bailenson. 2013. The Effect of Embodied Experiences on Self-Other Merging, Attitude, and Helping Behavior. 16 (01 2013), 7--38."},{"key":"key-10.1145\/3178876.3186034-2","unstructured":"Ilias Bergstr&#246;m, Konstantina Kilteni, and Mel Slater. 2016. First-Person Perspective Virtual Body Posture Influences Stress: A Virtual Reality Body Ownership Study. PLOS ONE 11, 2 (02 2016), 1--21. https:\/\/doi.org\/10.1371\/journal.pone. 0148060"},{"key":"key-10.1145\/3178876.3186034-3","unstructured":"Michael S. Bernstein, Joel Brandt, Robert C. Miller, and David R. Karger. 2011. Crowds in Two Seconds: Enabling Realtime Crowd-powered Interfaces. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 33--42.","DOI":"10.1145\/2047196.2047201","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-4","unstructured":"Jim Blascovich, Jack Loomis, Andrew C Beall, Kimberly R Swinth, Crystal L Hoyt, and Jeremy N Bailenson. 2002. Immersive virtual environment technology as a methodological tool for social psychology. Psychological Inquiry 13, 2 (2002), 103--124.","DOI":"10.1207\/S15327965PLI1302_01","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-5","unstructured":"Lydia B Chilton, Greg Little, Darren Edge, Daniel S Weld, and James A Landay. 2013. Cascade: Crowdsourcing taxonomy creation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1999--2008."},{"key":"key-10.1145\/3178876.3186034-6","unstructured":"Burak &#199;iflikli, Veysi I&#351;ler, and U&#287;ur G&#252;d&#252;kbay. 2010. Increasing the sense of presence in a simulation environment using image generators based on visual attention. Presence: Teleoperators and Virtual Environments 19, 6 (2010), 557--568.","DOI":"10.1162\/pres_a_00020","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-7","unstructured":"Peng Dai, Christopher H. Lin, Mausam, and Daniel S. Weld. 2013. POMDP-based control of workflows for crowdsourcing. Artificial Intelligence 202, Supplement C (2013), 52 -- 85."},{"key":"key-10.1145\/3178876.3186034-8","unstructured":"Jan Dul, Canan Ceylan, and Ferdinand Jaspers. 2011. Knowledge workers? creativity and the role of the physical work environment. Human resource management 50, 6 (2011), 715--734.","DOI":"10.1002\/hrm.20454","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-9","unstructured":"PMG Emmelkamp, M Krijn, AM Hulsbosch, S De Vries, MJ Schuemie, and CAPG Van der Mast. 2002. Virtual reality treatment versus exposure in vivo: a comparative evaluation in acrophobia. Behaviour research and therapy 40, 5 (2002), 509--516.","DOI":"10.1016\/S0005-7967(01)00023-7","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-10","unstructured":"Kimmo Eriksson and Brent Simpson. 2010. Emotional reactions to losing explain gender differences in entering a risky lottery. Judgment and Decision Making 5, 3 (2010), 159."},{"key":"key-10.1145\/3178876.3186034-11","unstructured":"Jesse Fox, Jeremy N. Bailenson, and Liz Tricase. 2013. The Embodiment of Sexualized Virtual Selves: The Proteus Effect and Experiences of Self-objectification via Avatars. Computers in Human Behavior 29, 3 (2013), 930--938.","DOI":"10.1016\/j.chb.2012.12.027","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-12","unstructured":"Hunter Gehlbach, Geoff Marietta, Aaron M King, Cody Karutz, Jeremy N Bailenson, and Chris Dede. 2015. Many ways to walk a mile in another's moccasins: Type of social perspective taking and its effect on negotiation outcomes. Computers in Human Behavior 52 (2015), 523--532.","DOI":"10.1016\/j.chb.2014.12.035","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-13","unstructured":"Mar Gonzalez-Franco and Jaron Lanier. 2017. Model of Illusions and Virtual Reality. Frontiers in psychology 8 (2017)."},{"key":"key-10.1145\/3178876.3186034-14","unstructured":"Mitchell Gordon, Jeffrey P. Bigham, and Walter S. Lasecki. 2015. LegionTools: A Toolkit + UI for Recruiting and Routing Crowds to Synchronous Real-Time Tasks. In Adjunct Proceedings of the 28th Annual ACM Symposium on User Interface Software &#38; Technology (UIST '15 Adjunct). ACM, New York, NY, USA, 81--82.","DOI":"10.1145\/2815585.2815729","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-15","unstructured":"Terry Hartig, Marlis Mang, and Gary W Evans. 1991. Restorative effects of natural environment experiences. Environment and behavior 23, 1 (1991), 3--26.","DOI":"10.1177\/0013916591231001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-16","unstructured":"Philipp Hock, Sebastian Benedikter, Jan Gugenheimer, and Enrico Rukzio. 2017. CarVR: Enabling In-Car Virtual Reality Entertainment. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4034--4044.","DOI":"10.1145\/3025453.3025665","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-17","unstructured":"John J Horton, David G Rand, and Richard J Zeckhauser. 2011. The online laboratory: Conducting experiments in a real labor market. Experimental Economics 14, 3 (2011), 399--425."},{"key":"key-10.1145\/3178876.3186034-18","unstructured":"Connor Huff and Dustin Tingley. 2015. \"Who are these people?\" Evaluating the demographic characteristics and political preferences of MTurk survey respondents. Research &#38; Politics 2, 3 (2015).","DOI":"10.1177\/2053168015604648","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-19","unstructured":"Panagiotis G Ipeirotis. 2010. Demographics of mechanical turk. NYU Working Paper No. CEDER-10-01 (2010)."},{"key":"key-10.1145\/3178876.3186034-20","unstructured":"Matt Kamen. 2017. Samsung Gear VR shipped more devices than Oculus, HTC Vive, and PSVR combined. (Feb 2017). http:\/\/www.wired.co.uk\/article\/ samsung-vr-outships-psvr-htc-vive-and-oculus Accessed on Oct 2017."},{"key":"key-10.1145\/3178876.3186034-21","unstructured":"Dmitri Karmanov and Ronald Hamel. 2008. Assessing the restorative potential of contemporary urban environment (s): Beyond the nature versus urban dichotomy. Landscape and Urban Planning 86, 2 (2008), 115--125.","DOI":"10.1016\/j.landurbplan.2008.01.004","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-22","unstructured":"Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203--220."},{"key":"key-10.1145\/3178876.3186034-23","unstructured":"Joy Kim, Sarah Sterman, Allegra Argent Beal Cohen, and Michael S. Bernstein. 2017. Mechanical Novel: Crowdsourcing Complex Work Through Reflection and Revision. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 233--245. https:\/\/doi.org\/10.1145\/2998181.2998196","DOI":"10.1145\/2998181.2998196","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-24","unstructured":"Robert Kraut, Judith Olson, Mahzarin Banaji, Amy Bruckman, Jeffrey Cohen, and Mick Couper. 2004. Psychological research online: report of Board of Scientific Affairs' Advisory Group on the Conduct of Research on the Internet. American psychologist 59, 2 (2004), 105."},{"key":"key-10.1145\/3178876.3186034-25","unstructured":"Walter S. Lasecki, Kyle I. Murray, Samuel White, Robert C. Miller, and Jeffrey P. Bigham. 2011. Real-time Crowd Control of Existing Interfaces. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 23--32.","DOI":"10.1145\/2047196.2047200","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-26","unstructured":"Myungho Lee, Kangsoo Kim, Salam Daher, Andrew Raij, Ryan Schubert, Jeremy Bailenson, and Greg Welch. 2016. The wobbly table: Increased social presence via subtle incidental movement of a real-virtual table. In Virtual Reality (VR), 2016 IEEE. IEEE, 11--17."},{"key":"key-10.1145\/3178876.3186034-27","unstructured":"Greg Little, Lydia B Chilton, Max Goldman, and Robert C Miller. 2010. Turkit: human computation algorithms on mechanical turk. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 57--66.","DOI":"10.1145\/1866029.1866040","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-28","unstructured":"Christopher V Maani, Hunter G Hoffman, Michelle Morrow, Alan Maiers, Kathryn Gaylord, Laura L McGhee, and Peter A DeSocio. 2011. Virtual reality pain control during burn wound debridement of combat-related burn injuries using robot-like arm mounted VR goggles. The Journal of trauma 71, 1 0 (2011), S125."},{"key":"key-10.1145\/3178876.3186034-29","unstructured":"Andrew Mao, Yiling Chen, Krzysztof Z Gajos, David Parkes, Ariel D Procaccia, and Haoqi Zhang. 2012. Turkserver: Enabling synchronous and longitudinal online experiments. Proceedings of HCOMP 12 (2012)."},{"key":"key-10.1145\/3178876.3186034-30","unstructured":"Andrew Mao, Lili Dworkin, Siddharth Suri, and Duncan J Watts. 2017. Resilient cooperators stabilize long-run cooperation in the finitely repeated Prisoner Dilemma. Nature communications 8 (2017)."},{"key":"key-10.1145\/3178876.3186034-31","unstructured":"Andrew Mao, Winter Mason, Siddharth Suri, and Duncan J Watts. 2016. An experimental study of team size and performance on a complex task. PloS one 11, 4 (2016).","DOI":"10.1371\/journal.pone.0153048","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-32","unstructured":"Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior research methods 44, 1 (2012), 1--23.","DOI":"10.3758\/s13428-011-0124-6","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-33","unstructured":"Stanley Milgram, Leonard Bickman, and Lawrence Berkowitz. 1969. Note on the drawing power of crowds of different size. Journal of personality and social psychology 13, 2 (1969), 79."},{"key":"key-10.1145\/3178876.3186034-34","unstructured":"Martin A Nowak, Karen M Page, and Karl Sigmund. 2000. Fairness versus reason in the ultimatum game. Science 289, 5485 (2000), 1773--1775."},{"key":"key-10.1145\/3178876.3186034-35","unstructured":"Soo Youn Oh, Jeremy Bailenson, Nicole Kr&#228;mer, and Benjamin Li. 2016. Let the Avatar Brighten Your Smile: Effects of Enhancing Facial Expressions in Virtual Environments. PloS one 11, 9 (2016).","DOI":"10.1371\/journal.pone.0161794","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-36","unstructured":"Soo Youn Oh, Ketaki Shriram, Bireswar Laha, Shawnee Baughman, Elise Ogle, and Jeremy Bailenson. 2016. Immersion at scale: Researcher's guide to ecologically valid mobile experiments. In Virtual Reality (VR), 2016 IEEE. IEEE, 249--250."},{"key":"key-10.1145\/3178876.3186034-37","unstructured":"Jan Packer and Nigel Bond. 2010. Museums as restorative environments. Curator: The Museum Journal 53, 4 (2010), 421--436.","DOI":"10.1111\/j.2151-6952.2010.00044.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-38","unstructured":"Gabriele Paolacci, Jesse Chandler, and Panagiotis G Ipeirotis. 2010. Running experiments on amazon mechanical turk (June 24, 2010). Judgment and Decision Making, Vol. 5, No. 5, 411--419. (2010). https:\/\/ssrn.com\/abstract=1626226"},{"key":"key-10.1145\/3178876.3186034-39","unstructured":"Reza Rawassizadeh, Soheil Khosravipour, and A Min Tjoa. 2011. A persuasive approach for indoor environment tidiness. Sixth International Conference on Persuasive Technology (2011)."},{"key":"key-10.1145\/3178876.3186034-40","unstructured":"Katharina Reinecke and Krzysztof Z. Gajos. 2015. LabintheWild: Conducting Large-Scale Online Experiments With Uncompensated Samples. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work &#38; Social Computing (CSCW '15). ACM, New York, NY, USA, 1364--1378. https:\/\/doi.org\/ 10.1145\/2675133.2675246","DOI":"10.1145\/2675133.2675246","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-41","unstructured":"Daniela Retelny, S&#233;bastien Robaszkiewicz, Alexandra To, Walter S Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S Bernstein. 2014. Expert crowdsourcing with flash teams. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 75--85.","DOI":"10.1145\/2642918.2647409","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-42","unstructured":"Adi Robertson. 2017. Google has shipped over 10 million Cardboard VR headsets. (Feb 2017). https:\/\/www.theverge.com\/2017\/2\/28\/14767902\/ google-cardboard-10-million-shipped-vr-ar-apps Accessed on Oct 2017."},{"key":"key-10.1145\/3178876.3186034-43","unstructured":"Robin S. Rosenberg, Shawnee L. Baughman, and Jeremy N. Bailenson. 2013. Virtual Superheroes: Using Superpowers in Virtual Reality to Encourage Prosocial Behavior. PloS one 8 (01 2013)."},{"key":"key-10.1145\/3178876.3186034-44","unstructured":"Matthew J Salganik. 2017. Bit by Bit: Social Research in the Digital Age. Princeton University Press."},{"key":"key-10.1145\/3178876.3186034-45","unstructured":"Ralph Schroeder. 1996. Possible worlds : the social dynamic of virtual reality technology. Westview Press."},{"key":"key-10.1145\/3178876.3186034-46","unstructured":"Valentin Schwind, Pascal Knierim, Cagri Tasci, Patrick Franczak, Nico Haas, and Niels Henze. 2017. \"These Are Not My Hands!\": Effect of Gender on the Perception of Avatar Hands in Virtual Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1577--1582. https:\/\/doi.org\/10.1145\/3025453.3025602","DOI":"10.1145\/3025453.3025602","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-47","unstructured":"Victor S. Sheng, Foster Provost, and Panagiotis G. Ipeirotis. 2008. Get Another Label? Improving Data Quality and Data Mining Using Multiple, Noisy Labelers. In Proceedings of the 14th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '08). ACM, New York, NY, USA, 614--622.","DOI":"10.1145\/1401890.1401965","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-48","unstructured":"Ketaki Shriram and Raz Schwartz. 2017. All are welcome: Using VR ethnography to explore harassment behavior in immersive social virtual reality. In Virtual Reality (VR), 2017 IEEE. IEEE, 225--226."},{"key":"key-10.1145\/3178876.3186034-49","unstructured":"Sarah Sitton. 1984. The messy desk effect: How tidiness affects the perception of others. The Journal of psychology 117, 2 (1984), 263--267.","DOI":"10.1080\/00223980.1984.9923688","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-50","unstructured":"Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions of the Royal Society of London B: Biological Sciences 364, 1535 (2009), 3549--3557.","DOI":"10.1098\/rstb.2009.0138","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-51","unstructured":"Siddharth Suri and Duncan J Watts. 2011. Cooperation and contagion in webbased, networked public goods experiments. PloS one 6, 3 (2011), e16836."},{"key":"key-10.1145\/3178876.3186034-52","unstructured":"Roger S Ulrich. 1981. Natural versus urban scenes: Some psychophysiological effects. Environment and behavior 13, 5 (1981), 523--556.","DOI":"10.1177\/0013916581135001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-53","unstructured":"Roger S Ulrich, Robert F Simons, Barbara D Losito, Evelyn Fiorito, Mark A Miles, and Michael Zelson. 1991. Stress recovery during exposure to natural and urban environments. Journal of environmental psychology 11, 3 (1991), 201--230."},{"key":"key-10.1145\/3178876.3186034-54","unstructured":"Deltcho Valtchanov, Kevin R Barton, and Colin Ellard. 2010. Restorative effects of virtual nature settings. Cyberpsychology, Behavior, and Social Networking 13, 5 (2010), 503--512.","DOI":"10.1089\/cyber.2009.0308","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-55","unstructured":"Brandon Van Der Heide, Erin M Schumaker, Ashley M Peterson, and Elizabeth B Jones. 2013. The Proteus effect in dyadic communication: Examining the effect of avatar appearance in computer-mediated dyadic interaction. Communication Research 40, 6 (2013), 838--860.","DOI":"10.1177\/0093650212438097","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-56","unstructured":"Kathleen D Vohs, Joseph P Redden, and Ryan Rahinel. 2013. Physical order produces healthy choices, generosity, and conventionality, whereas disorder produces creativity. Psychological Science 24, 9 (2013), 1860--1867."},{"key":"key-10.1145\/3178876.3186034-57","unstructured":"Bob G Witmer and Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence: Teleoperators and virtual environments 7, 3 (1998), 225--240.","DOI":"10.1162\/105474698565686","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-58","unstructured":"Andrea Stevenson Won, Jeremy Bailenson, Jimmy Lee, and Jaron Lanier. 2015. Homuncular flexibility in virtual reality. Journal of Computer-Mediated Communication 20, 3 (2015), 241--259.","DOI":"10.1111\/jcc4.12107","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-59","unstructured":"Nick Yee and Jeremy Bailenson. 2006. Walk a mile in digital shoes: The impact of embodied perspective-taking on the reduction of negative stereotyping in immersive virtual environments. Presence Teleoperators &#38; Virtual Environments (01 2006)."},{"key":"key-10.1145\/3178876.3186034-60","unstructured":"Nick Yee and Jeremy Bailenson. 2007. The Proteus effect: The effect of transformed self-representation on behavior. Human communication research 33, 3 (2007), 271--290.","DOI":"10.1111\/j.1468-2958.2007.00299.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-61","unstructured":"Nick Yee, Jeremy N Bailenson, and Nicolas Ducheneaut. 2009. The Proteus effect: Implications of transformed digital self-representation on online and offline behavior. Communication Research 36, 2 (2009), 285--312.","DOI":"10.1177\/0093650208330254","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186034-62","unstructured":"Marvin Zuckerman. 1977. Development of a situation-specific trait-state test for the prediction and measurement of affective responses. Journal of Consulting and clinical psychology 45, 4 (1977), 513."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186034&ftid=1957455&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:56:34Z","timestamp":1523634994000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":62,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186034","relation":{"cites":[]}}}