{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:25Z","timestamp":1525103725125},"publisher-location":"New York, New York, USA","reference-count":30,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"European Regional Development Fund (ERDF)","award":["POCI-01-0145-FEDER-006961","POCI-01-0247-FEDER-0024257"]},{"name":"Portuguese Foundation for Science and Technology (FCT)","award":["UID\/EEA\/50014\/2013"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191585","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Incremental Matrix Co-factorization for Recommender Systems with Implicit Feedback"],"prefix":"10.1145","author":[{"given":"Susan C.","family":"Anyosa","sequence":"first","affiliation":[{"name":"LIAAD - INESC TEC, Porto, Portugal"}]},{"given":"João","family":"Vinagre","sequence":"additional","affiliation":[{"name":"LIAAD - INESC TEC; FCUP, University of Porto, Porto, Portugal"}]},{"given":"Alípio M.","family":"Jorge","sequence":"additional","affiliation":[{"name":"LIAAD - INESC TEC; FCUP, University of Porto, Porto, Portugal"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191585-1","unstructured":"Robert M. Bell and Yehuda Koren. 2007. Scalable collaborative filtering with jointly derived neighborhood interpolation weights. In Data Mining, 2007. ICDM 2007. Seventh IEEE International Conference on. IEEE, 43--52.","DOI":"10.1109\/ICDM.2007.90","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-2","unstructured":"&#210;scar Celma. 2010. Music Recommendation and Discovery - The Long Tail, Long Fail, and Long Play in the Digital Music Space. Springer. I--XVI, 1--194 pages."},{"key":"key-10.1145\/3184558.3191585-3","unstructured":"Badrish Chandramouli, Justin J Levandoski, Ahmed Eldawy, and Mohamed F Mokbel. 2011. StreamRec: a real-time recommender system. In Proceedings of the 2011 ACM SIGMOD International Conference on Management of data. ACM, 1243--1246.","DOI":"10.1145\/1989323.1989465","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-4","unstructured":"Tianqi Chen, Zhao Zheng, Qiuxia Lu, Weinan Zhang, and Yong Yu. 2011. Feature-based matrix factorization. Technical Report. Apex Data &#38; Knowledge Managment Lab, Shanghai Jiao Tong University."},{"key":"key-10.1145\/3184558.3191585-5","unstructured":"Marcos Aur&#233;lio Domingues, Al'&#305;pio M&#225;rio Jorge, and Carlos Soares. 2013. Dimensions as virtual items: Improving the predictive ability of top-n recommender systems. Information Processing &#38; Management Vol. 49, 3 (2013), 698--720.","DOI":"10.1016\/j.ipm.2012.07.009","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-6","unstructured":"Yi Fang and Luo Si. 2011. Matrix Co-factorization for Recommendation with Rich Side Information and Implicit Feedback. In Proceedings of the 2nd International Workshop on Information Heterogeneity and Fusion in Recommender Systems (HetRec '11). ACM, New York, NY, USA, 65--69.","DOI":"10.1145\/2039320.2039330","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-7","unstructured":"Jo ao Gama, Raquel Sebasti ao, and Pedro Pereira Rodrigues. 2009. Issues in evaluation of stream learning algorithms Proceedings of the 15th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 329--338."},{"key":"key-10.1145\/3184558.3191585-8","unstructured":"Rainer Gemulla, Erik Nijkamp, Peter J Haas, and Yannis Sismanis. 2011. Large-scale matrix factorization with distributed stochastic gradient descent Proceedings of the 17th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 69--77."},{"key":"key-10.1145\/3184558.3191585-9","unstructured":"Bal&#225;zs Hidasi and Domonkos Tikk. 2012. Fast ALS-based tensor factorization for context-aware recommendation from implicit feedback. Machine Learning and Knowledge Discovery in Databases (2012), 67--82."},{"key":"key-10.1145\/3184558.3191585-10","unstructured":"Liangjie Hong, Aziz S Doumith, and Brian D Davison. 2013. Co-factorization machines: modeling user interests and predicting individual decisions in twitter. In Proceedings of the sixth ACM international conference on Web search and data mining. ACM, 557--566."},{"key":"key-10.1145\/3184558.3191585-11","unstructured":"Yifan Hu, Yehuda Koren, and Chris Volinsky. 2008. Collaborative filtering for implicit feedback datasets Data Mining, 2008. ICDM'08. Eighth IEEE International Conference on. Ieee, 263--272."},{"key":"key-10.1145\/3184558.3191585-12","unstructured":"Yanxiang Huang, Bin Cui, Wenyu Zhang, Jie Jiang, and Ying Xu. 2015. Tencentrec: Real-time stream recommendation in practice Proceedings of the 2015 ACM SIGMOD International Conference on Management of Data. ACM, 227--238.","DOI":"10.1145\/2723372.2742785","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-13","unstructured":"Alexandros Karatzoglou, Xavier Amatriain, Linas Baltrunas, and Nuria Oliver. 2010. Multiverse recommendation: n-dimensional tensor factorization for context-aware collaborative filtering. In Proceedings of the fourth ACM conference on Recommender systems. ACM, 79--86.","DOI":"10.1145\/1864708.1864727","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-14","unstructured":"Hiroyuki Kasai. 2016. Online low-rank tensor subspace tracking from incomplete data by CP decomposition using recursive least squares. In Acoustics, Speech and Signal Processing (ICASSP), 2016 IEEE International Conference on. IEEE, 2519--2523.","DOI":"10.1109\/ICASSP.2016.7472131","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-15","unstructured":"Yehuda Koren, Robert Bell, and Chris Volinsky. 2009. Matrix factorization techniques for recommender systems. Computer Vol. 42, 8 (2009).","DOI":"10.1109\/MC.2009.263","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-16","unstructured":"Fangfang Li, Guandong Xu, and Longbing Cao. 2014. Coupled item-based matrix factorization. In International Conference on Web Information Systems Engineering. Springer, 1--14.","DOI":"10.1007\/978-3-319-11749-2_1","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-17","unstructured":"R&#243;bert P&#225;lovics, Andr&#225;s A. Bencz&#250;r, Levente Kocsis, Tam&#225;s Kiss, and Erzs&#233;bet Frig&#243;. 2014. Exploiting temporal influence in online recommendation Eighth ACM Conference on Recommender Systems, RecSys '14, Foster City, Silicon Valley, CA, USA - October 06 - 10, 2014. 273--280. deftempurl%https:\/\/doi.org\/10.1145\/2645710.2645723showDOItempurl"},{"key":"key-10.1145\/3184558.3191585-18","unstructured":"Rong Pan, Yunhong Zhou, Bin Cao, Nathan N Liu, Rajan Lukose, Martin Scholz, and Qiang Yang. 2008. One-class collaborative filtering. In Data Mining, 2008. ICDM'08. Eighth IEEE International Conference on. IEEE, 502--511."},{"key":"key-10.1145\/3184558.3191585-19","unstructured":"Istv&#225;n Pil&#225;szy, D&#225;vid Zibriczky, and Domonkos Tikk. 2010. Fast als-based matrix factorization for explicit and implicit feedback datasets Proceedings of the fourth ACM conference on Recommender systems. ACM, 71--78."},{"key":"key-10.1145\/3184558.3191585-20","unstructured":"B. M. Sarwar, G. Karypis, J. Konstan, and J. Riedl. 2002. Incremental SVD-Based Algorithms for Highly Scalable Recommender Systems Fifth International Conference on Computer and Information Technology. 27--28."},{"key":"key-10.1145\/3184558.3191585-21","unstructured":"Ajit P. Singh and Geoffrey J. Gordon. 2008. Relational learning via collective matrix factorization Proceedings of the 14th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 650--658."},{"key":"key-10.1145\/3184558.3191585-22","unstructured":"Qingquan Song, Xiao Huang, Hancheng Ge, James Caverlee, and Xia Hu. 2017. Multi-aspect streaming tensor completion. In Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 435--443.","DOI":"10.1145\/3097983.3098007","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-23","unstructured":"G&#225;bor Tak&#225;cs, Istv&#225;n Pil&#225;szy, Botty&#225;n N&#233;meth, and Domonkos Tikk. 2009. Scalable collaborative filtering approaches for large recommender systems. Journal of machine learning research Vol. 10, Mar (2009), 623--656."},{"key":"key-10.1145\/3184558.3191585-24","unstructured":"Jo ao Vinagre, Al'&#305;pio M&#225;rio Jorge, and Jo ao Gama. 2014 a. Evaluation of recommender systems in streaming environments Proceedings of the Workshop on Recommender Systems Evaluation: Dimensions and Design in conjunction with the 8th ACM Conference on Recommender Systems (RecSys 2014), Foster City, CA, USA, October 10, 2014."},{"key":"key-10.1145\/3184558.3191585-25","unstructured":"Jo ao Vinagre, Al'&#305;pio M&#225;rio Jorge, and Jo ao Gama. 2014 b. Fast incremental matrix factorization for recommendation with positive-only feedback. In International Conference on User Modeling, Adaptation, and Personalization. Springer, 459--470."},{"key":"key-10.1145\/3184558.3191585-26","unstructured":"Jo ao Vinagre, Al'&#305;pio M&#225;rio Jorge, and Jo ao Gama. 2015. Collaborative Filtering with Recency-based Negative Feedback Proceedings of the 30th Annual ACM Symposium on Applied Computing (SAC '15). ACM, New York, NY, USA, 963--965."},{"key":"key-10.1145\/3184558.3191585-27","unstructured":"Hongzhi Yin, Bin Cui, Xiaofang Zhou, Weiqing Wang, Zi Huang, and Shazia Sadiq. 2016. Joint modeling of user check-in behaviors for real-time point-of-interest recommendation. ACM Transactions on Information Systems (TOIS) Vol. 35, 2 (2016), 11.","DOI":"10.1145\/2873055","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-28","unstructured":"Eva Zangerle, Martin Pichl, Wolfgang Gassler, and G&#252;nther Specht. 2014. # nowplaying music dataset: Extracting listening behavior from twitter Proceedings of the First International Workshop on Internet-Scale Multimedia Management. ACM, 21--26.","DOI":"10.1145\/2661714.2661719","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-29","unstructured":"Yu Zheng and Xing Xie. 2011. Learning travel recommendations from user-generated GPS traces. ACM Transactions on Intelligent Systems and Technology (TIST) Vol. 2, 1 (2011), 2.","DOI":"10.1145\/1889681.1889683","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191585-30","unstructured":"Shuo Zhou, Nguyen Xuan Vinh, James Bailey, Yunzhe Jia, and Ian Davidson. 2016. Accelerating online cp decompositions for higher order tensors Proceedings of the 22Nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 1375--1384."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191585&ftid=1958439&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T20:40:34Z","timestamp":1524084034000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":30,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191585","relation":{"cites":[]}}}