{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719241},"publisher-location":"New York, New York, USA","reference-count":33,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"VideoKen","award":[]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186336","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Automatic Hierarchical Table of Contents Generation for Educational Videos"],"prefix":"10.1145","author":[{"given":"Debabrata","family":"Mahapatra","sequence":"first","affiliation":[{"name":"Videoken, Bangalore, India"}]},{"given":"Ragunathan","family":"Mariappan","sequence":"additional","affiliation":[{"name":"National University of Singapore, Singapore, Singapore"}]},{"given":"Vaibhav","family":"Rajan","sequence":"additional","affiliation":[{"name":"National University of Singapore, Singapore, Singapore"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186336-1","unstructured":"John Adcock, Matthew Cooper, Laurent Denoue, Hamed Pirsiavash, and Lawrence A Rowe. 2010. Talkminer: a lecture webcast search engine. In Proceedings of the 18th ACM international conference on Multimedia. ACM, 241--250.","DOI":"10.1145\/1873951.1873986","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-2","unstructured":"Ghada Alharbi and Thomas Hain. 2015. Using Topic Segmentation Models for the Automatic Organisation of MOOCs resources. EDM. 524--527."},{"key":"key-10.1145\/3184558.3186336-3","unstructured":"Evlampios Apostolidis and Vasileios Mezaris. 2014. Fast shot segmentation combining global and local visual descriptors Acoustics, Speech and Signal Processing (ICASSP), 2014 IEEE International Conference on. IEEE, 6583--6587."},{"key":"key-10.1145\/3184558.3186336-4","unstructured":"Arijit Biswas, Ankit Gandhi, and Om Deshmukh. 2015. Mmtoc: A multimodal method for table of content creation in educational videos Proceedings of the 23rd ACM international conference on Multimedia. ACM, 621--630.","DOI":"10.1145\/2733373.2806253","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-5","unstructured":"Jaime Carbonell and Jade Goldstein. 1998. The use of MMR, diversity-based reranking for reordering documents and producing summaries. In Proceedings of the 21st annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 335--336.","DOI":"10.1145\/290941.291025","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-6","unstructured":"Dorin Comaniciu and Peter Meer. 2002. Mean shift: A robust approach toward feature space analysis. IEEE Transactions on pattern analysis and machine intelligence Vol. 24, 5 (2002), 603--619.","DOI":"10.1109\/34.1000236","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-7","unstructured":"Costas Cotsaces, Nikos Nikolaidis, and Ioannis Pitas. 2006. Video shot detection and condensed representation. a review. IEEE signal processing magazine Vol. 23, 2 (2006), 28--37.","DOI":"10.1109\/MSP.2006.1621446","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-8","unstructured":"L. Du, W. L. Buntine, and M. Johnson. 2013. Topic segmentation with a structured topic model. In HLT-NAACL. 190--200."},{"key":"key-10.1145\/3184558.3186336-9","unstructured":"Jacob Eisenstein and Regina Barzilay. 2008. Bayesian unsupervised topic segmentation. In Proceedings of the Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, 334--343.","DOI":"10.3115\/1613715.1613760","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-10","unstructured":"Boris Epshtein, Eyal Ofek, and Yonatan Wexler. 2010. Detecting text in natural scenes with stroke width transform Computer Vision and Pattern Recognition (CVPR), 2010 IEEE Conference on. IEEE, 2963--2970."},{"key":"key-10.1145\/3184558.3186336-11","unstructured":"Hiroya Fujisaki and Keikichi Hirose. 1984. Analysis of voice fundamental frequency contours for declarative sentences of Japanese. Journal of the Acoustical Society of Japan (E) Vol. 5, 4 (1984), 233--242.","DOI":"10.1250\/ast.5.233","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-12","unstructured":"Theodoros Giannakopoulos. 2015. pyAudioAnalysis: An Open-Source Python Library for Audio Signal Analysis. PloS one Vol. 10, 12 (2015).","DOI":"10.1371\/journal.pone.0144610","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-13","unstructured":"Alan Hanjalic. 2002. Shot-boundary detection: Unraveled and resolved IEEE transactions on circuits and systems for video technology Vol. 12, 2 (2002), 90--105.","DOI":"10.1109\/76.988656","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-14","unstructured":"Marti A Hearst. 1997. TextTiling: Segmenting text into multi-paragraph subtopic passages. Computational linguistics Vol. 23, 1 (1997), 33--64."},{"key":"key-10.1145\/3184558.3186336-15","unstructured":"Wei Jyh Heng and King N Ngan. 2001. An object-based shot boundary detection using edge tracing and tracking. Journal of Visual Communication and Image Representation Vol. 12, 3 (2001), 217--239.","DOI":"10.1006\/jvci.2001.0457","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-16","unstructured":"Tsutomu Hirao, Yasuhisa Yoshida, Masaaki Nishino, Norihito Yasuda, and Masaaki Nagata. 2013. Single-Document Summarization as a Tree Knapsack Problem. EMNLP, Vol. Vol. 13. 1515--1520."},{"key":"key-10.1145\/3184558.3186336-17","unstructured":"Jonathan Long, Evan Shelhamer, and Trevor Darrell. 2015. Fully Convolutional Networks for Semantic Segmentation The IEEE Conference on Computer Vision and Pattern Recognition (CVPR)."},{"key":"key-10.1145\/3184558.3186336-18","unstructured":"Igor Malioutov and Regina Barzilay. 2006. Minimum cut model for spoken lecture segmentation. In Proceedings of the 21st International Conference on Computational Linguistics and the 44th annual meeting of the Association for Computational Linguistics. Association for Computational Linguistics, 25--32.","DOI":"10.3115\/1220175.1220179","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-19","unstructured":"Mehryar Mohri, Pedro Moreno, and Eugene Weinstein. 2010. Discriminative topic segmentation of text and speech Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. 533--540."},{"key":"key-10.1145\/3184558.3186336-20","unstructured":"Masaaki Nishino, Norihito Yasuda, Tsutomu Hirao, Shin-ichi Minato, and Masaaki Nagata. 2015. A Dynamic Programming Algorithm for Tree Trimming-based Text Summarization. In HLT-NAACL. 462--471.","DOI":"10.3115\/v1\/N15-1049","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-21","unstructured":"NIST . Online. Homepage of TRECVID Evaluation. (. Online). deftempurl%http:\/\/www-nlpir.nist.gov\/projects\/trecvid\/ tempurl"},{"key":"key-10.1145\/3184558.3186336-22","unstructured":"Dinh Q Phung, Thi V Duong, Svetha Venkatesh, and Hung H Bui. 2005. Topic transition detection using hierarchical hidden Markov and semi-Markov models. In Proceedings of the 13th annual ACM international conference on Multimedia. ACM, 11--20."},{"key":"key-10.1145\/3184558.3186336-23","unstructured":"Dinh Q Phung, Svetha Venkatesh, and Chitra Dorai. 2002. High level segmentation of instructional videos based on content density Proceedings of the tenth ACM international conference on Multimedia. ACM, 295--298."},{"key":"key-10.1145\/3184558.3186336-24","unstructured":"Dinh Q Phung, Svetha Venkatesh, and Chitra Dorai. 2003. Hierarchical topical segmentation in instructional films based on cinematic expressive functions. In Proceedings of the eleventh ACM international conference on Multimedia. ACM, 287--290."},{"key":"key-10.1145\/3184558.3186336-25","unstructured":"Liping Ren, Zhiyi Qu, Weiqin Niu, Chaoxin Niu, and Yanqiu Cao. 2010. Key frame extraction based on information entropy and edge matching rate Future Computer and Communication (ICFCC), 2010 2nd International Conference on, Vol. Vol. 3. IEEE, V3--91."},{"key":"key-10.1145\/3184558.3186336-26","unstructured":"Martin Riedl and Chris Biemann. 2012. TopicTiling: a text segmentation algorithm based on LDA Proceedings of ACL 2012 Student Research Workshop. Association for Computational Linguistics, 37--42."},{"key":"key-10.1145\/3184558.3186336-27","unstructured":"Yossi Rubner, Carlo Tomasi, and Leonidas J Guibas. 2000. The earth mover's distance as a metric for image retrieval. International journal of computer vision Vol. 40, 2 (2000), 99--121.","DOI":"10.1023\/A:1026543900054","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-28","unstructured":"Frank Seide and Amit Agarwal. 2016. CNTK: Microsoft's Open-Source Deep-Learning Toolkit Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 2135--2135.","DOI":"10.1145\/2939672.2945397","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-29","unstructured":"Ananya SenGupta, Dalton Meitei Thounaojam, Kh Manglem Singh, and Sudipta Roy. 2015. Video shot boundary detection: A review. In Electrical, Computer and Communication Technologies (ICECCT), 2015 IEEE International Conference on. IEEE, 1--6.","DOI":"10.1109\/ICECCT.2015.7226084","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-30","unstructured":"Hiroya Takamura and Manabu Okumura. 2009. Text summarization model based on maximum coverage problem and its variant Proceedings of the 12th Conference of the European Chapter of the Association for Computational Linguistics. Association for Computational Linguistics, 781--789."},{"key":"key-10.1145\/3184558.3186336-31","unstructured":"Andreas Veit, Tomas Matera, Lukas Neumann, Jiri Matas, and Serge J. Belongie. 2016. COCO-Text: Dataset and Benchmark for Text Detection and Recognition in Natural Images. CoRR Vol. abs\/1601.07140 (2016)."},{"key":"key-10.1145\/3184558.3186336-32","unstructured":"Qixiang Ye and David Doermann. 2015. Text detection and recognition in imagery: A survey. IEEE transactions on pattern analysis and machine intelligence Vol. 37, 7 (2015), 1480--1500.","DOI":"10.1109\/TPAMI.2014.2366765","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186336-33","unstructured":"Jinhui Yuan, Huiyi Wang, Lan Xiao, Wujie Zheng, Jianmin Li, Fuzong Lin, and Bo Zhang. 2007. A formal study of shot boundary detection. IEEE transactions on circuits and systems for video technology Vol. 17, 2 (2007), 168--186.","DOI":"10.1109\/TCSVT.2006.888023","doi-asserted-by":"crossref"}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186336&ftid=1958179&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:47:23Z","timestamp":1524077243000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":33,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186336","relation":{"cites":[]}}}