{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:17Z","timestamp":1523998757627},"publisher-location":"New York, New York, USA","reference-count":47,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"Science Foundation Ireland","award":["SFI\/12\/RC\/2289"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186158","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Coevolutionary Recommendation Model"],"prefix":"10.1145","author":[{"given":"Yichao","family":"Lu","sequence":"first","affiliation":[{"name":"University of Toronto, Toronto, Canada"}]},{"given":"Ruihai","family":"Dong","sequence":"additional","affiliation":[{"name":"University College Dublin, Dublin, Ireland"}]},{"given":"Barry","family":"Smyth","sequence":"additional","affiliation":[{"name":"University College Dublin, Dublin, Ireland"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186158-1","unstructured":"Dario Amodei, Sundaram Ananthanarayanan, Rishita Anubhai, Jingliang Bai, Eric Battenberg, Carl Case, Jared Casper, Bryan Catanzaro, Qiang Cheng, Guoliang Chen, et almbox.. 2016. Deep speech 2: End-to-end speech recognition in english and mandarin International Conference on Machine Learning. 173--182."},{"key":"key-10.1145\/3178876.3186158-2","unstructured":"Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2014. Neural machine translation by jointly learning to align and translate. arXiv preprint arXiv:1409.0473 (2014)."},{"key":"key-10.1145\/3178876.3186158-3","unstructured":"David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of machine Learning research Vol. 3, Jan (2003), 993--1022."},{"key":"key-10.1145\/3178876.3186158-4","unstructured":"Emmanuel J Cand&#232;s and Benjamin Recht. 2009. Exact matrix completion via convex optimization. Foundations of Computational mathematics Vol. 9, 6 (2009), 717.","DOI":"10.1007\/s10208-009-9045-5","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-5","unstructured":"Li Chen, Guanliang Chen, and Feng Wang. 2015. Recommender systems based on user reviews: the state of the art. User Modeling and User-Adapted Interaction Vol. 25, 2 (2015), 99--154.","DOI":"10.1007\/s11257-015-9155-5","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-6","unstructured":"Kyunghyun Cho, Bart Van Merri&#235;nboer, Caglar Gulcehre, Dzmitry Bahdanau, Fethi Bougares, Holger Schwenk, and Yoshua Bengio. 2014. Learning phrase representations using RNN encoder-decoder for statistical machine translation. arXiv preprint arXiv:1406.1078 (2014)."},{"key":"key-10.1145\/3178876.3186158-7","unstructured":"Robert Desimone and John Duncan. 1995. Neural mechanisms of selective visual attention. Annual review of neuroscience Vol. 18, 1 (1995), 193--222.","DOI":"10.1146\/annurev.ne.18.030195.001205","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-8","unstructured":"Qiming Diao, Minghui Qiu, Chao-Yuan Wu, Alexander J Smola, Jing Jiang, and Chong Wang. 2014. Jointly modeling aspects, ratings and sentiments for movie recommendation (jmars) Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 193--202.","DOI":"10.1145\/2623330.2623758","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-9","unstructured":"Ruihai Dong, Michael P O'Mahony, Markus Schaal, Kevin McCarthy, and Barry Smyth. 2013 a. Sentimental product recommendation. In Proceedings of the 7th ACM conference on Recommender systems. ACM, 411--414.","DOI":"10.1145\/2507157.2507199","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-10","unstructured":"Ruihai Dong, Michael P O'Mahony, and Barry Smyth. 2014. Further experiments in opinionated product recommendation International Conference on Case-Based Reasoning. Springer, 110--124."},{"key":"key-10.1145\/3178876.3186158-11","unstructured":"Ruihai Dong, Markus Schaal, Michael P O'Mahony, Kevin McCarthy, and Barry Smyth. 2013 c. Opinionated product recommendation. In International Conference on Case-Based Reasoning. Springer, 44--58.","DOI":"10.1007\/978-3-642-39056-2_4","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-12","unstructured":"Ruihai Dong, Markus Schaal, Michael P O'Mahony, and Barry Smyth. 2013 b. Topic Extraction from Online Reviews for Classification and Recommendation. IJCAI, Vol. Vol. 13. 1310--1316."},{"key":"key-10.1145\/3178876.3186158-13","unstructured":"Ruihai Dong and Barry Smyth. 2016. Personalized Opinion-Based Recommendation. In International Conference on Case-Based Reasoning. Springer, 93--107.","DOI":"10.1007\/978-3-319-47096-2_7","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-14","unstructured":"Jonas Gehring, Michael Auli, David Grangier, Denis Yarats, and Yann N Dauphin. 2017. Convolutional sequence to sequence learning. arXiv preprint arXiv:1705.03122 (2017)."},{"key":"key-10.1145\/3178876.3186158-15","unstructured":"Alex Graves and J&#252;rgen Schmidhuber. 2005. Framewise phoneme classification with bidirectional LSTM and other neural network architectures. Neural Networks Vol. 18, 5--6 (2005), 602--610."},{"key":"key-10.1145\/3178876.3186158-16","unstructured":"Karl Moritz Hermann, Tomas Kocisky, Edward Grefenstette, Lasse Espeholt, Will Kay, Mustafa Suleyman, and Phil Blunsom. 2015. Teaching machines to read and comprehend. In Advances in Neural Information Processing Systems. 1693--1701."},{"key":"key-10.1145\/3178876.3186158-17","unstructured":"Nal Kalchbrenner, Edward Grefenstette, and Phil Blunsom. 2014. A convolutional neural network for modelling sentences. arXiv preprint arXiv:1404.2188 (2014)."},{"key":"key-10.1145\/3178876.3186158-18","unstructured":"Timothy L Keiningham, Bruce Cooil, Lerzan Aksoy, Tor W Andreassen, and Jay Weiner. 2007. The value of different customer satisfaction and loyalty metrics in predicting customer retention, recommendation, and share-of-wallet. Managing Service Quality: An International Journal Vol. 17, 4 (2007), 361--384."},{"key":"key-10.1145\/3178876.3186158-19","unstructured":"Donghyun Kim, Chanyoung Park, Jinoh Oh, Sungyoung Lee, and Hwanjo Yu. 2016. Convolutional matrix factorization for document context-aware recommendation Proceedings of the 10th ACM Conference on Recommender Systems. ACM, 233--240."},{"key":"key-10.1145\/3178876.3186158-20","unstructured":"Yoon Kim. 2014. Convolutional neural networks for sentence classification. arXiv preprint arXiv:1408.5882 (2014)."},{"key":"key-10.1145\/3178876.3186158-21","unstructured":"Yehuda Koren. 2008. Factorization meets the neighborhood: a multifaceted collaborative filtering model. In Proceedings of the 14th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 426--434.","DOI":"10.1145\/1401890.1401944","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-22","unstructured":"Yehuda Koren, Robert Bell, and Chris Volinsky. 2009. Matrix factorization techniques for recommender systems. Computer Vol. 42, 8 (2009).","DOI":"10.1109\/MC.2009.263","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-23","unstructured":"Jiwei Li, Will Monroe, Alan Ritter, Michel Galley, Jianfeng Gao, and Dan Jurafsky. 2016. Deep reinforcement learning for dialogue generation. arXiv preprint arXiv:1606.01541 (2016)."},{"key":"key-10.1145\/3178876.3186158-24","unstructured":"Greg Linden, Brent Smith, and Jeremy York. 2003. Amazon. com recommendations: Item-to-item collaborative filtering. IEEE Internet computing Vol. 7, 1 (2003), 76--80.","DOI":"10.1109\/MIC.2003.1167344","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-25","unstructured":"Minh-Thang Luong, Hieu Pham, and Christopher D Manning. 2015. Effective approaches to attention-based neural machine translation. arXiv preprint arXiv:1508.04025 (2015)."},{"key":"key-10.1145\/3178876.3186158-26","unstructured":"Julian McAuley and Jure Leskovec. 2013. Hidden factors and hidden topics: understanding rating dimensions with review text Proceedings of the 7th ACM conference on Recommender systems. ACM, 165--172.","DOI":"10.1145\/2507157.2507163","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-27","unstructured":"Tom&#225;vs Mikolov, Martin Karafi&#225;t, Luk&#225;vs Burget, Jan vCernock&#7923;, and Sanjeev Khudanpur. 2010. Recurrent neural network based language model. In Eleventh Annual Conference of the International Speech Communication Association."},{"key":"key-10.1145\/3178876.3186158-28","unstructured":"Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality Advances in neural information processing systems. 3111--3119."},{"key":"key-10.1145\/3178876.3186158-29","unstructured":"Andriy Mnih and Ruslan R Salakhutdinov. 2008. Probabilistic matrix factorization. In Advances in neural information processing systems. 1257--1264."},{"key":"key-10.1145\/3178876.3186158-30","unstructured":"Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532--1543.","DOI":"10.3115\/v1\/D14-1162","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-31","unstructured":"Alexandrin Popescul, David M Pennock, and Steve Lawrence. 2001. Probabilistic models for unified collaborative and content-based recommendation in sparse-data environments. In Proceedings of the Seventeenth conference on Uncertainty in artificial intelligence. Morgan Kaufmann Publishers Inc., 437--444."},{"key":"key-10.1145\/3178876.3186158-32","unstructured":"Alexander M Rush, Sumit Chopra, and Jason Weston. 2015. A neural attention model for abstractive sentence summarization. arXiv preprint arXiv:1509.00685 (2015)."},{"key":"key-10.1145\/3178876.3186158-33","unstructured":"Andrew I Schein, Alexandrin Popescul, Lyle H Ungar, and David M Pennock. 2002. Methods and metrics for cold-start recommendations Proceedings of the 25th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 253--260."},{"key":"key-10.1145\/3178876.3186158-34","unstructured":"Minjoon Seo, Aniruddha Kembhavi, Ali Farhadi, and Hannaneh Hajishirzi. 2016. Bidirectional attention flow for machine comprehension. arXiv preprint arXiv:1611.01603 (2016)."},{"key":"key-10.1145\/3178876.3186158-35","unstructured":"Sungyong Seo, Jing Huang, Hao Yang, and Yan Liu. 2017. Interpretable Convolutional Neural Networks with Dual Local and Global Attention for Review Rating Prediction. In Proceedings of the Eleventh ACM Conference on Recommender Systems. ACM, 297--305.","DOI":"10.1145\/3109859.3109890","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186158-36","unstructured":"Alessandro Sordoni, Michel Galley, Michael Auli, Chris Brockett, Yangfeng Ji, Margaret Mitchell, Jian-Yun Nie, Jianfeng Gao, and Bill Dolan. 2015. A neural network approach to context-sensitive generation of conversational responses. arXiv preprint arXiv:1506.06714 (2015)."},{"key":"key-10.1145\/3178876.3186158-37","unstructured":"Ilya Sutskever, Oriol Vinyals, and Quoc V Le. 2014. Sequence to sequence learning with neural networks Advances in neural information processing systems. 3104--3112."},{"key":"key-10.1145\/3178876.3186158-38","unstructured":"Duyu Tang, Bing Qin, and Ting Liu. 2015. Document Modeling with Gated Recurrent Neural Network for Sentiment Classification. EMNLP. 1422--1432."},{"key":"key-10.1145\/3178876.3186158-39","unstructured":"Aaron Van den Oord, Sander Dieleman, and Benjamin Schrauwen. 2013. Deep content-based music recommendation. In Advances in neural information processing systems. 2643--2651."},{"key":"key-10.1145\/3178876.3186158-40","unstructured":"Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Lukasz Kaiser, and Illia Polosukhin. 2017. Attention Is All You Need. arXiv preprint arXiv:1706.03762 (2017)."},{"key":"key-10.1145\/3178876.3186158-41","unstructured":"Chong Wang and David M Blei. 2011. Collaborative topic modeling for recommending scientific articles Proceedings of the 17th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 448--456."},{"key":"key-10.1145\/3178876.3186158-42","unstructured":"Yequan Wang, Minlie Huang, Li Zhao, et almbox.. 2016. Attention-based lstm for aspect-level sentiment classification Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing. 606--615."},{"key":"key-10.1145\/3178876.3186158-43","unstructured":"Tsung-Hsien Wen, Milica Gasic, Nikola Mrksic, Pei-Hao Su, David Vandyke, and Steve Young. 2015. Semantically conditioned lstm-based natural language generation for spoken dialogue systems. arXiv preprint arXiv:1508.01745 (2015)."},{"key":"key-10.1145\/3178876.3186158-44","unstructured":"Jason Weston, Antoine Bordes, Sumit Chopra, Alexander M Rush, Bart van Merri&#235;nboer, Armand Joulin, and Tomas Mikolov. 2015. Towards ai-complete question answering: A set of prerequisite toy tasks. arXiv preprint arXiv:1502.05698 (2015)."},{"key":"key-10.1145\/3178876.3186158-45","unstructured":"Kelvin Xu, Jimmy Ba, Ryan Kiros, Kyunghyun Cho, Aaron Courville, Ruslan Salakhudinov, Rich Zemel, and Yoshua Bengio. 2015. Show, attend and tell: Neural image caption generation with visual attention International Conference on Machine Learning. 2048--2057."},{"key":"key-10.1145\/3178876.3186158-46","unstructured":"Zichao Yang, Diyi Yang, Chris Dyer, Xiaodong He, Alex Smola, and Eduard Hovy. 2016. Hierarchical attention networks for document classification Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 1480--1489."},{"key":"key-10.1145\/3178876.3186158-47","unstructured":"Yongfeng Zhang, Guokun Lai, Min Zhang, Yi Zhang, Yiqun Liu, and Shaoping Ma. 2014. Explicit factor models for explainable recommendation based on phrase-level sentiment analysis. In Proceedings of the 37th international ACM SIGIR conference on Research &#38; development in information retrieval. ACM, 83--92.","DOI":"10.1145\/2600428.2609579","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186158&ftid=1957514&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:56:07Z","timestamp":1523638567000},"score":1.0,"subtitle":["Mutual Learning between Ratings and Reviews"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":47,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186158","relation":{"cites":[]}}}