{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:58:52Z","timestamp":1523998732315},"publisher-location":"New York, New York, USA","reference-count":44,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186055","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Did You Really Just Have a Heart Attack?"],"prefix":"10.1145","author":[{"given":"Payam","family":"Karisani","sequence":"first","affiliation":[{"name":"Emory University, Atlanta, GA, USA"}]},{"given":"Eugene","family":"Agichtein","sequence":"additional","affiliation":[{"name":"Emory University, Atlanta, GA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186055-1","unstructured":"Charu C. Aggarwal and ChengXiang Zhai. 2012. A Survey of Text Classification Algorithms. Springer US, Boston, MA, 163--222.","DOI":"10.1007\/978-1-4614-3223-4_6","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-2","unstructured":"Eiji Aramaki, Sachiko Maskawa, and Mizuki Morita. 2011. Twitter Catches the Flu: Detecting Influenza Epidemics Using Twitter. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP '11). Association for Computational Linguistics, Stroudsburg, PA, USA, 1568--1576."},{"key":"key-10.1145\/3178876.3186055-3","unstructured":"David Bamman and Noah A. Smith. 2015. Contextualized Sarcasm Detection on Twitter. In Proceedings of the Ninth International Conference on Web and Social Media, (ICWSM 2015), 2015. 574--577."},{"key":"key-10.1145\/3178876.3186055-4","unstructured":"Carmen Banea, Di Chen, Rada Mihalcea, Claire Cardie, and Janyce Wiebe. 2014. SimCompass: Using Deep Learning Word Embeddings to Assess Cross-level Similarity. In Proceedings of the 8th InternationalWorkshop on Semantic Evaluation, SemEval@COLING 2014, Dublin, Ireland, August 23--24, 2014. 560--565."},{"key":"key-10.1145\/3178876.3186055-5","unstructured":"Meeyoung Cha, Hamed Haddadi, Fabr&#237;cio Benevenuto, and P. Krishna Gummadi. 2010. Measuring User Influence in Twitter: The Million Follower Fallacy. In Proceedings of the Fourth International Conference on Weblogs and Social Media, (ICWSM 2010), 2010. 10--17."},{"key":"key-10.1145\/3178876.3186055-6","unstructured":"Lauren E. Charles-Smith, Tera L. Reynolds, Mark A. Cameron, Mike Conway, Eric H. Y. Lau, Jennifer M. Olsen, Julie A. Pavlin, Mika Shigematsu, Laura C. Streichert, Katie J. Suda, and Courtney D. Corley. 2015. Using Social Media for Actionable Disease Surveillance and Outbreak Management: A Systematic Literature Review. PLOS ONE 10, 10 (10 2015), 1--20."},{"key":"key-10.1145\/3178876.3186055-7","unstructured":"Cynthia Chew and Gunther Eysenbach. 2010. Pandemics in the Age of Twitter: Content Analysis of Tweets during the 2009 H1N1 Outbreak. PLOS ONE 5, 11 (11 2010), 1--13."},{"key":"key-10.1145\/3178876.3186055-8","unstructured":"Munmun De Choudhury. 2015. Anorexia on Tumblr: A Characterization Study. In Proceedings of the 5th International Conference on Digital Health 2015, Florence, Italy, May 18--20, 2015. 43--50.","DOI":"10.1145\/2750511.2750515","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-9","unstructured":"Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting Depression via Social Media. In Proceedings of the Seventh International Conference on Weblogs and Social Media, (ICWSM 2013), 2013. 1--10."},{"key":"key-10.1145\/3178876.3186055-10","unstructured":"Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering Shifts to Suicidal Ideation from Mental Health Content in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, San Jose, CA, USA, May 7--12, 2016. 2098--2110.","DOI":"10.1145\/2858036.2858207","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-11","unstructured":"Aaron M. Cohen and William R. Hersh. 2005. A survey of current work in biomedical text mining. Briefings in Bioinformatics 6, 1 (2005), 57--71.","DOI":"10.1093\/bib\/6.1.57","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-12","unstructured":"Hongying Dai, Brian R. Lee, and Jianqiang Hao. 2017. Predicting Asthma Prevalence by Linking Social Media Data and Traditional Surveys. The ANNALS of the American Academy of Political and Social Science 669, 1 (2017), 75--92.","DOI":"10.1177\/0002716216678399","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-13","unstructured":"Raminta Daniulaityte, Lu Chen, R. Francois Lamy, G. Robert Carlson, Krishnaprasad Thirunarayan, and Amit Sheth. 2016. \"When 'Bad' is 'Good'\": Identifying Personal Communication and Sentiment in Drug-Related Tweets. JMIR Public Health Surveill 2, 2 (24 Oct 2016), e162."},{"key":"key-10.1145\/3178876.3186055-14","unstructured":"Jerome H. Friedman. 2001. Greedy Function Approximation: A Gradient Boosting Machine. The Annals of Statistics 29, 5 (2001), 1189--1232.","DOI":"10.1214\/aos\/1013203451","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-15","unstructured":"Edouard Grave, Tomas Mikolov, Armand Joulin, and Piotr Bojanowski. 2017. Bag of Tricks for Efficient Text Classification. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics, (EACL 2017), Valencia, Spain, April 3--7, 2017, Volume 2: Short Papers. 427--431."},{"key":"key-10.1145\/3178876.3186055-16","unstructured":"Eric H. Huang, Richard Socher, Christopher D. Manning, and Andrew Y. Ng. 2012. Improving Word Representations via Global Context and Multiple Word Prototypes. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics (ACL 2012). 873--882."},{"key":"key-10.1145\/3178876.3186055-17","unstructured":"Muhammad Imran, Prasenjit Mitra, and Carlos Castillo. 2016. Twitter as a Lifeline: Human-annotated Twitter Corpora for NLP of Crisis-related Messages. In Proceedings of the Tenth International Conference on Language Resources and Evaluation (LREC 2016), 2016. 1638--1643."},{"key":"key-10.1145\/3178876.3186055-18","unstructured":"Aditya Joshi, Vaibhav Tripathi, Kevin Patel, Pushpak Bhattacharyya, and Mark James Carman. 2016. Are Word Embedding-based Features Useful for Sarcasm Detection?. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, (EMNLP 2016), 2016. 1006--1011."},{"key":"key-10.1145\/3178876.3186055-19","unstructured":"Tom Kenter and Maarten de Rijke. 2015. Short Text Similarity with Word Embeddings. In Proceedings of the 24th ACM International Conference on Information and Knowledge Management (CIKM 2015). 1411--1420.","DOI":"10.1145\/2806416.2806475","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-20","unstructured":"Yoon Kim. 2014. Convolutional Neural Networks for Sentence Classification. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing, (EMNLP 2014). 1746--1751.","DOI":"10.3115\/v1\/D14-1181","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-21","unstructured":"Lingpeng Kong, Nathan Schneider, Swabha Swayamdipta, Archna Bhatia, Chris Dyer, and Noah A. Smith. 2014. A Dependency Parser for Tweets. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing, (EMNLP 2014). 1001--1012.","DOI":"10.3115\/v1\/D14-1108","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-22","unstructured":"Alex Lamb, Michael J. Paul, and Mark Dredze. 2013. Separating Fact from Fear: Tracking Flu Infections on Twitter. In Human Language Technologies: Conference of the North American Chapter of the Association of Computational Linguistics, (NAACL 2013). 789--795."},{"key":"key-10.1145\/3178876.3186055-23","unstructured":"David Lazer, Alex Pentland, Lada Adamic, Sinan Aral, Albert-L&#225;szl&#243; Barab&#225;si, Devon Brewer, Nicholas Christakis, Noshir Contractor, James Fowler, Myron Gutmann, Tony Jebara, Gary King, Michael Macy, Deb Roy, and Marshall Van Alstyne. 2009. Computational Social Science. Science 323, 5915 (2009), 721--723.","DOI":"10.1126\/science.1167742","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-24","unstructured":"Moreno MA, Christakis DA, Egan KG, Brockman LN, and Becker T. 2012. Associations between displayed alcohol references on facebook and problem drinking among college students. Archives of Pediatrics and Adolescent Medicine 166, 2 (2012), 157--163.","DOI":"10.1001\/archpediatrics.2011.180","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-25","unstructured":"Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of Machine Learning Research 9, Nov (2008), 2579--2605."},{"key":"key-10.1145\/3178876.3186055-26","unstructured":"Shotaro Matsumoto, Hiroya Takamura, and Manabu Okumura. 2005. Sentiment Classification Using Word Sub-sequences and Dependency Sub-trees. In Proceedings of the 9th Pacific-Asia Conference on Advances in Knowledge Discovery and Data Mining (PAKDD'05). Springer-Verlag, Berlin, Heidelberg, 301--311.","DOI":"10.1007\/11430919_37","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-27","unstructured":"Andrew Kachites McCallum. 2002. Mallet: A machine learning for language toolkit. (2002)."},{"key":"key-10.1145\/3178876.3186055-28","unstructured":"Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Distributed Representations ofWords and Phrases and Their Compositionality. In Proceedings of the 26th International Conference on Neural Information Processing Systems - Volume 2 (NIPS'13). Curran Associates Inc., USA, 3111--3119."},{"key":"key-10.1145\/3178876.3186055-29","unstructured":"Tom M. Mitchell. 1997. Machine learning. McGraw-Hill Boston, MA:."},{"key":"key-10.1145\/3178876.3186055-30","unstructured":"Yishai Ofran, Ora Paltiel, Dan Pelleg, Jacob M. Rowe, and Elad Yom-Tov. 2012. Patterns of Information-Seeking for Cancer on the Internet: An Analysis of Real World Data. PLOS ONE 7, 9 (09 2012), 1--7."},{"key":"key-10.1145\/3178876.3186055-31","unstructured":"Alexandra Olteanu, Emre Kiciman, and Carlos Castillo. 2018. A Critical Review of Online Social Data: Biases, Methodological Pitfalls, and Ethical Boundaries. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining (WSDM '18). ACM, New York, NY, USA, 785--786.","DOI":"10.1145\/3159652.3162004","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-32","unstructured":"Michael J. Paul and Mark Dredze. 2011. You Are What You Tweet: Analyzing Twitter for Public Health. In Proceedings of the Fifth International Conference on Weblogs and Social Media, ICWSM 2011, Barcelona, Catalonia, Spain, July 17--21, 2011. 265--272."},{"key":"key-10.1145\/3178876.3186055-33","unstructured":"Michael J. Paul and Mark Dredze. 2017. Social Monitoring for Public Health. Morgan &#38; Claypool Publishers."},{"key":"key-10.1145\/3178876.3186055-34","unstructured":"Jeffrey Pennington, Richard Socher, and Christopher D. Manning. 2014. Glove: Global Vectors for Word Representation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing, EMNLP 2014, October 25--29, 2014, Doha, Qatar. 1532--1543."},{"key":"key-10.1145\/3178876.3186055-35","unstructured":"Kyle W. Prier, Matthew S. Smith, Christophe Giraud-Carrier, and Carl L. Hanson. 2011. Identifying Health-Related Topics on Twitter. In International Conference on Social Computing, Behavioral-Cultural Modeling, and Prediction, John Salerno, Shanchieh Jay Yang, Dana Nau, and Sun-Ki Chai (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 18--25.","DOI":"10.1007\/978-3-642-19656-0_4","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-36","unstructured":"Victor M. Prieto, Sergio Matos, Manuel Alvarez, Fidel Cacheda, and Jose Luis Oliveira. 2014. Twitter: A Good Place to Detect Health Conditions. PLOS ONE 9, 1 (01 2014), 1--11."},{"key":"key-10.1145\/3178876.3186055-37","unstructured":"Marcel Salathe and Shashank Khandelwal. 2011. Assessing Vaccination Sentiments with Online Social Media: Implications for Infectious Disease Dynamics and Control. PLOS Computational Biology 7, 10 (10 2011), 1--7."},{"key":"key-10.1145\/3178876.3186055-38","unstructured":"Erich Schubert, Alexander Koos, Tobias Emrich, Andreas Z&#252;fle, Klaus Arthur Schmid, and Arthur Zimek. 2015. A Framework for Clustering Uncertain Data. Proc. VLDB Endowment 8, 12 (Aug. 2015), 1976--1979.","DOI":"10.14778\/2824032.2824115","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-39","unstructured":"Richard Socher, Danqi Chen, Christopher D. Manning, and Andrew Y. Ng. 2013. Reasoning With Neural Tensor Networks for Knowledge Base Completion. In Advances in Neural Information Processing Systems 26: 27th Annual Conference on Neural Information Processing Systems 2013. Proceedings of a meeting held December 5--8, (NIPS 2013), 2013. 926--934."},{"key":"key-10.1145\/3178876.3186055-40","unstructured":"Damiano Spina, Julio Gonzalo, and Enrique Amig&#243;. 2013. Discovering Filter Keywords for Company Name Disambiguation in Twitter. Expert Syst. Appl. 40, 12 (Sept. 2013), 4986--5003.","DOI":"10.1016\/j.eswa.2013.03.001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-41","unstructured":"Duyu Tang, Bing Qin, and Ting Liu. 2015. Document Modeling with Gated Recurrent Neural Network for Sentiment Classification. In Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing, (EMNLP 2015), 2015. 1422--1432.","DOI":"10.18653\/v1\/D15-1167","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-42","unstructured":"Amir Hossein Yazdavar, Hussein S. Al-Olimat, Monireh Ebrahimi, Goonmeet Bajaj, Tanvi Banerjee, Krishnaprasad Thirunarayan, Jyotishman Pathak, and Amit Sheth. 2017. Semi-Supervised Approach to Monitoring Clinical Depressive Symptoms in Social Media. In Proceedings of the 2017 IEEE\/ACM International Conference on Advances in Social Networks Analysis and Mining 2017 (ASONAM'17). ACM, New York, NY, USA, 1191--1198.","DOI":"10.1145\/3110025.3123028","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186055-43","unstructured":"Zhijun Yin, Daniel Fabbri, Trent S. Rosenbloom, and Bradley Malin. 2015. A Scalable Framework to Detect Personal Health Mentions on Twitter. Journal of Medical Internet Research 17, 6 (05 Jun 2015), e138."},{"key":"key-10.1145\/3178876.3186055-44","unstructured":"Mo Yu, Tiejun Zhao, Daxiang Dong, Hao Tian, and Dianhai Yu. 2013. Compound Embedding Features for Semi-supervised Learning. In Human Language Technologies: Conference of the North American Chapter of the Association of Computational Linguistics, (NAACL 2013), 2013. 563--568."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186055&ftid=1957479&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:03:08Z","timestamp":1523635388000},"score":1.0,"subtitle":["Towards Robust Detection of Personal Health Mentions in Social Media"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":44,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186055","relation":{"cites":[]}}}