{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:24Z","timestamp":1525103724383},"publisher-location":"New York, New York, USA","reference-count":31,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"ANR","award":["project GoAsQ (ANR-15-CE23-0022)"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191540","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["A Corpus for Hybrid Question Answering Systems"],"prefix":"10.1145","author":[{"given":"Brigitte","family":"Grau","sequence":"first","affiliation":[{"name":"LIMSI, CNRS, ENSIIE, University Paris-Saclay, Orsay, France"}]},{"given":"Anne-Laure","family":"Ligozat","sequence":"additional","affiliation":[{"name":"LIMSI, CNRS, ENSIIE, University Paris-Saclay, Orsay, France"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191540-1","unstructured":"Ricardo Baeza-Yates, Berthier Ribeiro-Neto, et al. 1999. Modern information retrieval. Vol. 463. ACM press New York."},{"key":"key-10.1145\/3184558.3191540-2","unstructured":"Romain Beaumont, Brigitte Grau, and Anne-Laure Ligozat. 2015. SemGraphQA@QALD5: LIMSI participation at QALD5@CLEF Working Notes of CLEF 2015."},{"key":"key-10.1145\/3184558.3191540-3","unstructured":"Jonathan Berant, Andrew Chou, Roy Frostig, and Percy Liang. 2013. Semantic parsing on freebase from question-answer pairs Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing. 1533--1544."},{"key":"key-10.1145\/3184558.3191540-4","unstructured":"Antoine Bordes, Nicolas Usunier, Alberto Garcia-Duran, Jason Weston, and Oksana Yakhnenko. 2013. Translating embeddings for modeling multi-relational data Advances in Neural Information Processing Systems. 2787--2795."},{"key":"key-10.1145\/3184558.3191540-5","unstructured":"Danqi Chen, Adam Fisch, Jason Weston, and Antoine Bordes. 2017. Reading Wikipedia to Answer Open-Domain Questions. In Proceedings of ACL 2017. 1870--1879.","DOI":"10.18653\/v1\/P17-1171","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191540-6","unstructured":"Jennifer Chu-Carroll, James Fan, BK Boguraev, David Carmel, Dafna Sheinwald, and Chris Welty. 2012. Finding needles in the haystack: Search and candidate generation. IBM Journal of Research and Development Vol. 56, 3.4 (2012), 6--1."},{"key":"key-10.1145\/3184558.3191540-7","unstructured":"Silviu Cucerzan and Eugene Agichtein. 2005. Factoid Question Answering over Unstructured and Structured Web Content. TREC Proceedings, Vol. Vol. 72. 90."},{"key":"key-10.1145\/3184558.3191540-8","unstructured":"Dennis Diefenbach, Vanessa Lopez, Kamal Singh, and Pierre Maret. 2017. Core techniques of question answering systems over knowledge bases: a survey. Knowledge and Information Systems (2017), 1--41."},{"key":"key-10.1145\/3184558.3191540-9","unstructured":"Martin Gleize and Brigitte Grau. 2015. A Unified Kernel Approach for Learning Typed Sentence Rewritings Proceedings of ACL-IJCNLP."},{"key":"key-10.1145\/3184558.3191540-10","unstructured":"Arnaud Grappy, Brigitte Grau, Mathieu-Henri Falco, Anne-Laure Ligozat, Isabelle Robba, and Anne Vilnat. 2011. Selecting answers to questions from Web documents by a robust validation process Proceedings of Web Intelligence Conference (WI)."},{"key":"key-10.1145\/3184558.3191540-11","unstructured":"Hua He and Jimmy Lin. 2016. Pairwise Word Interaction Modeling with Deep Neural Networks for Semantic Similarity Measurement. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, San Diego, California, 937--948. http:\/\/www.aclweb.org\/anthology\/N16--1108","DOI":"10.18653\/v1\/N16-1108","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191540-12","unstructured":"Wesley Hildebrandt, Boris Katz, and Jimmy J Lin. 2004. Answering Definition Questions Using Multiple Knowledge Sources. HLT-NAACL. 49--56."},{"key":"key-10.1145\/3184558.3191540-13","unstructured":"Denis Lukovnikov, Asja Fischer, Jens Lehmann, and S&#246;ren Auer. 2017. Neural network-based question answering over knowledge graphs on word and character level. In Proceedings of the 26th international conference on World Wide Web. International World Wide Web Conferences Steering Committee, 1211--1220.","DOI":"10.1145\/3038912.3052675","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191540-14","unstructured":"Bernardo Magnini, Alessandro Vallin, Christelle Ayache, Gregor Erbach, Anselmo Pe nas, Maarten De Rijke, Paulo Rocha, Kiril Simov, and Richard Sutcliffe. 2004. Overview of the CLEF 2004 multilingual question answering track Workshop of the Cross-Language Evaluation Forum for European Languages. Springer, 371--391."},{"key":"key-10.1145\/3184558.3191540-15","unstructured":"Seonyeong Park, Soonchoul Kwon, Byungsoo Kim, and Gary Geunbae Lee. 2015. ISOFT at QALD-5: Hybrid question answering system over linked data and text data Working Notes of CLEF 2015."},{"key":"key-10.1145\/3184558.3191540-16","unstructured":"Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. 2016. Squad: 100,000"},{"key":"key-10.1145\/3184558.3191540-17","unstructured":"questions for machine comprehension of text. arXiv preprint arXiv:1606.05250 (2016)."},{"key":"key-10.1145\/3184558.3191540-18","unstructured":"Christina Unger, Lorenz B&#252;hmann, Jens Lehmann, Axel-Cyrille Ngonga Ngomo, Daniel Gerber, and Philipp Cimiano. 2012. Template-based question answering over RDF data. In Proceedings of the 21st international conference on World Wide Web. ACM, 639--648.","DOI":"10.1145\/2187836.2187923","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191540-19","unstructured":"Christina Unger, Corina Forascu, Vanessa Lopez, ACN Ngomo, E Cabrio, Philipp Cimiano, and Sebastian Walter. 2014. Question Answering over Linked Data (QALD-4). CLEF Conference."},{"key":"key-10.1145\/3184558.3191540-20","unstructured":"Alessandro Vallin, Bernardo Magnini, Danilo Giampiccolo, Lili Aunimo, Christelle Ayache, Petya Osenova, Anselmo Penas, Maarten De Rijke, Bogdan Sacaleanu, Diana Santos, et al. 2005. Overview of the CLEF 2005 multilingual question answering track Workshop of the Cross-Language Evaluation Forum for European Languages. Springer, 307--331."},{"key":"key-10.1145\/3184558.3191540-21","unstructured":"Ellen M Voorhees. 2001. Overview of TREC 2001 Question Answering Track. In TREC Conference."},{"key":"key-10.1145\/3184558.3191540-22","unstructured":"Ellen M Voorhees. 2003. Overview of the TREC 2003 Question Answering Track. TREC Conference, Vol. Vol. 2003. 54--68."},{"key":"key-10.1145\/3184558.3191540-23","unstructured":"Ellen M Voorhees. 2004. Overview of the TREC 2004 Question Answering Track. (2004)."},{"key":"key-10.1145\/3184558.3191540-24","unstructured":"Mengqiu Wang and Christopher D Manning. 2010. Probabilistic tree-edit models with structured latent variables for textual entailment and question answering. In COLING."},{"key":"key-10.1145\/3184558.3191540-25","unstructured":"Kun Xu, Yansong Feng, Songfang Huang, and Dongyan Zhao. 2016. Hybrid Question Answering over Knowledge Base and Free Text Proceedings of COLING 2016, the 26th International Conference on Computational Linguistics: Technical Papers. The COLING 2016 Organizing Committee, Osaka, Japan, 2397--2407. http:\/\/aclweb.org\/anthology\/C16--1226"},{"key":"key-10.1145\/3184558.3191540-26","unstructured":"Kun Xu, Siva Reddy, Yansong Feng, Songfang Huang, and Dongyan Zhao. 2016. Question Answering on Freebase via Relation Extraction and Textual Evidence Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, Berlin, Germany, 2326--2336. deftempurl%http:\/\/www.aclweb.org\/anthology\/P16--1220 tempurl"},{"key":"key-10.1145\/3184558.3191540-27","unstructured":"Mohamed Yahya, Klaus Berberich, Shady Elbassuoni, and Gerhard Weikum. 2013. Robust question answering over the web of linked data Proceedings of CIKM."},{"key":"key-10.1145\/3184558.3191540-28","unstructured":"Xuchen Yao and Benjamin Van Durme. 2014. Information extraction over structured data: Question answering with freebase Proceedings of ACL."},{"key":"key-10.1145\/3184558.3191540-29","unstructured":"Xuchen Yao, Benjamin Van Durme, Chris Callison-Burch, and Peter Clark. 2013 a. A Lightweight and High Performance Monolingual Word Aligner. Proceedings of ACL. 702--707."},{"key":"key-10.1145\/3184558.3191540-30","unstructured":"Xuchen Yao, Benjamin Van Durme, Chris Callison-Burch, and Peter Clark. 2013 b. Semi-Markov Phrase-Based Monolingual Alignment. In Proceedings of EMNLP. 590--600."},{"key":"key-10.1145\/3184558.3191540-31","unstructured":"Lei Zou, Ruizhe Huang, Haixun Wang, Jeffer Xu Yu, Wenqiang He, and Dongyan Zhao. 2014. Natural language question answering over RDF: a graph data driven approach Proceedings of SIGMOD."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191540&ftid=1958297&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T20:11:04Z","timestamp":1524082264000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":31,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191540","relation":{"cites":[]}}}