{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:17Z","timestamp":1523998757382},"publisher-location":"New York, New York, USA","reference-count":57,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"the National Natural Science Foundation of China","award":["61725201","61528201"]},{"name":"the National Science Foundation","award":["1054199","1633370","1620319","1131500"]},{"name":"the National Key Research and Development Program","award":["2016YFB1000801"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186157","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Through a Gender Lens"],"prefix":"10.1145","author":[{"given":"Zhenpeng","family":"Chen","sequence":"first","affiliation":[{"name":"Peking University, Beijing, China"}]},{"given":"Xuan","family":"Lu","sequence":"additional","affiliation":[{"name":"Peking University, Beijing, China"}]},{"given":"Wei","family":"Ai","sequence":"additional","affiliation":[{"name":"University of Michigan, Ann Arbor, MI, USA"}]},{"given":"Huoran","family":"Li","sequence":"additional","affiliation":[{"name":"Peking University, Beijing, China"}]},{"given":"Qiaozhu","family":"Mei","sequence":"additional","affiliation":[{"name":"University of Michigan, Ann Arbor, MI, USA"}]},{"given":"Xuanzhe","family":"Liu","sequence":"additional","affiliation":[{"name":"Peking University, Beijing, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186157-1","unstructured":"Fabes Richard A and Martin Carol Lynn. 1991. Gender and age stereotypes of emotionality. Personality and Social Psychology Bulletin Vol. 17, 5 (1991), 532--540."},{"key":"key-10.1145\/3178876.3186157-2","unstructured":"Steven L. Ablon, Daniel P. Brown, Edward J. Khantzian, and John E. Mack. 2013. Explorations in affect development and meaning. Routledge."},{"key":"key-10.1145\/3178876.3186157-3","unstructured":"Wei Ai, Xuan Lu, Xuanzhe Liu, Ning Wang, Gang Huang, and Qiaozhu Mei. 2017. Untangling emoji popularity through semantic embeddings Proceedings of the 11th International Conference on Weblogs and Social Media, ICWSM 2017. 2--11."},{"key":"key-10.1145\/3178876.3186157-4","unstructured":"Fisher Ronald Aylmer. 1925. Statistical methods for research workers. Genesis Publishing Pvt Ltd."},{"key":"key-10.1145\/3178876.3186157-5","unstructured":"Francesco Barbieri, Germ&#225;n Kruszewski, Francesco Ronzano, and Horacio Saggion. 2016 a. How cosmopolitan are emojis?: Exploring emojis usage and meaning over different languages with distributional semantics. In Proceedings of the 2016 ACM Conference on Multimedia Conference, MM 2016. 531--535.","DOI":"10.1145\/2964284.2967278","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-6","unstructured":"Francesco Barbieri, Francesco Ronzano, and Horacio Saggion. 2016 b. What does this emoji mean? A vector space skip-gram model for Twitter emojis Proceedings of the 10th International Conference on Language Resources and Evaluation LREC 2016."},{"key":"key-10.1145\/3178876.3186157-7","unstructured":"John D. Burger, John C. Henderson, George Kim, and Guido Zarrella. 2011. Discriminating gender on Twitter. In Proceedings of the 2011 Conference on Empirical Methods in Natural Language Processing, EMNLP 2011. 1301--1309."},{"key":"key-10.1145\/3178876.3186157-8","unstructured":"Morgane Ciot, Morgan Sonderegger, and Derek Ruths. 2013. Gender inference of Twitter users in non-English contexts Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing, EMNLP 2013. 1136--1145."},{"key":"key-10.1145\/3178876.3186157-9","unstructured":"Cortes Corinna and Vapnik Vladimir. 1995. Support vector machine. Machine learning Vol. 20, 3 (1995), 273--297.","DOI":"10.1007\/BF00994018","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-10","unstructured":"Henriette Cramer, Paloma de Juan, and Joel R. Tetreault. 2016. Sender-intended functions of emojis in US messaging Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2016. 504--509."},{"key":"key-10.1145\/3178876.3186157-11","unstructured":"Eli Dresner and Susan C Herring. 2010. Functions of the nonverbal in CMC: Emoticons and illocutionary force. Communication theory Vol. 20, 3 (2010), 249--268.","DOI":"10.1111\/j.1468-2885.2010.01362.x","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-12","unstructured":"Benjamin Van Durme. 2012. Streaming analysis of discourse participants. In Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, EMNLP-CoNLL 2012. 48--58."},{"key":"key-10.1145\/3178876.3186157-13","unstructured":"Hoerl Arthur E and Kennard Robert W. 1970. Ridge regression: Biased estimation for nonorthogonal problems. Technometrics Vol. 12, 1 (1970), 55--67.","DOI":"10.1080\/00401706.1970.10488634","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-14","unstructured":"Pedregosa Fabian, Varoquaux Ga&#235;l, Gramfort Alexandre, Michel Vincent, Thirion Bertrand, Grisel Olivier, Blondel Mathieu, Prettenhofer Peter, Weiss Ron, Vincent Dubourg, et almbox.. 2011. Scikit-learn: Machine learning in Python. Journal of Machine Learning Research Vol. 12, Oct (2011), 2825--2830."},{"key":"key-10.1145\/3178876.3186157-15","unstructured":"Lucie Flekova, Jordan Carpenter, Salvatore Giorgi, Lyle H. Ungar, and Daniel Preotiuc-Pietro. 2016. Analyzing biases in human perception of user age and gender from text Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics, ACL 2016."},{"key":"key-10.1145\/3178876.3186157-16","unstructured":"Friedman Jerome H. 2002. Stochastic gradient boosting. Computational Statistics &#38; Data Analysis Vol. 38, 4 (2002), 367--378.","DOI":"10.1016\/S0167-9473(01)00065-2","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-17","unstructured":"Stratis Ioannidis, Andrea Montanari, Udi Weinsberg, Smriti Bhagat, Nadia Fawaz, and Nina Taft. 2014. Privacy tradeoffs in predictive analytics. In ACM SIGMETRICS \/ International Conference on Measurement and Modeling of Computer Systems, SIGMETRICS 2014. 57--69.","DOI":"10.1145\/2591971.2592011","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-18","unstructured":"Briton Nancy J. and Judith A. Hall.. 1995. Beliefs about female and male nonverbal communication. Sex Roles Vol. 32, 1 (1995), 79--90.","DOI":"10.1007\/BF01544758","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-19","unstructured":"Reed Philip J, Spiro Emma S, and Butts Carter T. 2016. Thumbs up for privacy?: Differences in online self-disclosure behavior across national cultures. Social Science Research Vol. 59 (2016), 155--170.","DOI":"10.1016\/j.ssresearch.2016.04.022","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-20","unstructured":"Bernard J. Jansen and Lauren Solomon. 2010. Gender demographic targeting in sponsored search. In Proceedings of the 28th International Conference on Human Factors in Computing Systems, CHI 2010. 831--840.","DOI":"10.1145\/1753326.1753448","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-21","unstructured":"Anders Johannsen, Dirk Hovy, and Anders S&#248;gaard. 2015. Cross-lingual syntactic variation over age and gender Proceedings of the 19th Conference on Computational Natural Language Learning, CoNLL 2015. 103--112."},{"key":"key-10.1145\/3178876.3186157-22","unstructured":"David Jurgens, Yulia Tsvetkov, and Dan Jurafsky. 2017. Writer Profiling Without the Writer's Text. In Social Informatics - 9th International Conference, SocInfo 2017, Proceedings, Part II. 537--558.","DOI":"10.1007\/978-3-319-67256-4_43","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-23","unstructured":"Fariba Karimi, Claudia Wagner, Florian Lemmerich, Mohsen Jadidi, and Markus Strohmaier. 2016. Inferring gender from names on the web: A comparative evaluation of gender detection methods. In Proceedings of the 25th International Conference on World Wide Web, WWW 2016. 53--54.","DOI":"10.1145\/2872518.2889385","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-24","unstructured":"Eugene Kharitonov and Pavel Serdyukov. 2012. Gender-aware re-ranking. In Proceedings of the 35th International ACM SIGIR conference on research and development in Information Retrieval, SIGIR 2012. 1081--1082.","DOI":"10.1145\/2348283.2348479","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-25","unstructured":"Peter Kr&#225;tky and Daniela Chud&#225;. 2016. Estimating gender and age of web page visitors from the way they use their mouse Proceedings of the 25th International Conference on World Wide Web, WWW 2016. 61--62."},{"key":"key-10.1145\/3178876.3186157-26","unstructured":"Breiman Leo. 2001. Random forests. Machine learning Vol. 45, 1 (2001), 5--32.","DOI":"10.1023\/A:1010933404324","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-27","unstructured":"Cheng Li, Yue Lu, Qiaozhu Mei, Dong Wang, and Sandeep Pandey. 2015. Click-through Prediction for Advertising in Twitter Timeline Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD 2015. 1959--1968.","DOI":"10.1145\/2783258.2788582","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-28","unstructured":"Xuan Lu, Wei Ai, Xuanzhe Liu, Qian Li, Ning Wang, Gang Huang, and Qiaozhu Mei. 2016. Learning from the ubiquitous language: An empirical analysis of emoji usage of smartphone users. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, UbiComp 2016. 770--780.","DOI":"10.1145\/2971648.2971724","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-29","unstructured":"LaFrance Marianne and Banaji Mahzarin. 1992. Toward a reconsideration of the gender-emotion relationship. Emotion and Social Behavior Vol. 14 (1992), 178--201."},{"key":"key-10.1145\/3178876.3186157-30","unstructured":"Hannah Miller, Daniel Kluver, Jacob Thebault-Spieker, Loren Terveen, and Brent Hecht. 2017. Understanding emoji ambiguity in context: The role of text in emoji-related miscommunication. In Proceedings of the 11th International Conference on Web and Social Media, ICWSM 2017. 152--161."},{"key":"key-10.1145\/3178876.3186157-31","unstructured":"Hannah Miller, Jacob Thebault-Spieker, Shuo Chang, Isaac L. Johnson, Loren G. Terveen, and Brent Hecht. 2016. &#8220;Blissfully happy\" or &#8220;ready to fight\": Varying interpretations of emoji Proceedings of the 10th International Conference on Web and Social Media, ICWSM 2016. 259--268."},{"key":"key-10.1145\/3178876.3186157-32","unstructured":"Petra Kralj Novak, Jasmina Smailovic, Borut Sluban, and Igor Mozetic. 2015. Sentiment of emojis. PloS One Vol. 10, 12 (2015)."},{"key":"key-10.1145\/3178876.3186157-33","unstructured":"Balswick Jack O and Peek Charles W. 1971. The inexpressive male: A tragedy of American society. Family Coordinator (1971), 363--368.","DOI":"10.2307\/582167","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-34","unstructured":"Jahna Otterbacher, Jo Bates, and Paul D. Clough. 2017. Competent men and warm women: Gender stereotypes and backlash in image search results. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, CHI 2017. 6620--6631.","DOI":"10.1145\/3025453.3025727","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-35","unstructured":"Henning Pohl, Christian Domin, and Michael Rohs. 2017. Beyond just text: semantic emoji similarity modeling to support expressive communication oji549 oji684 oji830. ACM Transactions on Computer-Human Interaction (TOCHI) Vol. 24, 1 (2017), 6:1--6:42.","DOI":"10.1145\/3039685","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-36","unstructured":"Henning Pohl, Dennis Stanke, and Michael Rohs. 2016. EmojiZoom: emoji entry via large overview maps. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2016. 510--517.","DOI":"10.1145\/2935334.2935382","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-37","unstructured":"Daniel Preotiuc-Pietro, Wei Xu, and Lyle H. Ungar. 2016. Discovering user attribute stylistic differences via paraphrasing Proceedings of the Thirtieth AAAI Conference on Artificial Intelligence, AAAI 2016. 3030--3037."},{"key":"key-10.1145\/3178876.3186157-38","unstructured":"Wilkins Richard and Gareis Elisabeth. 2006. Emotion expression and the locution &#8220;I love you&#8221;: A cross-cultural study. International Journal of Intercultural Relations Vol. 30, 1 (2006), 51--75.","DOI":"10.1016\/j.ijintrel.2005.07.003","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-39","unstructured":"Buck Ross, Miller Robert E, and Caul William F. 1974. Sex, personality, and physiological variables in the communication of affect via facial expression. Journal of Personality and Social Psychology Vol. 30, 4 (1974), 587.","DOI":"10.1037\/h0037041","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-40","unstructured":"Buck Ross, Baron Reuben M, Goodman Nancy, and Shapiro Beth. 1980. Unitization of spontaneous nonverbal behavior in the study of emotion communication. Journal of Personality and Social Psychology Vol. 39, 3 (1980), 522--529.","DOI":"10.1037\/0022-3514.39.3.522","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-41","unstructured":"Buck Ross, Baron Reuben, and Barrette Dana. 1982. Temporal organization of spontaneous emotional expression: A segmentation analysis. Journal of Personality and Social Psychology Vol. 42, 3 (1982), 506--517.","DOI":"10.1037\/0022-3514.42.3.506","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-42","unstructured":"Kelly Ryan and Leon Watts. 2015. Characterising the inventive appropriation of emoji as relationally meaningful in mediated close personal relationships. Experiences of Technology Appropriation: Unanticipated Users, Usage, Circumstances, and Design (2015)."},{"key":"key-10.1145\/3178876.3186157-43","unstructured":"Maarten Sap, Gregory J. Park, Johannes C. Eichstaedt, Margaret L. Kern, David Stillwell, Michal Kosinski, Lyle H. Ungar, and H. Andrew Schwartz. 2014. Developing age and gender predictive lexica over social media Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing, EMNLP 2014. 1146--1151."},{"key":"key-10.1145\/3178876.3186157-44","unstructured":"Hwang Ha Sung. 2014. Gender differences in emoticon use on mobile text messaging: evidence from a Korean sample. International Journal of Journalism &#38; Mass Communication Vol. 2014 (2014)."},{"key":"key-10.1145\/3178876.3186157-45","unstructured":"Jian Tang, Meng Qu, Mingzhe Wang, Ming Zhang, Jun Yan, and Qiaozhu Mei. 2015. LINE: Large-scale information network embedding. In Proceedings of the 24th International Conference on World Wide Web, WWW 2015. 1067--1077.","DOI":"10.1145\/2736277.2741093","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-46","unstructured":"Channary Tauch and Eiman Kanjo. 2016. The roles of emojis in mobile phone notifications. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, UbiComp Adjunct 2016. 1560--1565.","DOI":"10.1145\/2968219.2968549","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-47","unstructured":"Hu Tianran, Guo Han, Sun Hao, Nguyen Thuy vy Thi, and Luo Jiebo. 2017. Spice up your chat: The intentions and sentiment effects of using emoji Proceedings of the 11th International Conference on Weblogs and Social Media, ICWSM 2017. 102--111."},{"key":"key-10.1145\/3178876.3186157-48","unstructured":"Chad Tossell, Philip T. Kortum, Clayton Shepard, Laura H. Barg-Walkow, Ahmad Rahmati, and Lin Zhong. 2012. A longitudinal study of emoticon use in text messaging from smartphones. Computers in Human Behavior Vol. 28, 2 (2012), 659--663.","DOI":"10.1016\/j.chb.2011.11.012","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-49","unstructured":"Svitlana Volkova and Yoram Bachrach. 2016. Inferring perceived demographics from user emotional tone and user-environment emotional contrast. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics, ACL 2016.","DOI":"10.18653\/v1\/P16-1148","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-50","unstructured":"Dunnett Charles W. 1955. A multiple comparison procedure for comparing several treatments with a control. J. Amer. Statist. Assoc. Vol. 50, 272 (1955), 1096--1121.","DOI":"10.1080\/01621459.1955.10501294","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186157-51","unstructured":"Tigwell Garreth W and Flatla David R. 2016. Oh that's what you meant!: Reducing emoji misunderstanding Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, MobileHCI Adjunct 2016. ACM, 859--866."},{"key":"key-10.1145\/3178876.3186157-52","unstructured":"Yi-Chia Wang, Moira Burke, and Robert E. Kraut. 2013. Gender, topic, and audience response: an analysis of user-generated content on facebook 2013 ACM SIGCHI Conference on Human Factors in Computing Systems, CHI 2013. 31--34."},{"key":"key-10.1145\/3178876.3186157-53","unstructured":"Church Kenneth Ward and Hanks Patrick. 1990. Word association norms, mutual information, and lexicography. Computational Linguistics Vol. 16, 1 (1990), 22--29."},{"key":"key-10.1145\/3178876.3186157-54","unstructured":"Alecia Wolf. 2000. Emotional expression online: Gender differences in emoticon use. Cyberpsy., Behavior, and Soc. Networking Vol. 3, 5 (2000), 827--833."},{"key":"key-10.1145\/3178876.3186157-55","unstructured":"Quanzeng You, Sumit Bhatia, Tong Sun, and Jiebo Luo. 2014. The eyes of the beholder: Gender prediction using images posted in online social networks 2014 IEEE International Conference on Data Mining Workshops, ICDM Workshops 2014. 1026--1030."},{"key":"key-10.1145\/3178876.3186157-56","unstructured":"Faiyaz Al Zamal, Wendy Liu, and Derek Ruths. 2012. Homophily and latent attribute inference: Inferring latent attributes of Twitter users from neighbors. In Proceedings of the Sixth International Conference on Weblogs and Social Media, ICWSM 2012."},{"key":"key-10.1145\/3178876.3186157-57","unstructured":"Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye text, hello emoji: Mobile communication on WeChat in China Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, CHI 2017.","DOI":"10.1145\/3025453.3025800","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186157&ftid=1957528&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:55:24Z","timestamp":1523638524000},"score":1.0,"subtitle":["Learning Usage Patterns of Emojis from Large-Scale Android Users"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":57,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186157","relation":{"cites":[]}}}