{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:24Z","timestamp":1525103724324},"publisher-location":"New York, New York, USA","reference-count":37,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191539","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Multi-turn QA"],"prefix":"10.1145","author":[{"given":"Martino","family":"Mensio","sequence":"first","affiliation":[{"name":"Politecnico di Torino, Torino, Italy"}]},{"given":"Giuseppe","family":"Rizzo","sequence":"additional","affiliation":[{"name":"Istituto Superiore Mario Boella, Torino, Italy"}]},{"given":"Maurizio","family":"Morisio","sequence":"additional","affiliation":[{"name":"Politecnico di Torino, Torino, Italy"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191539-1","unstructured":"Abdalghani Abujabal, Mohamed Yahya, Mirek Riedewald, and Gerhard Weikum. 2017. Automated template generation for question answering over knowledge graphs Proceedings of the 26th international conference on world wide web. International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 1191--1200."},{"key":"key-10.1145\/3184558.3191539-2","unstructured":"James F Allen, Donna K Byron, Myroslava Dzikovska, George Ferguson, Lucian Galescu, and Amanda Stent. 2001. Toward conversational human-computer interaction. AI magazine Vol. 22, 4 (2001), 27."},{"key":"key-10.1145\/3184558.3191539-3","unstructured":"Layla El Asri, Hannes Schulz, Shikhar Sharma, Jeremie Zumer, Justin Harris, Emery Fine, Rahul Mehrotra, and Kaheer Suleman. 2017. Frames: A corpus for adding memory to goal-oriented dialogue systems Proceedings of the SIGDIAL 2017 Conference. Association for Computational Linguistics, Saarbr&#252;cken, Germany, 207--219."},{"key":"key-10.1145\/3184558.3191539-4","unstructured":"Jonathan Berant, Andrew Chou, Roy Frostig, and Percy Liang. 2013. Semantic parsing on freebase from question-answer pairs Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing. 1533--1544."},{"key":"key-10.1145\/3184558.3191539-5","unstructured":"Aditya Bhargava, Asli Celikyilmaz, Dilek Hakkani-T&#252;r, and Ruhi Sarikaya. 2013. Easy contextual intent prediction and slot detection 2013 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 8337--8341."},{"key":"key-10.1145\/3184558.3191539-6","unstructured":"Kurt Bollacker, Colin Evans, Praveen Paritosh, Tim Sturge, and Jamie Taylor. 2008. Freebase: a collaboratively created graph database for structuring human knowledge Proceedings of the 2008 ACM SIGMOD international conference on Management of data. ACM, 1247--1250.","DOI":"10.1145\/1376616.1376746","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-7","unstructured":"Antoine Bordes and Jason Weston. 2017. Learning end-to-end goal-oriented dialog. the International Conference on Learning Representations (ICLR) (2017)."},{"key":"key-10.1145\/3184558.3191539-8","unstructured":"Christian Buck, Kenneth Heafield, and Bas van Ooyen. 2014. N-gram Counts and Language Models from the Common Crawl Proceedings of the Language Resources and Evaluation Conference (LREC), Vol. Vol. 2. Citeseer, Reykjavik, Iceland, 4."},{"key":"key-10.1145\/3184558.3191539-9","unstructured":"Po-Chun Chen, Ta-Chung Chi, Shang-Yu Su, and Yun-Nung Chen. 2017. Dynamic Time-Aware Attention to Speaker Roles and Contexts for Spoken Language Understanding. The 2017 IEEE Automatic Speech Recognition and Understanding Workshop (2017)."},{"key":"key-10.1145\/3184558.3191539-10","unstructured":"Yun-Nung Chen, Dilek Hakkani-T&#252;r, Gokhan Tur, Jianfeng Gao, and Li Deng. 2016. End-to-End Memory Networks with Knowledge Carryover for Multi-Turn Spoken Language Understanding. Interspeech (2016), 3245--3249."},{"key":"key-10.1145\/3184558.3191539-11","unstructured":"Kyunghyun Cho, Bart Van Merri&#235;nboer, Caglar Gulcehre, Dzmitry Bahdanau, Fethi Bougares, Holger Schwenk, and Yoshua Bengio. 2014. Learning phrase representations using RNN encoder-decoder for statistical machine translation. (October. 2014), 1724--1734. deftempurl%http:\/\/www.aclweb.org\/anthology\/D14--1179 tempurl"},{"key":"key-10.1145\/3184558.3191539-12","unstructured":"Jeffrey L Elman. 1990. Finding structure in time. Cognitive science Vol. 14, 2 (1990), 179--211."},{"key":"key-10.1145\/3184558.3191539-13","unstructured":"Mihail Eric and Christopher D Manning. 2017. Key-Value Retrieval Networks for Task-Oriented Dialogue Proceedings of the 18th Annual SIGdial Meeting on Discourse and Dialogue. Association for Computational Linguistics, Saarbr&#252;cken, Germany, 37--49."},{"key":"key-10.1145\/3184558.3191539-14","unstructured":"Anthony Fader, Luke Zettlemoyer, and Oren Etzioni. 2014. Open question answering over curated and extracted knowledge bases Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1156--1165."},{"key":"key-10.1145\/3184558.3191539-15","unstructured":"Barbara J Grosz, Scott Weinstein, and Aravind K Joshi. 1995. Centering: A framework for modeling the local coherence of discourse. Computational linguistics Vol. 21, 2 (1995), 203--225."},{"key":"key-10.1145\/3184558.3191539-16","unstructured":"Sanda M Harabagiu, Dan I Moldovan, Marius Pasca, Mihai Surdeanu, Rada Mihalcea, Roxana Girju, Vasile Rus, V Finley Lacatusu, Paul Morarescu, and Razvan C Bunescu. 2001. Answering Complex, List and Context Questions with LCC's Question-Answering Server. TREC."},{"key":"key-10.1145\/3184558.3191539-17","unstructured":"Charles T Hemphill, John J Godfrey, and George R Doddington. 1990. The ATIS spoken language systems pilot corpus. In Speech and Natural Language: Proceedings of a Workshop Held at Hidden Valley, Pennsylvania, June 24--27, 1990."},{"key":"key-10.1145\/3184558.3191539-18","unstructured":"Sepp Hochreiter and J&#252;rgen Schmidhuber. 1997. Long short-term memory. Neural computation Vol. 9, 8 (1997), 1735--1780.","DOI":"10.1162\/neco.1997.9.8.1735","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-19","unstructured":"Brendan Juba and Madhu Sudan. 2008. Universal semantic communication ii: A theory of goal-oriented communication Electronic Colloquium on Computational Complexity (ECCC), Vol. Vol. 15."},{"key":"key-10.1145\/3184558.3191539-20","unstructured":"John Lafferty, Andrew McCallum, and Fernando CN Pereira. 2001. Conditional random fields: Probabilistic models for segmenting and labeling sequence data. (2001)."},{"key":"key-10.1145\/3184558.3191539-21","unstructured":"Bing Liu and Ian Lane. 2016. Attention-Based Recurrent Neural Network Models for Joint Intent Detection and Slot Filling. Interspeech (2016), 685--689."},{"key":"key-10.1145\/3184558.3191539-22","unstructured":"Denis Lukovnikov, Asja Fischer, Jens Lehmann, and S&#246;ren Auer. 2017. Neural network-based question answering over knowledge graphs on word and character level. In Proceedings of the 26th international conference on World Wide Web. International World Wide Web Conferences Steering Committee, 1211--1220.","DOI":"10.1145\/3038912.3052675","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-23","unstructured":"Gr&#233;goire Mesnil, Xiaodong He, Li Deng, and Yoshua Bengio. 2013. Investigation of recurrent-neural-network architectures and learning methods for spoken language understanding. In Interspeech. 3771--3775."},{"key":"key-10.1145\/3184558.3191539-24","unstructured":"Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532--1543.","DOI":"10.3115\/v1\/D14-1162","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-25","unstructured":"Yangyang Shi, Kaisheng Yao, Hu Chen, Yi-Cheng Pan, Mei-Yuh Hwang, and Baolin Peng. 2015. Contextual spoken language understanding using recurrent neural networks 2015 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 5271--5275."},{"key":"key-10.1145\/3184558.3191539-26","unstructured":"Robert F Simmons. 1970. Natural language question-answering systems: 1969. Commun. ACM Vol. 13, 1 (1970), 15--30.","DOI":"10.1145\/361953.361963","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-27","unstructured":"Alessandro Sordoni, Yoshua Bengio, Hossein Vahabi, Christina Lioma, Jakob Grue Simonsen, and Jian-Yun Nie. 2015. A hierarchical recurrent encoder-decoder for generative context-aware query suggestion. In Proceedings of the 24th ACM International on Conference on Information and Knowledge Management. ACM, 553--562.","DOI":"10.1145\/2806416.2806493","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-28","unstructured":"Sainbayar Sukhbaatar, Jason Weston, Rob Fergus, et al. 2015. End-to-end memory networks. In Advances in neural information processing systems. 2440--2448."},{"key":"key-10.1145\/3184558.3191539-29","unstructured":"Mingyu Sun and Joyce Y Chai. 2007. Discourse processing for context question answering based on linguistic knowledge. Knowledge-Based Systems Vol. 20, 6 (2007), 511--526.","DOI":"10.1016\/j.knosys.2007.04.005","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-30","unstructured":"Valentin Tablan, Danica Damljanovic, and Kalina Bontcheva. 2008. A natural language query interface to structured information European Semantic Web Conference. Springer, 361--375."},{"key":"key-10.1145\/3184558.3191539-31","unstructured":"Stefanie Tellex, Boris Katz, Jimmy Lin, Aaron Fernandes, and Gregory Marton. 2003. Quantitative evaluation of passage retrieval algorithms for question answering Proceedings of the 26th annual international ACM SIGIR conference on Research and development in informaion retrieval. ACM, 41--47."},{"key":"key-10.1145\/3184558.3191539-32","unstructured":"Alan M Turing. 1950. Computing machinery and intelligence. Mind Vol. 59, 236 (1950), 433--460."},{"key":"key-10.1145\/3184558.3191539-33","unstructured":"Denny Vrandevci&#263; and Markus Kr&#246;tzsch. 2014. Wikidata: a free collaborative knowledgebase. Commun. ACM Vol. 57, 10 (2014), 78--85.","DOI":"10.1145\/2629489","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-34","unstructured":"Courtney Wade and James Allan. 2005. Passage retrieval and evaluation. Technical Report. University of Massachusetts, Amherst Center for Intelligent Information Retrieval.","DOI":"10.21236\/ADA477634","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-35","unstructured":"Joseph Weizenbaum. 1966. ELIZA - a computer program for the study of natural language communication between man and machine. Commun. ACM Vol. 9, 1 (1966), 36--45.","DOI":"10.1145\/365153.365168","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191539-36","unstructured":"Jason Williams, Antoine Raux, Deepak Ramachandran, and Alan Black. 2013. The dialog state tracking challenge. In Proceedings of the SIGDIAL 2013 Conference. 404--413."},{"key":"key-10.1145\/3184558.3191539-37","unstructured":"Puyang Xu and Ruhi Sarikaya. 2014. Contextual domain classification in spoken language understanding systems using recurrent neural network. In 2014 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 136--140.","DOI":"10.1109\/ICASSP.2014.6853573","doi-asserted-by":"crossref"}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191539&ftid=1958280&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T20:09:27Z","timestamp":1524082167000},"score":1.0,"subtitle":["A RNN Contextual Approach to Intent Classification for Goal-oriented Systems"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":37,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191539","relation":{"cites":[]}}}