{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:27Z","timestamp":1523998767671},"publisher-location":"New York, New York, USA","reference-count":47,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"funder":[{"name":"National Science Foundation","award":["IIS-165231","RI-1718478"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186056","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Arrays of (locality-sensitive) Count Estimators (ACE)"],"prefix":"10.1145","author":[{"given":"Chen","family":"Luo","sequence":"first","affiliation":[{"name":"Rice University, Houston, TX, USA"}]},{"given":"Anshumali","family":"Shrivastava","sequence":"additional","affiliation":[{"name":"Rice University, Houston, TX, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186056-1","unstructured":"Elke Achtert, Thomas Bernecker, Hans-Peter Kriegel, Erich Schubert, and Arthur Zimek. 2009. ELKI in Time: ELKI 0.2 for the Performance Evaluation of Distance Measures for Time Series. In Advances in Spatial and Temporal Databases, 11th International Symposium, SSTD 2009, Aalborg, Denmark, July 8--10, 2009, Proceedings. 436--440."},{"key":"key-10.1145\/3178876.3186056-2","unstructured":"Charu C Aggarwal and Philip S Yu. 2001. Outlier detection for high dimensional data. In ACM Sigmod Record, Vol. 30. ACM, 37--46."},{"key":"key-10.1145\/3178876.3186056-3","unstructured":"Nir Ailon and Bernard Chazelle. 2006. Approximate nearest neighbors and the fast Johnson-Lindenstrauss transform. In Proceedings of the thirty-eighth annual ACM symposium on Theory of computing. ACM, 557--563.","DOI":"10.1145\/1132516.1132597","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-4","unstructured":"Fabrizio Angiulli and Clara Pizzuti. 2005. Outlier mining in large highdimensional data sets. IEEE transactions on Knowledge and Data engineering 17, 2 (2005), 203--215.","DOI":"10.1109\/TKDE.2005.31","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-5","unstructured":"Kanishka Bhaduri, Mark D Stefanski, and Ashok N Srivastava. 2011. Privacypreserving outlier detection through random nonlinear data distortion. IEEE Transactions on Systems, Man, and Cybernetics, Part B (Cybernetics) 41, 1 (2011), 260--272.","DOI":"10.1109\/TSMCB.2010.2051540","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-6","unstructured":"Markus M Breunig, Hans-Peter Kriegel, Raymond T Ng, and J&#246;rg Sander. 2000. LOF: identifying density-based local outliers. In ACM sigmod record, Vol. 29. ACM, 93--104.","DOI":"10.1145\/342009.335388","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-7","unstructured":"Martin Burkhart, Mario Strasser, Dilip Many, and Xenofontas Dimitropoulos. 2010. SEPIA: Privacy-preserving aggregation of multi-domain network events and statistics. Network 1, 101101 (2010)."},{"key":"key-10.1145\/3178876.3186056-8","unstructured":"Aniket Chakrabarti, Venu Satuluri, Atreya Srivathsan, and Srinivasan Parthasarathy. 2015. A bayesian perspective on locality sensitive hashing with extensions for kernel methods. ACM Transactions on Knowledge Discovery from Data (TKDD) 10, 2 (2015), 19."},{"key":"key-10.1145\/3178876.3186056-9","unstructured":"Varun Chandola, Arindam Banerjee, and Vipin Kumar. 2009. Anomaly detection: A survey. ACM computing surveys (CSUR) 41, 3 (2009), 15.","DOI":"10.1145\/1541880.1541882","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-10","unstructured":"Moses Charikar and Paris Siminelakis. [n. d.]. Hashing-based-estimators for kernel density in high dimensions."},{"key":"key-10.1145\/3178876.3186056-11","unstructured":"Moses S Charikar. 2002. Similarity estimation techniques from rounding algorithms. In Proceedings of the thiry-fourth annual ACM symposium on Theory of computing. ACM, 380--388."},{"key":"key-10.1145\/3178876.3186056-12","unstructured":"Beidi Chen, Anshumali Shrivastava, and Rebecca C Steorts. 2017. Unique Entity Estimation with Application to the Syrian Conflict. arXiv preprint arXiv:1710.02690 (2017)."},{"key":"key-10.1145\/3178876.3186056-13","unstructured":"Beidi Chen, Yingchen Xu, and Anshumali Shrivastava. 2018. LSH-SAMPLING BREAKS THE COMPUTATIONAL CHICKEN-AND-EGG LOOP IN ADAPTIVE STOCHASTIC GRADIENT ESTIMATION. (2018). https:\/\/openreview.net\/forum?id=SyVOjfbRb"},{"key":"key-10.1145\/3178876.3186056-14","unstructured":"Cisco Visual Networking Index Cisco. 2014. Global mobile data traffic forecast update, 2013--2018. white paper (2014)."},{"key":"key-10.1145\/3178876.3186056-15","unstructured":"Anirban Dasgupta, Ravi Kumar, and Tam&#225;s Sarl&#243;s. 2011. Fast locality-sensitive hashing. In Proceedings of the 17th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1073--1081.","DOI":"10.1145\/2020408.2020578","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-16","unstructured":"Jan-Mark Geusebroek, Gertjan J Burghouts, and Arnold WM Smeulders. 2005. The Amsterdam library of object images. International Journal of Computer Vision 61, 1 (2005), 103--112.","DOI":"10.1023\/B:VISI.0000042993.50813.60","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-17","unstructured":"Aristides Gionis, Piotr Indyk, Rajeev Motwani, et al. 1999. Similarity search in high dimensions via hashing. In VLDB, Vol. 99. 518--529."},{"key":"key-10.1145\/3178876.3186056-18","unstructured":"Michel X Goemans and David P Williamson. 1994. .879-approximation algorithms for max cut and max 2sat. In Proceedings of the twenty-sixth annual ACM symposium on Theory of computing. ACM, 422--431."},{"key":"key-10.1145\/3178876.3186056-19","unstructured":"Oded Goldreich. 1998. Secure multi-party computation. Manuscript. Preliminary version (1998), 86--97."},{"key":"key-10.1145\/3178876.3186056-20","unstructured":"Nico G&#246;rnitz, Marius Micha Kloft, Konrad Rieck, and Ulf Brefeld. 2013. Toward supervised anomaly detection. Journal of Artificial Intelligence Research (2013)."},{"key":"key-10.1145\/3178876.3186056-21","unstructured":"Ville Hautamaki, Ismo Karkkainen, and Pasi Franti. 2004. Outlier detection using k-nearest neighbour graph. In Pattern Recognition, 2004. ICPR 2004. Proceedings of the 17th International Conference on, Vol. 3. IEEE, 430--433.","DOI":"10.1109\/ICPR.2004.1334558","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-22","unstructured":"Piotr Indyk and Rajeev Motwani. 1998. Approximate nearest neighbors: towards removing the curse of dimensionality. In Proceedings of the thirtieth annual ACM symposium on Theory of computing. ACM, 604--613.","DOI":"10.1145\/276698.276876","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-23","unstructured":"Wen Jin, Anthony KH Tung, Jiawei Han, and Wei Wang. 2006. Ranking outliers using symmetric neighborhood relationship. In Pacific-Asia Conference on Knowledge Discovery and Data Mining. Springer, 577--593.","DOI":"10.1007\/11731139_68","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-24","unstructured":"Krishnaram Kenthapadi, Aleksandra Korolova, Ilya Mironov, and Nina Mishra. 2012. Privacy via the johnson-lindenstrauss transform. arXiv preprint arXiv:1204.2606 (2012)."},{"key":"key-10.1145\/3178876.3186056-25","unstructured":"Jon Kleinberg. 2002. Bursty and hierarchical structure in streams. In Proceedings of the eighth ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 91--101.","DOI":"10.1145\/775047.775061","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-26","unstructured":"Hans-Peter Kriegel, Peer Kr&#246;ger, Erich Schubert, and Arthur Zimek. 2009. LoOP: local outlier probabilities. In Proceedings of the 18th ACM conference on Information and knowledge management. ACM, 1649--1652.","DOI":"10.1145\/1645953.1646195","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-27","unstructured":"Longin Jan Latecki, Aleksandar Lazarevic, and Dragoljub Pokrajac. 2007. Outlier detection with kernel density functions. In International Workshop on Machine Learning and Data Mining in Pattern Recognition. Springer, 61--75.","DOI":"10.1007\/978-3-540-73499-4_6","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-28","unstructured":"Kingsly Leung and Christopher Leckie. 2005. Unsupervised anomaly detection in network intrusion detection using clusters. In Proceedings of the Twenty-eighth Australasian conference on Computer Science-Volume 38. Australian Computer Society, Inc., 333--342."},{"key":"key-10.1145\/3178876.3186056-29","unstructured":"Chen Luo, Jian-Guang Lou, Qingwei Lin, Qiang Fu, Rui Ding, Dongmei Zhang, and Zhe Wang. 2014. Correlating events with time series for incident diagnosis. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1583--1592.","DOI":"10.1145\/2623330.2623374","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-30","unstructured":"Chen Luo and Anshumali Shrivastava. 2017. SSH (Sketch, Shingle, &#38; Hash) for Indexing Massive-Scale Time Series. In NIPS 2016 Time Series Workshop. 38--58."},{"key":"key-10.1145\/3178876.3186056-31","unstructured":"Ashwin Machanavajjhala, Daniel Kifer, John Abowd, Johannes Gehrke, and Lars Vilhuber. 2008. Privacy: Theory meets practice on the map. In Data Engineering, 2008. ICDE 2008. IEEE 24th International Conference on. IEEE, 277--286."},{"key":"key-10.1145\/3178876.3186056-32","unstructured":"Ninh Pham and Rasmus Pagh. 2012. A near-linear time approximation algorithm for angle-based outlier detection in high-dimensional data. In Proceedings of the 18th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 877--885.","DOI":"10.1145\/2339530.2339669","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-33","unstructured":"Sridhar Ramaswamy, Rajeev Rastogi, and Kyuseok Shim. 2000. Efficient algorithms for mining outliers from large data sets. In ACM Sigmod Record, Vol. 29. ACM, 427--438.","DOI":"10.1145\/342009.335437","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-34","unstructured":"Erich Schubert, Alexander Koos, Tobias Emrich, Andreas Z&#252;fle, Klaus Arthur Schmid, and Arthur Zimek. 2015. A framework for clustering uncertain data. Proceedings of the VLDB Endowment 8, 12 (2015), 1976--1979.","DOI":"10.14778\/2824032.2824115","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-35","unstructured":"Erich Schubert, Remigius Wojdanowski, Arthur Zimek, and Hans-Peter Kriegel. 2012. On evaluation of outlier rankings and outlier scores. In Proceedings of the 2012 SIAM International Conference on Data Mining. SIAM, 1047--1058.","DOI":"10.1137\/1.9781611972825.90","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-36","unstructured":"Erich Schubert, Arthur Zimek, and Hans-Peter Kriegel. 2014. Generalized outlier detection with flexible kernel density estimates. In Proceedings of the 2014 SIAM International Conference on Data Mining. SIAM, 542--550.","DOI":"10.1137\/1.9781611973440.63","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-37","unstructured":"Anshumali Shrivastava. 2016. Simple and efficient weighted minwise hashing. In Advances in Neural Information Processing Systems. 1498--1506."},{"key":"key-10.1145\/3178876.3186056-38","unstructured":"Anshumali Shrivastava. 2017. Optimal Densification for Fast and Accurate Minwise Hashing.. In ICML."},{"key":"key-10.1145\/3178876.3186056-39","unstructured":"Anshumali Shrivastava and Ping Li. 2014. Densifying One Permutation Hashing via Rotation for Fast Near Neighbor Search.. In ICML. 557--565."},{"key":"key-10.1145\/3178876.3186056-40","unstructured":"Anshumali Shrivastava and Ping Li. 2014. Improved Densification of One Permutation Hashing.. In UAI."},{"key":"key-10.1145\/3178876.3186056-41","unstructured":"Ryan Spring and Anshumali Shrivastava. 2017. A New Unbiased and Efficient Class of LSH-Based Samplers and Estimators for Partition Function Computation in Log-Linear Models. ArXiv e-prints (2017). arXiv:1703.05160"},{"key":"key-10.1145\/3178876.3186056-42","unstructured":"Ryan Spring and Anshumali Shrivastava. 2017. Scalable and sustainable deep learning via randomized hashing. In KDD.","DOI":"10.1145\/3097983.3098035","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-43","unstructured":"Jian Tang, Zhixiang Chen, Ada Wai-Chee Fu, and David W Cheung. 2002. Enhancing effectiveness of outlier detections for low density patterns. In Pacific-Asia Conference on Knowledge Discovery and Data Mining. Springer, 535--548.","DOI":"10.1007\/3-540-47887-6_53","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-44","unstructured":"Luan Tran, Liyue Fan, and Cyrus Shahabi. 2016. Distance-based outlier detection in data streams. Proceedings of the VLDB Endowment 9, 12 (2016), 1089--1100.","DOI":"10.14778\/2994509.2994526","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-45","unstructured":"Jaideep Vaidya and Chris Clifton. 2004. Privacy-preserving outlier detection. In Data Mining, 2004. ICDM'04. Fourth IEEE International Conference on. IEEE, 233--240.","DOI":"10.1109\/ICDM.2004.10081","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186056-46","unstructured":"Xindong Wu, Vipin Kumar, J Ross Quinlan, Joydeep Ghosh, Qiang Yang, Hiroshi Motoda, Geoffrey J McLachlan, Angus Ng, Bing Liu, S Yu Philip, et al. 2008. Top 10 algorithms in data mining. Knowledge and information systems 14, 1 (2008), 1--37."},{"key":"key-10.1145\/3178876.3186056-47","unstructured":"Ke Zhang, Marcus Hutter, and Huidong Jin. 2009. A new local distance-based outlier detection approach for scattered real-world data. Advances in knowledge discovery and data mining (2009), 813--822."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186056&ftid=1957417&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:52:26Z","timestamp":1523641946000},"score":1.0,"subtitle":["Anomaly Detection on the Edge"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":47,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186056","relation":{"cites":[]}}}