{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:25Z","timestamp":1525103725013},"publisher-location":"New York, New York, USA","reference-count":40,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"Data to Decisions CRC Australia","award":[]},{"name":"ARC Centre of Excellence for Mathematical and Statistical Frontiers (ACEMS) Australia","award":[]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191574","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Real-time Detection of Content Polluters in Partially Observable Twitter Networks"],"prefix":"10.1145","author":[{"given":"Mehwish","family":"Nasim","sequence":"first","affiliation":[{"name":"University of Adelaide, Adelaide, Australia"}]},{"given":"Andrew","family":"Nguyen","sequence":"additional","affiliation":[{"name":"University of Adelaide, Adelaide, Australia"}]},{"given":"Nick","family":"Lothian","sequence":"additional","affiliation":[{"name":"Tyto.ai, Adelaide, Australia"}]},{"given":"Robert","family":"Cope","sequence":"additional","affiliation":[{"name":"University of Adelaide, Adelaide, Australia"}]},{"given":"Lewis","family":"Mitchell","sequence":"additional","affiliation":[{"name":"University of Adelaide, Adelaide, Australia"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191574-1","unstructured":"Marco T Bastos and Dan Mercea. 2017. The Brexit Botnet and User-Generated Hyperpartisan News. Social Science Computer Review (2017), 0894439317734157."},{"key":"key-10.1145\/3184558.3191574-2","unstructured":"Frank Bentley and Ying-Yu Chen. 2015. The Composition and Use of Modern Mobile Phonebooks Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2749--2758."},{"key":"key-10.1145\/3184558.3191574-3","unstructured":"Ofer Bergman, Andreas Komninos, Dimitrios Liarokapis, and James Clarke. 2012. You never call: Demoting unused contacts on mobile phones using DMTR. Personal and Ubiquitous Computing Vol. 16, 6 (2012), 757--766.","DOI":"10.1007\/s00779-011-0411-3","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-4","unstructured":"Alessandro Bessi and Emilio Ferrara. 2016. Social bots distort the 2016 US Presidential election online discussion. (2016)."},{"key":"key-10.1145\/3184558.3191574-5","unstructured":"Vincent D Blondel, Jean-Loup Guillaume, Renaud Lambiotte, and Etienne Lefebvre. 2008. Fast unfolding of communities in large networks. Journal of statistical mechanics: theory and experiment Vol. 2008, 10 (2008), P10008."},{"key":"key-10.1145\/3184558.3191574-6","unstructured":"Yazan Boshmaf, Ildar Muslukhov, Konstantin Beznosov, and Matei Ripeanu. 2011. The socialbot network: when bots socialize for fame and money Proceedings of the 27th annual computer security applications conference. ACM, 93--102.","DOI":"10.1145\/2076732.2076746","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-7","unstructured":"Qiang Cao, Michael Sirivianos, Xiaowei Yang, and Tiago Pregueiro. 2012. Aiding the detection of fake accounts in large scale social online services Proceedings of the 9th USENIX conference on Networked Systems Design and Implementation. USENIX Association, 15--15."},{"key":"key-10.1145\/3184558.3191574-8","unstructured":"Monica Chin. 2017. Report: Twitter deleted tweets related to the Russian investigation. (2017). deftempurl%http:\/\/mashable.com\/2017\/10\/13\/twitter-deleted-russian-tweets\/#CIbGh7BglkqS tempurl"},{"key":"key-10.1145\/3184558.3191574-9","unstructured":"Stefano Cresci, Roberto Di Pietro, Marinella Petrocchi, Angelo Spognardi, and Maurizio Tesconi. 2017. The paradigm-shift of social spambots: Evidence, theories, and tools for the arms race. In Proceedings of the 26th International Conference on World Wide Web Companion. International World Wide Web Conferences Steering Committee, 963--972.","DOI":"10.1145\/3041021.3055135","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-10","unstructured":"Clayton Allen Davis, Onur Varol, Emilio Ferrara, Alessandro Flammini, and Filippo Menczer. 2016. BotOrNot: A system to evaluate social bots. In Proceedings of the 25th International Conference Companion on World Wide Web. International World Wide Web Conferences Steering Committee, 273--274.","DOI":"10.1145\/2872518.2889302","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-11","unstructured":"John P Dickerson, Vadim Kagan, and VS Subrahmanian. 2014. Using sentiment to detect bots on Twitter: Are humans more opinionated than bots Advances in Social Networks Analysis and Mining (ASONAM), 2014 IEEE\/ACM International Conference on. IEEE, 620--627."},{"key":"key-10.1145\/3184558.3191574-12","unstructured":"Andy Doyle, Graham Katz, Kristen Summers, Chris Ackermann, Ilya Zavorin, Zunsik Lim, Sathappan Muthiah, Patrick Butler, Nathan Self, Liang Zhao, et almbox. 2014. Forecasting significant societal events using the Embers streaming predictive analytics system. Big data Vol. 2, 4 (2014), 185--195."},{"key":"key-10.1145\/3184558.3191574-13","unstructured":"Emilio Ferrara. 2017. Disinformation and social bot operations in the run up to the 2017 French presidential election. (2017)."},{"key":"key-10.1145\/3184558.3191574-14","unstructured":"Emilio Ferrara, Onur Varol, Clayton Davis, Filippo Menczer, and Alessandro Flammini. 2016. The rise of social bots. Commun. ACM Vol. 59, 7 (2016), 96--104.","DOI":"10.1145\/2818717","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-15","unstructured":"Vlad Howard Philip N. Gallacher, John D. Barash and John Kelly . [n. d.]. Junk News on Military Affairs and National Security: Social Media Disinformation Campaigns Against US Military Personnel and Veterans. (. [n. d.]). deftempurl%http:\/\/comprop.oii.ox.ac.uk\/publishing\/working-papers\/vetops\/ tempurl"},{"key":"key-10.1145\/3184558.3191574-16","unstructured":"Saptarshi Ghosh, Bimal Viswanath, Farshad Kooti, Naveen Kumar Sharma, Gautam Korlam, Fabricio Benevenuto, Niloy Ganguly, and Krishna Phani Gummadi. 2012. Understanding and combating link farming in the twitter social network Proceedings of the 21st international conference on World Wide Web. ACM, 61--70."},{"key":"key-10.1145\/3184558.3191574-17","unstructured":"Zafar Gilani, Reza Farahbakhsh, Gareth Tyson, Liang Wang, and Jon Crowcroft. 2017 a. Of Bots and Humans (on Twitter). In Proceedings of the 9th IEEE\/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM'17). https:\/\/doi. org\/10.1145\/3110025.3110090."},{"key":"key-10.1145\/3184558.3191574-18","unstructured":"Zafar Gilani, Ekaterina Kochmar, and Jon Crowcroft. 2017 b. Classification of Twitter Accounts into Automated Agents and Human Users Proceedings of the international conference on Advances in Social Network Analysis and Mining ASONAM."},{"key":"key-10.1145\/3184558.3191574-19","unstructured":"Jin Seop Han and Byung Joon Park. 2013. Efficient detection of content polluters in social networks. In IT Convergence and Security 2012. Springer, 991--996.","DOI":"10.1007\/978-94-007-5860-5_119","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-20","unstructured":"Xia Hu, Jiliang Tang, and Huan Liu. 2014. Online Social Spammer Detection. In AAAI. 59--65."},{"key":"key-10.1145\/3184558.3191574-21","unstructured":"Imrul Kayes and Adriana Iamnitchi. 2017. Privacy and security in online social networks: A survey. Online Social Networks and Media Vol. 3 (2017), 1--21.","DOI":"10.1016\/j.osnem.2017.09.001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-22","unstructured":"Franziska B Keller, David Schoch, Sebastian Stier, and JungHwan Yang. 2017. How to Manipulate Social Media: Analyzing Political Astroturfing Using Ground Truth Data from South Korea. In ICWSM. 564--567."},{"key":"key-10.1145\/3184558.3191574-23","unstructured":"Kyumin Lee, Brian David Eoff, and James Caverlee. 2011. Seven Months with the Devils: A Long-Term Study of Content Polluters on Twitter. ICWSM."},{"key":"key-10.1145\/3184558.3191574-24","unstructured":"Kyumin Lee, Jalal Mahmud, Jilin Chen, Michelle Zhou, and Jeffrey Nichols. 2014. Who will retweet this: Automatically identifying and engaging strangers on twitter to spread information. In Proceedings of the 19th international conference on Intelligent User Interfaces. ACM, 247--256.","DOI":"10.1145\/2557500.2557502","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-25","unstructured":"Sathappan Muthiah, Bert Huang, Jaime Arredondo, David Mares, Lise Getoor, Graham Katz, and Naren Ramakrishnan. 2015. Planned Protest Modeling in News and Social Media. AAAI. 3920--3927."},{"key":"key-10.1145\/3184558.3191574-26","unstructured":"Mehwish Nasim, Rapha&#235;l Charbey, Christophe Prieur, and Ulrik Brandes. 2016 a. Investigating Link Inference in Partially Observable Networks: Friendship Ties and Interaction. IEEE Transactions on Computational Social Systems Vol. 3, 3 (2016), 113--119.","DOI":"10.1109\/TCSS.2016.2618998","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-27","unstructured":"Mehwish Nasim, Aimal Rextin, Numair Khan, and Muhammad Muddassir Malik. 2016 b. Understanding Call Logs of Smartphone Users for Making Future Calls 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM."},{"key":"key-10.1145\/3184558.3191574-28","unstructured":"Arlind Nocaj, Mark Ortmann, and Ulrik Brandes. 2014. Untangling hairballs: From 3 to 14 degrees of separation 22nd International Symposium, Graph Drawing 2014. 101--112.","DOI":"10.1007\/978-3-662-45803-7_9","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-29","unstructured":"Grant Osborne, Nick Lothian, Grant Neale, Terry Moscou, Andrew Nguyen, Jie Chen, Wei Kang, and Brenton Cooper. 2017. The beat the news system: Forecasting social disruption via modelling of online behaviours. Journal of the Australian Institute of Professional Intelligence Officers (2017)."},{"key":"key-10.1145\/3184558.3191574-30","unstructured":"Naren Ramakrishnan, Patrick Butler, Sathappan Muthiah, Nathan Self, Rupinder Khandpur, Parang Saraf, Wei Wang, Jose Cadena, Anil Vullikanti, Gizem Korkmaz, et almbox. 2014. 'Beating the news' with EMBERS: forecasting civil unrest using open source indicators. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1799--1808.","DOI":"10.1145\/2623330.2623373","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-31","unstructured":"Kenneth T Rosen and Mitchel Resnick. 1980. The size distribution of cities: an examination of the Pareto law and primacy. Journal of Urban Economics Vol. 8, 2 (1980), 165--186.","DOI":"10.1016\/0094-1190(80)90043-1","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-32","unstructured":"Parang Saraf and Naren Ramakrishnan. 2016. EMBERS autogsr: Automated coding of civil unrest events Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 599--608.","DOI":"10.1145\/2939672.2939737","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-33","unstructured":"Pablo Su&#225;rez-Serrato, Margaret E Roberts, Clayton Davis, and Filippo Menczer. 2016. On the influence of social bots in online protests International Conference on Social Informatics. Springer, 269--278."},{"key":"key-10.1145\/3184558.3191574-34","unstructured":"VS Subrahmanian, Amos Azaria, Skylar Durst, Vadim Kagan, Aram Galstyan, Kristina Lerman, Linhong Zhu, Emilio Ferrara, Alessandro Flammini, and Filippo Menczer. 2016. The DARPA Twitter bot challenge. Computer Vol. 49, 6 (2016), 38--46.","DOI":"10.1109\/MC.2016.183","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-35","unstructured":"Onur Varol, Emilio Ferrara, Clayton A Davis, Filippo Menczer, and Alessandro Flammini. 2017. Online Human-Bot Interactions : Detection , Estimation , and Characterization Proceedings of the Eleventh International AAAI Conference on Web and Social Media (ICWSM 2017) Online. 280--289."},{"key":"key-10.1145\/3184558.3191574-36","unstructured":"Bo Wang, Arkaitz Zubiaga, Maria Liakata, and Rob Procter. 2015. Making the most of tweet-inherent features for social spam detection on twitter. arXiv preprint arXiv:1503.07405 (2015)."},{"key":"key-10.1145\/3184558.3191574-37","unstructured":"Charlie Warzel and Emma Loop . [n. d.]. Twitter Tells Congress It Found 200 Russian Accounts That Overlapped With Facebook. (. [n. d.]). deftempurl%https:\/\/www.buzzfeed.com\/charliewarzel\/twitter-russian-accountsutm_term=.immV81Pgd#.siA4vLxop tempurl"},{"key":"key-10.1145\/3184558.3191574-38","unstructured":"Liang Wu, Xia Hu, Fred Morstatter, and Huan Liu. 2017. Detecting Camouflaged Content Polluters. In ICWSM. 696--699."},{"key":"key-10.1145\/3184558.3191574-39","unstructured":"Chao Yang, Robert Harkreader, and Guofei Gu. 2013. Empirical evaluation and new design for fighting evolving twitter spammers. IEEE Transactions on Information Forensics and Security Vol. 8, 8 (2013), 1280--1293.","DOI":"10.1109\/TIFS.2013.2267732","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191574-40","unstructured":"Zhi Yang, Christo Wilson, Xiao Wang, Tingting Gao, Ben Y Zhao, and Yafei Dai. 2014. Uncovering social network sybils in the wild. ACM Transactions on Knowledge Discovery from Data (TKDD) Vol. 8, 1 (2014), 2."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191574&ftid=1958321&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T20:31:37Z","timestamp":1524083497000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":40,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191574","relation":{"cites":[]}}}