{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719426},"publisher-location":"New York, New York, USA","reference-count":33,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186345","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["PersuAIDE ! An Adaptive Persuasive Text Generation System for Fashion Domain"],"prefix":"10.1145","author":[{"given":"Vitobha","family":"Munigala","sequence":"first","affiliation":[{"name":"IBM Research, Bangalore, India"}]},{"given":"Abhijit","family":"Mishra","sequence":"additional","affiliation":[{"name":"IBM Research, Bangalore, India"}]},{"given":"Srikanth G.","family":"Tamilselvam","sequence":"additional","affiliation":[{"name":"IBM Research, Bangalore, India"}]},{"given":"Shreya","family":"Khare","sequence":"additional","affiliation":[{"name":"IBM Research, Bangalore, India"}]},{"given":"Riddhiman","family":"Dasgupta","sequence":"additional","affiliation":[{"name":"IBM Research, Bangalore, India"}]},{"given":"Anush","family":"Sankaran","sequence":"additional","affiliation":[{"name":"IBM Research, Bangalore, India"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186345-1","unstructured":"Satanjeev Banerjee and Alon Lavie. 2005. METEOR: An automatic metric for MT evaluation with improved correlation with human judgments Proceedings of the acl workshop on intrinsic and extrinsic evaluation measures for machine translation and\/or summarization, Vol. Vol. 29. 65--72."},{"key":"key-10.1145\/3184558.3186345-2","unstructured":"Yoshua Bengio, R&#233;jean Ducharme, Pascal Vincent, and Christian Jauvin. 2003. A neural probabilistic language model. Journal of machine learning research Vol. 3, Feb (2003), 1137--1155."},{"key":"key-10.1145\/3184558.3186345-3","unstructured":"Peter F Brown, Vincent J Della Pietra, Stephen A Della Pietra, and Robert L Mercer. 1993. The mathematics of statistical machine translation: Parameter estimation. Computational linguistics (1993)."},{"key":"key-10.1145\/3184558.3186345-4","unstructured":"Jeanne Sternlicht Chall and Edgar Dale. 1995. Readability revisited: The new Dale-Chall readability formula. Brookline Books."},{"key":"key-10.1145\/3184558.3186345-5","unstructured":"Simon Colton, Jacob Goodwin, and Tony Veale. 2012. Full-FACE Poetry Generation. In ICCC. 95--102."},{"key":"key-10.1145\/3184558.3186345-6","unstructured":"Lorenzo Gatti, Marco Guerini, Oliviero Stock, and Carlo Strapparava. 2014. Sentiment variations in text for persuasion technology International Conference on Persuasive Technology. Springer, 106--117."},{"key":"key-10.1145\/3184558.3186345-7","unstructured":"Lorenzo Gatti, Gozde Ozbal, Marco Guerini, Oliviero Stock, and Carlo Strapparava. 2016. Heady-Lines: A Creative Generator Of Newspaper Headlines Companion Publication of the 21st International Conference on Intelligent User Interfaces. ACM, 79--83.","DOI":"10.1145\/2876456.2879469","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186345-8","unstructured":"Hugo Gonccalo Oliveira. 2015. Tra-la-lyrics 2.0: Automatic generation of song lyrics on a semantic domain. Journal of Artificial General Intelligence Vol. 6, 1 (2015), 87--110."},{"key":"key-10.1145\/3184558.3186345-9","unstructured":"Erica Greene, Tugba Bodrumlu, and Kevin Knight. 2010. Automatic analysis of rhythmic poetry with applications to generation and translation Proceedings of the 2010 conference on empirical methods in natural language processing. Association for Computational Linguistics, 524--533."},{"key":"key-10.1145\/3184558.3186345-10","unstructured":"Marco Guerini, Fabio Pianesi, and Oliviero Stock. 2014. Is it morally acceptable for a system to lie to persuade me arXiv preprint arXiv:1404.3959 (2014)."},{"key":"key-10.1145\/3184558.3186345-11","unstructured":"Marco Guerini, Oliviero Stock, and Massimo Zancanaro. 2007. A taxonomy of strategies for multimodal persuasive message generation. Applied Artificial Intelligence Vol. 21, 2 (2007), 99--136.","DOI":"10.1080\/08839510601117169","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186345-12","unstructured":"Kenneth Heafield. 2011. KenLM: Faster and smaller language model queries. Proceedings of the Sixth Workshop on Statistical Machine Translation."},{"key":"key-10.1145\/3184558.3186345-13","unstructured":"Parag Jain, Priyanka Agrawal, Abhijit Mishra, Mohak Sukhwani, Anirban Laha, and Karthik Sankaranarayanan. 2017. Story Generation from Sequence of Independent Short Descriptions. arXiv preprint arXiv:1707.05501 (2017)."},{"key":"key-10.1145\/3184558.3186345-14","unstructured":"J Peter Kincaid, Robert P Fishburne Jr, Richard L Rogers, and Brad S Chissom. 1975. Derivation of new readability formulas (automated readability index, fog count and flesch reading ease formula) for navy enlisted personnel. Technical Report. DTIC Document."},{"key":"key-10.1145\/3184558.3186345-15","unstructured":"Philipp Koehn. 2009. Statistical machine translation. Cambridge University Press.","DOI":"10.1017\/CBO9780511815829","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186345-16","unstructured":"Philipp Koehn, Hieu Hoang, Alexandra Birch, Chris Callison-Burch, Marcello Federico, Nicola Bertoldi, Brooke Cowan, Wade Shen, Christine Moran, Richard Zens, et almbox. 2007. Moses: Open source toolkit for statistical machine translation Proceedings of the 45th annual meeting of the ACL on interactive poster and demonstration sessions. Association for Computational Linguistics, 177--180.","DOI":"10.3115\/1557769.1557821","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186345-17","unstructured":"Ray Kurzweil. 2005. The singularity is near: When humans transcend biology. Penguin."},{"key":"key-10.1145\/3184558.3186345-18","unstructured":"Mike Lewis, Denis Yarats, Yann N. Dauphin, Devi Parikh, and Dhruv Batra. 2017. Deal or No Deal End-to-End Learning for Negotiation Dialogues. CoRR Vol. abs\/1706.05125 (2017). showeprint[arxiv]1706.05125 http:\/\/arxiv.org\/abs\/1706.05125"},{"key":"key-10.1145\/3184558.3186345-19","unstructured":"Chin-Yew Lin. 2004. Rouge: A package for automatic evaluation of summaries Text summarization branches out: Proceedings of the ACL-04 workshop, Vol. Vol. 8. Barcelona, Spain."},{"key":"key-10.1145\/3184558.3186345-20","unstructured":"Minh-Thang Luong, Hieu Pham, and Christopher D Manning. 2015. Effective approaches to attention-based neural machine translation. arXiv preprint arXiv:1508.04025 (2015)."},{"key":"key-10.1145\/3184558.3186345-21","unstructured":"G Harry Mc Laughlin. 1969. SMOG grading-a new readability formula. Journal of reading, Vol. 12, 8 (1969), 639--646."},{"key":"key-10.1145\/3184558.3186345-22","unstructured":"Neil McIntyre and Mirella Lapata. 2009. Learning to tell tales: A data-driven approach to story generation Proceedings of the Joint Conference of the 47th Annual Meeting of the ACL and the 4th International Joint Conference on Natural Language Processing of the AFNLP: Volume 1-Volume 1. Association for Computational Linguistics, 217--225.","DOI":"10.3115\/1687878.1687910","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186345-23","unstructured":"Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient estimation of word representations in vector space. arXiv preprint arXiv:1301.3781 (2013)."},{"key":"key-10.1145\/3184558.3186345-24","unstructured":"Hugo Gonccalo Oliveira. 2012. PoeTryMe: a versatile platform for poetry generation. Computational Creativity, Concept Invention, and General Intelligence Vol. 1 (2012), 21."},{"key":"key-10.1145\/3184558.3186345-25","unstructured":"G&#246;zde &#214;zbal, Daniele Pighin, and Carlo Strapparava. 2013. BRAINSUP: Brainstorming Support for Creative Sentence Generation. ACL (1). 1446--1455."},{"key":"key-10.1145\/3184558.3186345-26","unstructured":"Kishore Papineni, Salim Roukos, Todd Ward, and Wei-Jing Zhu. 2002. BLEU: a method for automatic evaluation of machine translation Proceedings of the 40th annual meeting on association for computational linguistics. Association for Computational Linguistics, 311--318."},{"key":"key-10.1145\/3184558.3186345-27","unstructured":"Oliviero Stock, Marco Guerini, and Fabio Pianesi. 2016. Ethical Dilemmas for Adaptive Persuasion Systems. AAAI. 4157--4162."},{"key":"key-10.1145\/3184558.3186345-28","unstructured":"Ilya Sutskever, Oriol Vinyals, and Quoc V Le. 2014. Sequence to sequence learning with neural networks Advances in neural information processing systems. 3104--3112."},{"key":"key-10.1145\/3184558.3186345-29","unstructured":"Jukka Toivanen, Hannu Toivonen, Alessandro Valitutti, Oskar Gross, et almbox. 2012. Corpus-based generation of content and form in poetry Proceedings of the Third International Conference on Computational Creativity."},{"key":"key-10.1145\/3184558.3186345-30","unstructured":"Polona Tomavsic, M Znidarvsic, and Gregor Papa. 2014. Implementation of a slogan generator. In Proceedings of 5th International Conference on Computational Creativity, Ljubljana, Slovenia, Vol. Vol. 301. 340--343."},{"key":"key-10.1145\/3184558.3186345-31","unstructured":"Alessandro Valitutti, Oliviero Stock, and Carlo Strapparava. 2009. Graphlaugh: a tool for the interactive generation of humorous puns Affective Computing and Intelligent Interaction and Workshops, 2009. ACII 2009. 3rd International Conference on. IEEE, 1--2."},{"key":"key-10.1145\/3184558.3186345-32","unstructured":"Alessandro Valitutti, Hannu Toivonen, Antoine Doucet, and Jukka M Toivanen. 2013. \" Let Everything Turn Well in Your Wife\": Generation of Adult Humor Using Lexical Constraints. In ACL (2). 243--248."},{"key":"key-10.1145\/3184558.3186345-33","unstructured":"Martin Znidarvsic, Polona Tomavsic, and Gregor Papa. 2015. Case-Based Slogan Production. (2015)."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186345&ftid=1958194&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:57:05Z","timestamp":1524077825000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":33,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186345","relation":{"cites":[]}}}