{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:25Z","timestamp":1525103725080},"publisher-location":"New York, New York, USA","reference-count":29,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191584","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["The Whole-Page Optimization via Dynamic Ad Allocation"],"prefix":"10.1145","author":[{"given":"Weiru","family":"Zhang","sequence":"first","affiliation":[{"name":"Alibaba Group, Hangzhou, China"}]},{"given":"Chao","family":"Wei","sequence":"additional","affiliation":[{"name":"Alibaba Group, Hangzhou, China"}]},{"given":"Xiaonan","family":"Meng","sequence":"additional","affiliation":[{"name":"Alibaba Group, Hangzhou, China"}]},{"given":"Yi","family":"Hu","sequence":"additional","affiliation":[{"name":"Alibaba Group, Hangzhou, China"}]},{"given":"Hao","family":"Wang","sequence":"additional","affiliation":[{"name":"Alibaba Group, Hangzhou, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191584-1","unstructured":"Ashish Agarwal, Kartik Hosanagar, and Michael Smith. 2011. Sponsored Search: Do Organic Results help or hurt the Performance and under what conditions (2011)."},{"key":"key-10.1145\/3184558.3191584-2","unstructured":"Anand Bhalgat, Jon Feldman, and Vahab Mirrokni. 2012. Online allocation of display ads with smooth delivery Proceedings of the 18th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1213--1221."},{"key":"key-10.1145\/3184558.3191584-3","unstructured":"Fidel Cacheda, Nicola Barbieri, and Roi Blanco. 2017. Click Through Rate Prediction for Local Search Results Proceedings of the Tenth ACM International Conference on Web Search and Data Mining. ACM, 171--180."},{"key":"key-10.1145\/3184558.3191584-4","unstructured":"Olivier Chapelle and Ya Zhang. 2009. A dynamic bayesian network click model for web search ranking Proceedings of the 18th international conference on World wide web. ACM, 1--10."},{"key":"key-10.1145\/3184558.3191584-5","unstructured":"Ye Chen, Pavel Berkhin, Bo Anderson, and Nikhil R Devanur. 2011. Real-time bidding algorithms for performance-based display ad allocation Proceedings of the 17th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1307--1315."},{"key":"key-10.1145\/3184558.3191584-6","unstructured":"Alexey Chervonenkis, Anna Sorokina, and Valery A Topinsky. 2013. Optimization of ads allocation in sponsored search Proceedings of the 22nd International Conference on World Wide Web. ACM, 121--122."},{"key":"key-10.1145\/3184558.3191584-7","unstructured":"Nick Craswell, Onno Zoeter, Michael Taylor, and Bill Ramsey. 2008. An experimental comparison of click position-bias models Proceedings of the 2008 international conference on web search and data mining. ACM, 87--94."},{"key":"key-10.1145\/3184558.3191584-8","unstructured":"Cristian Danescu-Niculescu-Mizil, Andrei Z Broder, Evgeniy Gabrilovich, Vanja Josifovski, and Bo Pang. 2010. Competing for users' attention: on the interplay between organic and sponsored search results. In Proceedings of the 19th international conference on World wide web. ACM, 291--300.","DOI":"10.1145\/1772690.1772721","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191584-9","unstructured":"Nikhil R Devanur, Zhiyi Huang, Nitish Korula, Vahab S Mirrokni, and Qiqi Yan. 2016. Whole-page optimization and submodular welfare maximization with online bidders. ACM Transactions on Economics and Computation Vol. 4, 3 (2016), 14."},{"key":"key-10.1145\/3184558.3191584-10","unstructured":"Nikhil R Devanur, Kamal Jain, Balasubramanian Sivan, and Christopher A Wilkens. 2011. Near optimal online algorithms and fast approximation algorithms for resource allocation problems. In Proceedings of the 12th ACM conference on Electronic commerce. ACM, 29--38."},{"key":"key-10.1145\/3184558.3191584-11","unstructured":"Georges E Dupret and Benjamin Piwowarski. 2008. A user browsing model to predict search engine click data from past observations. Proceedings of the 31st annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 331--338."},{"key":"key-10.1145\/3184558.3191584-12","unstructured":"Jon Feldman, Monika Henzinger, Nitish Korula, Vahab S Mirrokni, and Cliff Stein. 2010. Online stochastic packing applied to display ad allocation European Symposium on Algorithms. Springer, 182--194."},{"key":"key-10.1145\/3184558.3191584-13","unstructured":"Anindya Ghose and Sha Yang. 2008. Comparing performance metrics in organic search with sponsored search advertising Proceedings of the 2nd International Workshop on Data Mining and Audience Intelligence for Advertising. ACM, 18--26."},{"key":"key-10.1145\/3184558.3191584-14","unstructured":"Anindya Ghose and Sha Yang. 2009. An empirical analysis of search engine advertising: Sponsored search in electronic markets. Management Science Vol. 55, 10 (2009), 1605--1622.","DOI":"10.1287\/mnsc.1090.1054","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191584-15","unstructured":"Ashish Goel, Mohammad Mahdian, Hamid Nazerzadeh, and Amin Saberi. 2010. Advertisement allocation for generalized second-pricing schemes. Operations Research Letters Vol. 38, 6 (2010), 571--576.","DOI":"10.1016\/j.orl.2010.09.002","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191584-16","unstructured":"Sreenivas Gollapudi, Rina Panigrahy, and Moises Goldszmidt. 2011. Inferring clickthrough rates on ads from click behavior on search results Proceedings of the Workshop on User Modeling for Web Applications, Fourth International Conference on Web Search and Web Data Mining, WSDM."},{"key":"key-10.1145\/3184558.3191584-17","unstructured":"Laura A Granka, Thorsten Joachims, and Geri Gay. 2004. Eye-tracking analysis of user behavior in WWW search Proceedings of the 27th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 478--479."},{"key":"key-10.1145\/3184558.3191584-18","unstructured":"Di He, Wei Chen, Liwei Wang, and Tie-Yan Liu. 2013. A Game-Theoretic Machine Learning Approach for Revenue Maximization in Sponsored Search. In IJCAI. 206--212."},{"key":"key-10.1145\/3184558.3191584-19","unstructured":"Bernard Jansen and Amanda Spink. 2007. The effect on click-through of combining sponsored and non-sponsored search engine results in a single listing. In Proceedings of the 2007 Workshop on Sponsored Search Auctions, WWW Conference."},{"key":"key-10.1145\/3184558.3191584-20","unstructured":"Bernard J Jansen and Marc Resnick. 2005. Examining searcher perceptions of and interactions with sponsored results Workshop on Sponsored Search Auctions."},{"key":"key-10.1145\/3184558.3191584-21","unstructured":"Chinmay Karande, Aranyak Mehta, and Ramakrishnan Srikant. 2013. Optimizing budget constrained spend in search advertising Proceedings of the sixth ACM international conference on Web search and data mining. ACM, 697--706."},{"key":"key-10.1145\/3184558.3191584-22","unstructured":"Mervyn King, Jill Atkins, and Michael Schwarz. 2007. Internet advertising and the generalized second-price auction: Selling billions of dollars worth of keywords. The American economic review Vol. 97, 1 (2007), 242--259.","DOI":"10.1257\/aer.97.1.242","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191584-23","unstructured":"Aranyak Mehta et almbox. 2013. Online matching and ad allocation. Foundations and Trends&#174; in Theoretical Computer Science Vol. 8, 4 (2013), 265--368."},{"key":"key-10.1145\/3184558.3191584-24","unstructured":"Hanna Sumita, Yasushi Kawase, Sumio Fujita, Takuro Fukunaga, and RIKEN AIP Center . [n. d.]. Online Optimization of Video-Ad Allocation. (. [n. d.])."},{"key":"key-10.1145\/3184558.3191584-25","unstructured":"Bo Wang, Zhaonan Li, Jie Tang, Kuo Zhang, Songcan Chen, and Liyun Ru. 2011. Learning to advertise: how many ads are enough Advances in Knowledge Discovery and Data Mining (2011), 506--518."},{"key":"key-10.1145\/3184558.3191584-26","unstructured":"Yue Wang, Dawei Yin, Luo Jie, Pengyuan Wang, Makoto Yamada, Yi Chang, and Qiaozhu Mei. 2016. Beyond ranking: Optimizing whole-page presentation Proceedings of the Ninth ACM International Conference on Web Search and Data Mining. ACM, 103--112.","DOI":"10.1145\/2835776.2835824","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191584-27","unstructured":"Dawei Yin, Bin Cao, Jian-Tao Sun, and Brian D Davison. 2014. Estimating ad group performance in sponsored search Proceedings of the 7th ACM international conference on Web search and data mining. ACM, 143--152."},{"key":"key-10.1145\/3184558.3191584-28","unstructured":"Weinan Zhang, Shuai Yuan, and Jun Wang. 2014. Optimal real-time bidding for display advertising. In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1077--1086.","DOI":"10.1145\/2623330.2623633","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191584-29","unstructured":"Yunzhang Zhu, Gang Wang, Junli Yang, Dakan Wang, Jun Yan, and Zheng Chen. 2009. Revenue optimization with relevance constraint in sponsored search Proceedings of the Third International Workshop on Data Mining and Audience Intelligence for Advertising. ACM, 55--60."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191584&ftid=1958386&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T20:38:17Z","timestamp":1524083897000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":29,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191584","relation":{"cites":[]}}}