{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719481},"publisher-location":"New York, New York, USA","reference-count":34,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186347","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Learning Procedures from Text"],"prefix":"10.1145","author":[{"given":"Hogun","family":"Park","sequence":"first","affiliation":[{"name":"Purdue University, West Lafayette, IN, USA"}]},{"given":"Hamid Reza","family":"Motahari Nezhad","sequence":"additional","affiliation":[{"name":"IBM Almaden Research Center, San Jose, CA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186347-1","unstructured":"Heike Adel, Benjamin Roth, and Hinrich Sch&#252;tze. 2016. Comparing convolutional neural networks to traditional models for slot filling. arXiv preprint arXiv:1603.05157 (2016)."},{"key":"key-10.1145\/3184558.3186347-2","unstructured":"Razvan C. Bunescu and Raymond J. Mooney. 2005. A Shortest Path Dependency Kernel for Relation Extraction. In Proceedings of the Conference on Human Language Technology and Empirical Methods in Natural Language Processing (HLT '05). Association for Computational Linguistics, Stroudsburg, PA, USA, 724--731. https:\/\/doi.org\/10.3115\/1220575.1220666","DOI":"10.3115\/1220575.1220666","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-3","unstructured":"Danqi Chen and Christopher Manning. 2014. A fast and accurate dependency parser using neural networks. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 740--750.","DOI":"10.3115\/v1\/D14-1082","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-4","unstructured":"Cuong Xuan Chu, Niket Tandon, and Gerhard Weikum. 2017. Distilling Task Knowledge from How-To Communities. In Proceedings of the 26th International Conference on World Wide Web (WWW '17). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 805--814. https:\/\/doi.org\/10.1145\/3038912.3052715","DOI":"10.1145\/3038912.3052715","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-5","unstructured":"Oren Etzioni, Anthony Fader, Janara Christensen, Stephen Soderland, and Mausam Mausam. 2011. Open Information Extraction: The Second Generation. In IJCAI, Vol. 11. 3--10."},{"key":"key-10.1145\/3184558.3186347-6","unstructured":"Sepp Hochreiter and J&#252;rgen Schmidhuber. 1997. Long Short-Term Memory. Neural Comput. 9, 8 (Nov. 1997), 1735--1780. https:\/\/doi.org\/10.1162\/neco.1997.9. 8.1735"},{"key":"key-10.1145\/3184558.3186347-7","unstructured":"Konrad H&#246;ffner, Sebastian Walter, Edgard Marx, Ricardo Usbeck, Jens Lehmann, and Axel-Cyrille Ngonga Ngomo. 2017. Survey on challenges of question answering in the semantic web. Semantic Web 8, 6 (2017), 895--920.","DOI":"10.3233\/SW-160247","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-8","unstructured":"Yuchul Jung, Jihee Ryu, Kyung-min Kim, and Sung-Hyon Myaeng. 2010. Automatic Construction of a Large-scale Situation Ontology by Mining How-to Instructions from the Web. Web Semant. 8, 2--3 (July 2010), 110--124. https: \/\/doi.org\/10.1016\/j.websem.2010.04.006"},{"key":"key-10.1145\/3184558.3186347-9","unstructured":"Yoon Kim. 2014. Convolutional neural networks for sentence classification. In Proceedings of Conference on Empirical Methods in Natural Language Processing (EMNLP '14). 1746--1751.","DOI":"10.3115\/v1\/D14-1181","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-10","unstructured":"Diederik Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 (2014)."},{"key":"key-10.1145\/3184558.3186347-11","unstructured":"Man Lan, Jianxiang Wang, Yuanbin Wu, Zheng-Yu Niu, and Haifeng Wang. 2017. Multi-task Attention-based Neural Networks for Implicit Discourse Relationship Representation and Identification. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. 1299--1308.","DOI":"10.18653\/v1\/D17-1134","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-12","unstructured":"Lijun Mei, Qicheng Li, Rangachari Anand, Juhnyoung Lee, Feng Li, and Shaochun Li. 2014. Enabling customizable service-based procedural knowledge applications. An service-orientation for Dialog Manager. In Service Operations and Logistics, and Informatics (SOLI), 2014 IEEE International Conference on. IEEE, 412--417."},{"key":"key-10.1145\/3184558.3186347-13","unstructured":"Alexander Miller, Adam Fisch, Jesse Dodge, Amir-Hossein Karimi, Antoine Bordes, and Jason Weston. 2016. Key-value memory networks for directly reading documents. arXiv preprint arXiv:1606.03126 (2016)."},{"key":"key-10.1145\/3184558.3186347-14","unstructured":"Makoto Miwa and Mohit Bansal. 2016. End-to-end Relation Extraction using LSTMs on Sequences and Tree Structures. Proceedings of ACL (2016)."},{"key":"key-10.1145\/3184558.3186347-15","unstructured":"Hamid R. Motahari Nezhad, Kalpa Gunaratna, and Juan Cappi. 2017. eAssistant: Cognitive Assistance for Identification and Auto-Triage of Actionable Conversations. In Proceedings of the 26th International Conference on World Wide Web Companion (WWW '17 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 89--98. https:\/\/doi.org\/10.1145\/3041021.3054147","DOI":"10.1145\/3041021.3054147","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-16","unstructured":"Nanyun Peng, Hoifung Poon, Chris Quirk, Kristina Toutanova, and Wen-tau Yih. 2017. Cross-Sentence N-ary Relation Extraction with Graph LSTMs. Transactions of the Association for Computational Linguistics 5 (2017), 101--115."},{"key":"key-10.1145\/3184558.3186347-17","unstructured":"Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532--1543.","DOI":"10.3115\/v1\/D14-1162","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-18","unstructured":"Chris Quirk and Hoifung Poon. 2017. Distant supervision for relation extraction beyond the sentence boundary. Proceedings of ACL (2017), 1171--1182."},{"key":"key-10.1145\/3184558.3186347-19","unstructured":"Samuel R&#246;nnqvist, Niko Schenk, and Christian Chiarcos. 2017. A Recurrent Neural Model with Attention for the Recognition of Chinese Implicit Discourse Relations. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers). Association for Computational Linguistics, 256--262. https:\/\/doi.org\/10.18653\/v1\/P17--2040"},{"key":"key-10.1145\/3184558.3186347-20","unstructured":"Adam Santoro, Sergey Bartunov, Matthew Botvinick, Daan Wierstra, and Timothy Lillicrap. 2016. One-shot learning with memory-augmented neural networks. arXiv preprint arXiv:1605.06065 (2016)."},{"key":"key-10.1145\/3184558.3186347-21","unstructured":"Michael Schmitz, Robert Bart, Stephen Soderland, Oren Etzioni, et al. 2012. Open language learning for information extraction. In Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning. Association for Computational Linguistics, 523--534."},{"key":"key-10.1145\/3184558.3186347-22","unstructured":"Pol Schumacher and Mirjam Minor. 2014. Extracting control-flow from text. In Information Reuse and Integration (IRI), 2014 IEEE 15th International Conference on. IEEE, 203--210.","DOI":"10.1109\/IRI.2014.7051891","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-23","unstructured":"Pol Schumacher, Mirjam Minor, Kirstin Walter, and Ralph Bergmann. 2012. Extraction of Procedural Knowledge from the Web: A Comparison of Two Workflow Extraction Approaches. In Proceedings of the 21st International Conference on World Wide Web (WWW '12 Companion). ACM, New York, NY, USA, 739--747. https:\/\/doi.org\/10.1145\/2187980.2188194","DOI":"10.1145\/2187980.2188194","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-24","unstructured":"Robert Speer and Catherine Havasi. 2013. ConceptNet 5: A large semantic network for relational knowledge. In The People's Web Meets NLP. Springer, 161--176.","DOI":"10.1007\/978-3-642-35085-6_6","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-25","unstructured":"Sainbayar Sukhbaatar, Jason Weston, Rob Fergus, et al. 2015. End-to-end memory networks. In Advances in neural information processing systems. 2440--2448."},{"key":"key-10.1145\/3184558.3186347-26","unstructured":"Jason Weston, Sumit Chopra, and Antoine Bordes. 2014. Memory networks. arXiv preprint arXiv:1410.3916 (2014)."},{"key":"key-10.1145\/3184558.3186347-27","unstructured":"Kun Xu, Yansong Feng, Songfang Huang, and Dongyan Zhao. 2015. Semantic relation classification via convolutional neural networks with simple negative sampling. arXiv preprint arXiv:1506.07650 (2015)."},{"key":"key-10.1145\/3184558.3186347-28","unstructured":"Yan Xu, Lili Mou, Ge Li, Yunchuan Chen, Hao Peng, and Zhi Jin. 2015. Classifying Relations via Long Short Term Memory Networks along Shortest Dependency Paths. In EMNLP. 1785--1794.","DOI":"10.18653\/v1\/D15-1206","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186347-29","unstructured":"Zi Yang and Eric Nyberg. 2015. Leveraging Procedural Knowledge for Taskoriented Search. In Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '15). ACM, New York, NY, USA, 513--522. https:\/\/doi.org\/10.1145\/2766462.2767744"},{"key":"key-10.1145\/3184558.3186347-30","unstructured":"Zichao Yang, Diyi Yang, Chris Dyer, Xiaodong He, Alexander J Smola, and Eduard H Hovy. 2016. Hierarchical Attention Networks for Document Classification. In HLT-NAACL. 1480--1489."},{"key":"key-10.1145\/3184558.3186347-31","unstructured":"Dmitry Zelenko, Chinatsu Aone, and Anthony Richardella. 2003. Kernel Methods for Relation Extraction. J. Mach. Learn. Res. 3 (March 2003), 1083--1106. http: \/\/dl.acm.org\/citation.cfmid=944919.944964"},{"key":"key-10.1145\/3184558.3186347-32","unstructured":"Daojian Zeng, Kang Liu, Siwei Lai, Guangyou Zhou, Jun Zhao, et al. 2014. Relation Classification via Convolutional Deep Neural Network. In COLING. 2335--2344."},{"key":"key-10.1145\/3184558.3186347-33","unstructured":"Shu Zhang, Dequan Zheng, Xinchen Hu, and Ming Yang. 2015. Bidirectional Long Short-Term Memory Networks for Relation Classification. In PACLIC."},{"key":"key-10.1145\/3184558.3186347-34","unstructured":"Suncong Zheng, Feng Wang, Hongyun Bao, Yuexing Hao, Peng Zhou, and Bo Xu. 2017. Joint Extraction of Entities and Relations Based on a Novel Tagging Scheme. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), Vol. 1. 1227--1236.","DOI":"10.18653\/v1\/P17-1113","doi-asserted-by":"crossref"}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186347&ftid=1958099&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T19:00:01Z","timestamp":1524078001000},"score":1.0,"subtitle":["Codifying How-to Procedures in Deep Neural Networks"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":34,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186347","relation":{"cites":[]}}}