{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:24Z","timestamp":1525103724320},"publisher-location":"New York, New York, USA","reference-count":25,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"SFB","award":["912"]},{"name":"DFG","award":["BA 1122\/19-1"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191538","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Patient Selection for Clinical Trials Using Temporalized Ontology-Mediated Query Answering"],"prefix":"10.1145","author":[{"given":"Franz","family":"Baader","sequence":"first","affiliation":[{"name":"TU Dresden, Dresden, Germany"}]},{"given":"Stefan","family":"Borgwardt","sequence":"additional","affiliation":[{"name":"TU Dresden, Dresden, Germany"}]},{"given":"Walter","family":"Forkel","sequence":"additional","affiliation":[{"name":"TU Dresden, Dresden, Germany"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191538-1","unstructured":"Rajeev Alur and Thomas A. Henzinger. 1993. Real-Time Logics: Complexity and Expressiveness. Information and Computation Vol. 104, 1 (1993), 35--77. https:\/\/doi.org\/10.1006\/inco.1993.1025","DOI":"10.1006\/inco.1993.1025","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-2","unstructured":"Alessandro Artale, Roman Kontchakov, Alisa Kovtunova, Vladislav Ryzhikov, Frank Wolter, and Michael Zakharyaschev. 2017. Ontology-Mediated Query Answering over Temporal Data: A Survey (Invited Talk) Proc. of the 24th Int. Symp. on Temporal Representation and Reasoning (TIME'17) (Leibniz International Proceedings in Informatics), Sven Schewe, Thomas Schneider, and Jef Wijsen (Eds.), Vol. Vol. 90. Schloss Dagstuhl--Leibniz-Zentrum fuer Informatik, 1:1--1:37. https:\/\/doi.org\/10.4230\/LIPIcs.TIME.2017.1"},{"key":"key-10.1145\/3184558.3191538-3","unstructured":"Alessandro Artale, Vladislav Ryzhikov, and Roman Kontchakov. 2012. DL-Lite with Attributes and Datatypes Proc. of the 20th Eur. Conf. on Artificial Intelligence (ECAI'12) (Frontiers in Artificial Intelligence and Applications), Luc De Raedt, Christian Bessiere, Didier Dubois, Patrick Doherty, Paolo Frasconi, Fredrik Heintz, and Peter Lucas (Eds.), Vol. Vol. 242. IOS Press, 61--66. https:\/\/doi.org\/10.3233\/978--1--61499-098--7--61"},{"key":"key-10.1145\/3184558.3191538-4","unstructured":"Franz Baader. 2003. Terminological Cycles in a Description Logic with Existential Restrictions Proc. of the 18th Int. Joint Conf. on Artificial Intelligence (IJCAI'03), Georg Gottlob and Toby Walsh (Eds.). Morgan Kaufmann, 325--330. http:\/\/ijcai.org\/Proceedings\/03\/Papers\/048.pdf"},{"key":"key-10.1145\/3184558.3191538-5","unstructured":"Franz Baader, Stefan Borgwardt, Patrick Koopmann, Ana Ozaki, and Veronika Thost. 2017. Metric Temporal Description Logics with Interval-Rigid Names Proc. of the 11th Int. Symp. on Frontiers of Combining Systems (FroCoS'17) (Lecture Notes in Computer Science), Clare Dixon and Marcelo Finger (Eds.), Vol. Vol. 10483. Springer, 60--76. https:\/\/doi.org\/10.1007\/978--3--319--66167--4_4"},{"key":"key-10.1145\/3184558.3191538-6","unstructured":"Franz Baader, Stefan Borgwardt, and Marcel Lippmann. 2013. Temporalizing Ontology-Based Data Access. In Proc. of the 24th Int. Conf. on Automated Deduction (CADE'13) (Lecture Notes in Computer Science), Maria Paola Bonacina (Ed.), Vol. Vol. 7898. Springer, 330--344. https:\/\/doi.org\/10.1007\/978--3--642--38574--2_23"},{"key":"key-10.1145\/3184558.3191538-7","unstructured":"Franz Baader, Stefan Borgwardt, and Marcel Lippmann. 2017. Query Rewriting for textitDL-Lite with n-ary Concrete Domains Proc. of the 26th Int. Joint Conf. on Artificial Intelligence (IJCAI'17), Carles Sierra (Ed.). IJCAI, 786--792. https:\/\/doi.org\/10.24963\/ijcai.2017\/109","DOI":"10.24963\/ijcai.2017\/109","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-8","unstructured":"Franz Baader, Sebastian Brandt, and Carsten Lutz. 2005. Pushing the EL Envelope. In Proc. of the 19th Int. Joint Conf. on Artificial Intelligence (IJCAI'05), Leslie Pack Kaelbling and Alessandro Saffiotti (Eds.). Professional Book Center, 364--369. http:\/\/ijcai.org\/Proceedings\/09\/Papers\/053.pdf"},{"key":"key-10.1145\/3184558.3191538-9","unstructured":"Franz Baader, Diego Calvanese, Deborah L. McGuinness, Daniele Nardi, and Peter F. Patel-Schneider (Eds.). 2007. The Description Logic Handbook: Theory, Implementation, and Applications (2 ed.). Cambridge University Press.","DOI":"10.1017\/CBO9780511711787","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-10","unstructured":"Franz Baader and Oliver Fern&#225;ndez Gil. 2017. Decidability and Complexity of Threshold Description Logics Induced by Concept Similarity Measures. In Proc. of the 32nd Annual ACM Symp. on Applied Computing, Sung Y. Shin, Dongwan Shin, and Maria Lencastre (Eds.). ACM, 983--988. https:\/\/doi.org\/10.1145\/3019612.3019715","DOI":"10.1145\/3019612.3019715","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-11","unstructured":"Franz Baader and Philipp Hanschke. 1991. A Scheme for Integrating Concrete Domains into Concept Languages Proc. of the 12th Int. Joint Conf. on Artificial Intelligence (IJCAI'91), John Mylopoulos and Raymond Reiter (Eds.). Morgan Kaufmann, 452--457. http:\/\/ijcai.org\/Proceedings\/91--1\/Papers\/070.pdf"},{"key":"key-10.1145\/3184558.3191538-12","unstructured":"Paolo Besana, Marc Cuggia, Oussama Zekri, Annabel Bourde, and Anita Burgun. 2010. Using Semantic Web Technologies for Clinical Trial Recruitment Proc. of the 9th Int. Semantic Web Conf. (ISWC'10) (Lecture Notes in Computer Science), Peter F. Patel-Schneider, Yue Pan, Pascal Hitzler, Peter Mika, Lei Zhang, Jeff Z. Pan, Ian Horrocks, and Birte Glimm (Eds.), Vol. Vol. 6497. Springer, 34--49. https:\/\/doi.org\/10.1007\/978--3--642--17749--1_3"},{"key":"key-10.1145\/3184558.3191538-13","unstructured":"Luca Bonomi and Xiaoqian Jiang. 2018. Patient Ranking with Temporally Annotated Data. Journal of Biomedical Informatics Vol. 78 (2018), 43--53. https:\/\/doi.org\/10.1016\/j.jbi.2017.12.007","DOI":"10.1016\/j.jbi.2017.12.007","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-14","unstructured":"Stefan Borgwardt, Marcel Lippmann, and Veronika Thost. 2015. Temporalizing Rewritable Query Languages over Knowledge Bases. Journal of Web Semantics Vol. 33 (2015), 50--70. https:\/\/doi.org\/10.1016\/j.websem.2014.11.007","DOI":"10.1016\/j.websem.2014.11.007","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-15","unstructured":"Diego Calvanese, Giuseppe De Giacomo, Domenico Lembo, Maurizio Lenzerini, and Riccardo Rosati. 2007. textitEQL-Lite: Effective First-Order Query Processing in Description Logics Proc. of the 20th Int. Joint Conf. on Artificial Intelligence (IJCAI'07), Manuela M. Veloso (Ed.). 274--279. http:\/\/www.ijcai.org\/Proceedings\/07\/Papers\/042.pdf"},{"key":"key-10.1145\/3184558.3191538-16","unstructured":"Christopher L. Crowe and Cui Tao. 2015. Designing Ontology-based Patterns for the Representation of the Time-Relevant Eligibility Criteria of Clinical Protocols. AMIA Joint Summits on Translational Science Proc. Vol. 2015 (2015), 173--177. https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4525239\/"},{"key":"key-10.1145\/3184558.3191538-17","unstructured":"Andreas Ecke, Rafael Pe naloza, and Anni-Yasmin Turhan. 2015. Similarity-Based Relaxed Instance Queries. Journal of Applied Logic Vol. 13, 4, Part 1 (2015), 480--508. https:\/\/doi.org\/10.1016\/j.jal.2015.01.002","DOI":"10.1016\/j.jal.2015.01.002","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-18","unstructured":"V&#305;ctor Guti&#233;rrez-Basulto, Yazm&#305;n Ib&#225;nez-Garc&#305;a, Roman Kontchakov, and Egor V. Kostylev. 2015. Queries with Negation and Inequalities over Lightweight Ontologies. Journal of Web Semantics Vol. 35 (2015), 184--202. https:\/\/doi.org\/10.1016\/j.websem.2015.06.002","DOI":"10.1016\/j.websem.2015.06.002","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-19","unstructured":"V'&#305;ctor Guti&#233;rrez-Basulto and Szymon Klarman. 2012. Towards a Unifying Approach to Representing and Querying Temporal Data in Description Logics. In Proc. of the 6th Int. Conf. on Web Reasoning and Rule Systems (RR'12) (Lecture Notes in Computer Science), Markus Kr&#246;tzsch and Umberto Straccia (Eds.), Vol. Vol. 7497. Springer, 90--105. https:\/\/doi.org\/10.1007\/978--3--642--33203--6_8"},{"key":"key-10.1145\/3184558.3191538-20","unstructured":"George Hripcsak, Li Zhou, Simon Parsons, Amar K. Das, and Stephen B. Johnson. 2005. Modeling Electronic Discharge Summaries as a Simple Temporal Constraint Satisfaction Problem. Journal of the American Medical Informatics Association Vol. 12, 1 (2005), 55--63. https:\/\/doi.org\/10.1197\/jamia.m1623","DOI":"10.1197\/jamia.M1623","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-21","unstructured":"Felix K&#246;pcke and Hans-Ulrich Prokosch. 2014. Employing Computers for the Recruitment into Clinical Trials: A Comprehensive Systematic Review. Journal of Medical Internet Research Vol. 16, 7 (2014), e161. https:\/\/doi.org\/10.2196\/jmir.3446","DOI":"10.2196\/jmir.3446","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191538-22","unstructured":"Markus Kr&#246;tzsch and Sebastian Rudolph. 2007. Conjunctive Queries for EL with Role Composition Proc. of the 20th Int. Workshop on Description Logics (DL'07) (CEUR Workshop Proceedings), Diego Calvanese, Enrico Franconi, Volker Haarslev, Domenico Lembo, Boris Motik, Anni-Yasmin Turhan, and Sergio Tessaris (Eds.), Vol. Vol. 250. 355--362. http:\/\/ceur-ws.org\/Vol-250\/paper_58.pdf"},{"key":"key-10.1145\/3184558.3191538-23","unstructured":"Chintan Patel, James Cimino, Julian Dolby, Achille Fokoue, Aditya Kalyanpur, Aaron Kershenbaum, Li Ma, Edith Schonberg, and Kavitha Srinivas. 2007. Matching Patient Records to Clinical Trials Using Ontologies Proc. of the 6th Int. Semantic Web Conf. (ISWC'07) (Lecture Notes in Computer Science), Karl Aberer, Key-Sun Choi, Natasha Noy, Dean Allemang, Kyung-Il Lee, Lyndon Nixon, Jennifer Goldbeck, Peter Mika, Diana Maynard, Riichiro Mizoguchi, Guus Schreiber, and Philippe Cudr&#233;-Mauroux (Eds.), Vol. Vol. 4825. Springer, 816--829. https:\/\/doi.org\/10.1007\/978--3--540--76298-0_59"},{"key":"key-10.1145\/3184558.3191538-24","unstructured":"Ognjen Savkovi&#263; and Diego Calvanese. 2012. Introducing Datatypes in textitDL-Lite. In Proc. of the 20th Eur. Conf. on Artificial Intelligence (ECAI'12) (Frontiers in Artificial Intelligence and Applications), Luc De Raedt, Christian Bessiere, Didier Dubois, Patrick Doherty, Paolo Frasconi, Fredrik Heintz, and Peter Lucas (Eds.), Vol. Vol. 242. IOS Press, 720--725. https:\/\/doi.org\/10.3233\/978--1--61499-098--7--720"},{"key":"key-10.1145\/3184558.3191538-25","unstructured":"Cui Tao, Harold R. Solbrig, and Christopher G. Chute. 2011. CNTRO 2.0: A Harmonized Semantic Web Ontology for Temporal Relation Inferencing in Clinical Narratives. AMIA Joint Summits on Translational Science Proc. Vol. 2011 (2011), 64--68. https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3248753\/"}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191538&ftid=1958291&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T20:08:44Z","timestamp":1524082124000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":25,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191538","relation":{"cites":[]}}}