{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:17Z","timestamp":1523998757096},"publisher-location":"New York, New York, USA","reference-count":44,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186156","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Anxiety and Information Seeking"],"prefix":"10.1145","author":[{"given":"Brit","family":"Youngmann","sequence":"first","affiliation":[{"name":"Microsoft Research, Herzliya, Israel"}]},{"given":"Elad","family":"Yom-Tov","sequence":"additional","affiliation":[{"name":"Microsoft Research, Herziliya, Israel"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186156-1","unstructured":"Eugene Agichtein, Eric Brill, and Susan Dumais. 2006. Improving web search ranking by incorporating user behavior information Proceedings of the 29th annual international ACM conference on Research and development in information retrieval. ACM, 19--26."},{"key":"key-10.1145\/3178876.3186156-2","unstructured":"Alan Apter, R Plutchik, and HM Praag. 1993. Anxiety, impulsivity and depressed mood in relation to suicidal and violent behavior. Acta Psychiatrica Scandinavica Vol. 87, 1 (1993), 1--5."},{"key":"key-10.1145\/3178876.3186156-3","unstructured":"Ioannis Arapakis, Mounia Lalmas, B Barla Cambazoglu, Mari-Carmen Marcos, and Joemon M Jose. 2014 b. User engagement in online news: Under the scope of sentiment, interest, affect, and gaze. Journal of the Association for Information Science and Technology, Vol. 65, 10 (2014), 1988--2005.","DOI":"10.1002\/asi.23096","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-4","unstructured":"Ioannis Arapakis, Mounia Lalmas, and George Valkanas. 2014 a. Understanding Within-Content Engagement Through Pattern Analysis of Mouse Gestures Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management (CIKM '14)."},{"key":"key-10.1145\/3178876.3186156-5","unstructured":"Ioannis Arapakis and Luis A Leiva. 2016. Predicting user engagement with direct displays using mouse cursor information Proceedings of the 39th International ACM conference on Research and Development in Information Retrieval. ACM, 599--608."},{"key":"key-10.1145\/3178876.3186156-6","unstructured":"Florian Arendt and Sebastian Scherr. 2016. Optimizing online suicide prevention: a search engine-based tailored approach. Health communication (2016), 1--6."},{"key":"key-10.1145\/3178876.3186156-7","unstructured":"David H Barlow. 2000. Unraveling the mysteries of anxiety and its disorders from the perspective of emotion theory. American Psychologist Vol. 55, 11 (2000), 1247.","DOI":"10.1037\/0003-066X.55.11.1247","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-8","unstructured":"C Botella, A Garc'&#305;a-Palacios, H Villa, RM Ba nos, Soledad Quero, M Alca niz, and G Riva. 2007. Virtual reality exposure in the treatment of panic disorder and agoraphobia: A controlled study. Clinical Psychology &#38; Psychotherapy Vol. 14, 3 (2007), 164--175.","DOI":"10.1002\/cpp.524","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-9","unstructured":"Israel Soares Pompeu de Sousa Brasil and Milena Pereira Pond&#233;. 2009. Anxious and depressive symptoms and their correlation with pain severity in patients with peripheral neuropathy. Revista de Psiquiatria do Rio Grande do Sul, Vol. 31, 1 (2009), 24--31."},{"key":"key-10.1145\/3178876.3186156-10","unstructured":"Andrei Broder. 2002. A taxonomy of web search. In ACM Sigir forum, Vol. Vol. 36. ACM, 3--10.","DOI":"10.1145\/792550.792552","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-11","unstructured":"Marc-Allen Cartright, Ryen W. White, and Eric Horvitz. 2011. Intentions and Attention in Exploratory Health Search Proceedings of the 34th International ACM Conference on Research and Development in Information Retrieval (SIGIR '11). ACM, 65--74. https:\/\/doi.org\/10.1145\/2009916.2009929","DOI":"10.1145\/2009916.2009929","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-12","unstructured":"Mon Chu Chen, John R Anderson, and Myeong Ho Sohn. 2001. What can a mouse cursor tell us more?: correlation of eye\/mouse movements on web browsing CHI'01 extended abstracts on human factors in computing systems. 281--282."},{"key":"key-10.1145\/3178876.3186156-13","unstructured":"Ye Chen, Yiqun Liu, Min Zhang, and Shaoping Ma. [n. d.]. Predicting User Satisfaction in SERPs with Mouse Movement Information. IEEE Transactions on Knowledge &#38; Data Engineering 1 (. [n. d.]), 1--1."},{"key":"key-10.1145\/3178876.3186156-14","unstructured":"Fernando Diaz, Qi Guo, and Ryen W. White. 2016. Search Result Prefetching Using Cursor Movement. Proceedings of the 39th International ACM Conference on Research and Development in Information Retrieval (SIGIR '16). ACM, New York, NY, USA, 609--618. https:\/\/doi.org\/10.1145\/2911451.2911516"},{"key":"key-10.1145\/3178876.3186156-15","unstructured":"Fernando Diaz, Ryen White, Georg Buscher, and Dan Liebling. 2013. Robust Models of Mouse Movement on Dynamic Web Search Results Pages Proceedings of the 22Nd ACM International Conference on Information &#38; Knowledge Management (CIKM '13). ACM, New York, NY, USA, 1451--1460. https:\/\/doi.org\/10.1145\/2505515.2505717"},{"key":"key-10.1145\/3178876.3186156-16","unstructured":"Susannah Fox. 2011. The social life of health information, 2011. Pew Internet &#38; American Life Project Washington, DC."},{"key":"key-10.1145\/3178876.3186156-17","unstructured":"Qi Guo and Eugene Agichtein. 2008. Exploring mouse movements for inferring query intent Proceedings of the 31st annual international ACM conference on Research and development in information retrieval. ACM, 707--708."},{"key":"key-10.1145\/3178876.3186156-18","unstructured":"Qi Guo and Eugene Agichtein. 2012. Beyond dwell time: estimating document relevance from cursor movements and other post-click searcher behavior. In Proceedings of the 21st international conference on World Wide Web. ACM, 569--578.","DOI":"10.1145\/2187836.2187914","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-19","unstructured":"Jonathan Heron, Thomas G O'Connor, Jonathan Evans, Jean Golding, Vivette Glover, ALSPAC Study Team, et almbox.. 2004. The course of anxiety and depression through pregnancy and the postpartum in a community sample. Journal of affective disorders Vol. 80, 1 (2004), 65--73.","DOI":"10.1016\/j.jad.2003.08.004","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-20","unstructured":"Jeff Huang, Ryen White, and Georg Buscher. 2012 a. User See, User Point: Gaze and Cursor Alignment in Web Search Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 1341--1350. https:\/\/doi.org\/10.1145\/2207676.2208591","DOI":"10.1145\/2207676.2208591","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-21","unstructured":"Jeff Huang, Ryen W. White, Georg Buscher, and Kuansan Wang. 2012 b. Improving Searcher Models Using Mouse Cursor Activity Proceedings of the 35th International ACM Conference on Research and Development in Information Retrieval (SIGIR '12). ACM, 195--204. https:\/\/doi.org\/10.1145\/2348283.2348313","DOI":"10.1145\/2348283.2348313","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-22","unstructured":"Jeff Huang, Ryen W White, and Susan Dumais. 2011. No clicks, no problem: using cursor movements to understand and improve search Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1225--1234."},{"key":"key-10.1145\/3178876.3186156-23","unstructured":"Kalervo J\"arvelin and Jaana Kek\"al\"ainen. 2002. Cumulated gain-based evaluation of IR techniques. ACM Transactions on Information Systems (TOIS), Vol. 20, 4 (2002), 422--446."},{"key":"key-10.1145\/3178876.3186156-24","unstructured":"Jiepu Jiang, Daqing He, and James Allan. 2014. Searching, browsing, and clicking in a search session: changes in user behavior by task and over time. In Proceedings of the 37th international ACM conference on Research &#38; development in information retrieval. ACM, 607--616.","DOI":"10.1145\/2600428.2609633","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-25","unstructured":"Thorsten Joachims. 2006. Training linear SVMs in linear time. In Proceedings of the 12th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 217--226.","DOI":"10.1145\/1150402.1150429","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-26","unstructured":"Thorsten Joachims, Adith Swaminathan, and Tobias Schnabel. 2017. Unbiased learning-to-rank with biased feedback. In Proceedings of the Tenth ACM International Conference on Web Search and Data Mining. ACM, 781--789.","DOI":"10.1145\/3018661.3018699","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-27","unstructured":"Dmitry Lagun and Eugene Agichtein. 2015. Inferring Searcher Attention by Jointly Modeling User Interactions and Content Salience Proceedings of the 38th International ACM Conference on Research and Development in Information Retrieval (SIGIR '15). ACM, New York, NY, USA, 483--492. https:\/\/doi.org\/10.1145\/2766462.2767745"},{"key":"key-10.1145\/3178876.3186156-28","unstructured":"Dmitry Lagun and Mounia Lalmas. 2016. Understanding User Attention and Engagement in Online News Reading Proceedings of the Ninth ACM International Conference on Web Search and Data Mining (WSDM '16)."},{"key":"key-10.1145\/3178876.3186156-29","unstructured":"Mounia Lalmas, Heather O'Brien, and Elad Yom-Tov. 2014. Measuring user engagement. Synthesis Lectures on Information Concepts, Retrieval, and Services, Vol. 6, 4 (2014), 1--132.","DOI":"10.2200\/S00605ED1V01Y201410ICR038","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-30","unstructured":"D Lekka, A Tselebis, D Bratis, G Zafeiropoulos, D Nikoviotis, A Karkanias, K Syrigos, and G Moussas. [n. d.]. 1731--The relationship between pain symptoms, anxiety and perceived family support in lung cancer patients. European Psychiatry Vol. 28 (. [n. d.]), 1."},{"key":"key-10.1145\/3178876.3186156-31","unstructured":"Lori McCay-Peet, Mounia Lalmas, and Vidhya Navalpakkam. 2012. On Saliency, Affect and Focused Attention. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 541--550. https:\/\/doi.org\/10.1145\/2207676.2207751","DOI":"10.1145\/2207676.2207751","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-32","unstructured":"Vidhya Navalpakkam, LaDawn Jentzsch, Rory Sayres, Sujith Ravi, Amr Ahmed, and Alex Smola. 2013. Measurement and modeling of eye-mouse behavior in the presence of nonlinear page layouts Proceedings of the 22nd international conference on World Wide Web. ACM, 953--964."},{"key":"key-10.1145\/3178876.3186156-33","unstructured":"James A O'Brien and George Marakas. 2005. Introduction to information systems. McGraw-Hill, Inc."},{"key":"key-10.1145\/3178876.3186156-34","unstructured":"Patricia R Recupero, Samara E Harms, and Jeffrey M Noble. 2008. Googling suicide: surfing for suicide information on the Internet. The Journal of clinical psychiatry (2008)."},{"key":"key-10.1145\/3178876.3186156-35","unstructured":"Jitender Sareen, Tanya Houlahan, Brian J Cox, and Gordon JG Asmundson. 2005. Anxiety disorders associated with suicidal ideation and suicide attempts in the National Comorbidity Survey. The Journal of nervous and mental disease Vol. 193, 7 (2005), 450--454.","DOI":"10.1097\/01.nmd.0000168263.89652.6b","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-36","unstructured":"Charles D Spielberger, Fernando Gonzalez-Reigosa, Angel Martinez-Urrutia, Luiz FS Natalicio, and Diana S Natalicio. 2017. The state-trait anxiety inventory. Interamerican Journal of Psychology Vol. 5, 3 &#38; 4 (2017)."},{"key":"key-10.1145\/3178876.3186156-37","unstructured":"Charles D Spielberger and Sumner J Sydeman. 1994. State-Trait Anxiety Inventory and State-Trait Anger Expression Inventory. (1994)."},{"key":"key-10.1145\/3178876.3186156-38","unstructured":"Hangwi Tang and Jennifer Hwee Kwoon Ng. 2006. Googling for a diagnosis-use of Google as a diagnostic aid: internet based study. Bmj, Vol. 333, 7579 (2006), 1143--1145.","DOI":"10.1136\/bmj.39003.640567.AE","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-39","unstructured":"Benedikt Till and Thomas Niederkrotenthaler. 2014. Surfing for suicide methods and help: content analysis of websites retrieved with search engines in Austria and the United States. The Journal of clinical psychiatry Vol. 75, 8 (2014), 886--892.","DOI":"10.4088\/JCP.13m08861","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-40","unstructured":"Ryen White and Eric Horvitz. 2013. From web search to healthcare utilization: privacy sensitive studies from mobile data. Journal of the American Medical Informatics Association, Vol. 20, 1 (2013), 61--68.","DOI":"10.1136\/amiajnl-2011-000765","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-41","unstructured":"Ryen W White and Eric Horvitz. 2009. Cyberchondria: studies of the escalation of medical concerns in web search. ACM Transactions on Information Systems (TOIS), Vol. 27, 4 (2009), 23."},{"key":"key-10.1145\/3178876.3186156-42","unstructured":"Ryen W White and Eric Horvitz. 2010. Web to World: Predicting transitions from self-diagnosis to the pursuit of local medical assistance in web search. In AMIA Annual Symposium Proceedings, Vol. Vol. 2010. American Medical Informatics Association, 882."},{"key":"key-10.1145\/3178876.3186156-43","unstructured":"Elad Yom-Tov. 2016. Crowdsourced Health: How What You Do on the Internet Will Improve Medicine. Mit Press.","DOI":"10.7551\/mitpress\/9780262034500.001.0001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186156-44","unstructured":"Elad Yom-Tov, Diana Borsa, Andrew C Hayward, Rachel A McKendry, and Ingemar J Cox. 2015. Automatic identification of Web-based risk markers for health events. Journal of medical Internet research Vol. 17, 1 (2015)."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186156&ftid=1957496&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:54:33Z","timestamp":1523638473000},"score":1.0,"subtitle":["Evidence From Large-Scale Mouse Tracking"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":44,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186156","relation":{"cites":[]}}}