{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719584},"publisher-location":"New York, New York, USA","reference-count":35,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186354","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Netizen-Style Commenting on Fashion Photos"],"prefix":"10.1145","author":[{"given":"Wen Hua","family":"Lin","sequence":"first","affiliation":[{"name":"National Taiwan University, Taipei, Taiwan Roc"}]},{"given":"Kuan-Ting","family":"Chen","sequence":"additional","affiliation":[{"name":"National Taiwan University, Taipei, Taiwan Roc"}]},{"given":"Hung Yueh","family":"Chiang","sequence":"additional","affiliation":[{"name":"National Taiwan University, Taipei, Taiwan Roc"}]},{"given":"Winston","family":"Hsu","sequence":"additional","affiliation":[{"name":"National Taiwan University, Taipei, Taiwan Roc"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186354-1","unstructured":"Lisa Anne Hendricks, Subhashini Venugopalan, Marcus Rohrbach, Raymond Mooney, Kate Saenko, and Trevor Darrell. 2016. Deep compositional captioning: Describing novel object categories without paired training data. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 1--10.","DOI":"10.1109\/CVPR.2016.8","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-2","unstructured":"David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of machine Learning research Vol. 3, Jan (2003), 993--1022."},{"key":"key-10.1145\/3184558.3186354-3","unstructured":"Olivier Chapelle, Thorsten Joachims, Filip Radlinski, and Yisong Yue. 2012. Large-scale validation and analysis of interleaved search evaluation. ACM Transactions on Information Systems (TOIS) Vol. 30, 1 (2012), 6.","DOI":"10.1145\/2094072.2094078","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-4","unstructured":"KuanTing Chen, Kezhen Chen, Peizhong Cong, Winston H Hsu, and Jiebo Luo. 2015. Who are the devils wearing prada in new york city Proceedings of the 23rd ACM international conference on Multimedia. ACM, 177--180."},{"key":"key-10.1145\/3184558.3186354-5","unstructured":"Minghai Chen, Guiguang Ding, Sicheng Zhao, Hui Chen, Qiang Liu, and Jungong Han. 2017. Reference Based LSTM for Image Captioning. In AAAI. 3981--3987."},{"key":"key-10.1145\/3184558.3186354-6","unstructured":"Jia Deng, Alexander Berg, Kai Li, and Li Fei-Fei. 2010. What does classifying more than 10,000 image categories tell us ECCV 2010 (2010), 71--84."},{"key":"key-10.1145\/3184558.3186354-7","unstructured":"Jeffrey Donahue, Lisa Anne Hendricks, Sergio Guadarrama, Marcus Rohrbach, Subhashini Venugopalan, Kate Saenko, and Trevor Darrell. 2015. Long-term recurrent convolutional networks for visual recognition and description Proceedings of the IEEE conference on computer vision and pattern recognition. 2625--2634."},{"key":"key-10.1145\/3184558.3186354-8","unstructured":"Hao Fang, Saurabh Gupta, Forrest Iandola, Rupesh K Srivastava, Li Deng, Piotr Doll&#225;r, Jianfeng Gao, Xiaodong He, Margaret Mitchell, John C Platt, et almbox. 2015. From captions to visual concepts and back. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1473--1482.","DOI":"10.1109\/CVPR.2015.7298754","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-9","unstructured":"Centre for Retail Research. 2017. Online Retailing: Britain, Europe, US and Canada 2017. www.retailresearch.org\/onlineretailing.php. (2017). Accessed: 2018-01--25."},{"key":"key-10.1145\/3184558.3186354-10","unstructured":"M Hadi Kiapour, Xufeng Han, Svetlana Lazebnik, Alexander C Berg, and Tamara L Berg. 2015. Where to buy it: Matching street clothing photos in online shops Proceedings of the IEEE International Conference on Computer Vision. 3343--3351."},{"key":"key-10.1145\/3184558.3186354-11","unstructured":"Shintami C Hidayati, Kai-Lung Hua, Wen-Huang Cheng, and Shih-Wei Sun. 2014. What are the fashion trends in new york. In Proceedings of the 22nd ACM international conference on Multimedia. ACM, 197--200."},{"key":"key-10.1145\/3184558.3186354-12","unstructured":"Zhiheng Huang, Wei Xu, and Kai Yu. 2015. Bidirectional LSTM-CRF models for sequence tagging. arXiv preprint arXiv:1508.01991 (2015)."},{"key":"key-10.1145\/3184558.3186354-13","unstructured":"Anjuli Kannan, Karol Kurach, Sujith Ravi, Tobias Kaufmann, Andrew Tomkins, Balint Miklos, Greg Corrado, L&#225;szl&#243; Luk&#225;cs, Marina Ganea, Peter Young, et almbox. 2016. Smart reply: Automated response suggestion for email. arXiv preprint arXiv:1606.04870 (2016)."},{"key":"key-10.1145\/3184558.3186354-14","unstructured":"Andrej Karpathy and Li Fei-Fei. 2015. Deep visual-semantic alignments for generating image descriptions Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 3128--3137."},{"key":"key-10.1145\/3184558.3186354-15","unstructured":"Jiwei Li, Michel Galley, Chris Brockett, Jianfeng Gao, and Bill Dolan. 2015. A diversity-promoting objective function for neural conversation models. arXiv preprint arXiv:1510.03055 (2015)."},{"key":"key-10.1145\/3184558.3186354-16","unstructured":"Linghui Li, Sheng Tang, Lixi Deng, Yongdong Zhang, and Qi Tian. 2017. Image Caption with Global-Local Attention. In AAAI. 4133--4139."},{"key":"key-10.1145\/3184558.3186354-17","unstructured":"Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Doll&#225;r, and C Lawrence Zitnick. 2014. Microsoft coco: Common objects in context. In European Conference on Computer Vision. Springer, 740--755.","DOI":"10.1007\/978-3-319-10602-1_48","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-18","unstructured":"Chenxi Liu, Junhua Mao, Fei Sha, and Alan L Yuille. 2017. Attention Correctness in Neural Image Captioning. In AAAI. 4176--4182."},{"key":"key-10.1145\/3184558.3186354-19","unstructured":"Si Liu, Jiashi Feng, Csaba Domokos, Hui Xu, Junshi Huang, Zhenzhen Hu, and Shuicheng Yan. 2014. Fashion parsing with weak color-category labels. IEEE Transactions on Multimedia Vol. 16, 1 (2014), 253--265.","DOI":"10.1109\/TMM.2013.2285526","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-20","unstructured":"Si Liu, Jiashi Feng, Zheng Song, Tianzhu Zhang, Hanqing Lu, Changsheng Xu, and Shuicheng Yan. 2012 a. Hi, magic closet, tell me what to wear!. In Proceedings of the 20th ACM international conference on Multimedia. ACM, 619--628.","DOI":"10.1145\/2393347.2393433","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-21","unstructured":"Si Liu, Zheng Song, Guangcan Liu, Changsheng Xu, Hanqing Lu, and Shuicheng Yan. 2012 b. Street-to-shop: Cross-scenario clothing retrieval via parts alignment and auxiliary set Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. IEEE, 3330--3337."},{"key":"key-10.1145\/3184558.3186354-22","unstructured":"Ziwei Liu, Ping Luo, Shi Qiu, Xiaogang Wang, and Xiaoou Tang. 2016. Deepfashion: Powering robust clothes recognition and retrieval with rich annotations. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 1096--1104.","DOI":"10.1109\/CVPR.2016.124","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-23","unstructured":"Jiasen Lu, Caiming Xiong, Devi Parikh, and Richard Socher. 2016. Knowing When to Look: Adaptive Attention via A Visual Sentinel for Image Captioning. arXiv preprint arXiv:1612.01887 (2016)."},{"key":"key-10.1145\/3184558.3186354-24","unstructured":"Junhua Mao, Wei Xu, Yi Yang, Jiang Wang, Zhiheng Huang, and Alan Yuille. 2014. Deep captioning with multimodal recurrent neural networks (m-rnn). arXiv preprint arXiv:1412.6632 (2014)."},{"key":"key-10.1145\/3184558.3186354-25","unstructured":"Jonghwan Mun, Minsu Cho, and Bohyung Han. 2017. Text-Guided Attention Model for Image Captioning. In AAAI. 4233--4239."},{"key":"key-10.1145\/3184558.3186354-26","unstructured":"Nirmaldasan. 2008. The Average Sentence Length. https:\/\/strainindex.wordpress.com\/2008\/07\/28\/the-average-sentence-length\/. (July. 2008). Accessed: 2017-04-06."},{"key":"key-10.1145\/3184558.3186354-27","unstructured":"Kishore Papineni, Salim Roukos, Todd Ward, and Wei-Jing Zhu. 2002. BLEU: a method for automatic evaluation of machine translation Proceedings of the 40th annual meeting on association for computational linguistics. Association for Computational Linguistics, 311--318."},{"key":"key-10.1145\/3184558.3186354-28","unstructured":"Cyrus Rashtchian, Peter Young, Micah Hodosh, and Julia Hockenmaier. 2010. Collecting image annotations using Amazon's Mechanical Turk Proceedings of the NAACL HLT 2010 Workshop on Creating Speech and Language Data with Amazon's Mechanical Turk. Association for Computational Linguistics, 139--147."},{"key":"key-10.1145\/3184558.3186354-29","unstructured":"Louis Shao, Stephan Gouws, Denny Britz, Anna Goldie, Brian Strope, and Ray Kurzweil. 2017. Generating Long and Diverse Responses with Neural Conversation Models. arXiv preprint arXiv:1701.03185 (2017)."},{"key":"key-10.1145\/3184558.3186354-30","unstructured":"Edgar Simo-Serra, Sanja Fidler, Francesc Moreno-Noguer, and Raquel Urtasun. 2015. Neuroaesthetics in fashion: Modeling the perception of fashionability Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 869--877."},{"key":"key-10.1145\/3184558.3186354-31","unstructured":"Subhashini Venugopalan, Lisa Anne Hendricks, Marcus Rohrbach, Raymond Mooney, Trevor Darrell, and Kate Saenko. 2017. Captioning images with diverse objects. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition.","DOI":"10.1109\/CVPR.2017.130","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-32","unstructured":"Ashwin K Vijayakumar, Michael Cogswell, Ramprasath R Selvaraju, Qing Sun, Stefan Lee, David Crandall, and Dhruv Batra. 2016. Diverse Beam Search: Decoding Diverse Solutions from Neural Sequence Models. arXiv preprint arXiv:1610.02424 (2016)."},{"key":"key-10.1145\/3184558.3186354-33","unstructured":"Oriol Vinyals, Alexander Toshev, Samy Bengio, and Dumitru Erhan. 2015. Show and tell: A neural image caption generator. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 3156--3164.","DOI":"10.1109\/CVPR.2015.7298935","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-34","unstructured":"Cheng Wang, Haojin Yang, Christian Bartz, and Christoph Meinel. 2016. Image captioning with deep bidirectional LSTMs. In Proceedings of the 2016 ACM on Multimedia Conference. ACM, 988--997.","DOI":"10.1145\/2964284.2964299","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186354-35","unstructured":"Kelvin Xu, Jimmy Ba, Ryan Kiros, Kyunghyun Cho, Aaron C Courville, Ruslan Salakhutdinov, Richard S Zemel, and Yoshua Bengio. 2015. Show, Attend and Tell: Neural Image Caption Generation with Visual Attention. ICML, Vol. Vol. 14. 77--81."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186354&ftid=1958165&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T19:04:18Z","timestamp":1524078258000},"score":1.0,"subtitle":["Dataset and Diversity Measures"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":35,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186354","relation":{"cites":[]}}}