{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:27Z","timestamp":1523998767413},"publisher-location":"New York, New York, USA","reference-count":44,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186022","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Matching Natural Language Sentences with Hierarchical Sentence Factorization"],"prefix":"10.1145","author":[{"given":"Bang","family":"Liu","sequence":"first","affiliation":[{"name":"University of Alberta, Edmonton, AB, Canada"}]},{"given":"Ting","family":"Zhang","sequence":"additional","affiliation":[{"name":"University of Alberta, Edmonton, AB, Canada"}]},{"given":"Fred X.","family":"Han","sequence":"additional","affiliation":[{"name":"University of Alberta, Edmonton, AB, Canada"}]},{"given":"Di","family":"Niu","sequence":"additional","affiliation":[{"name":"University of Alberta, Edmonton, AB, Canada"}]},{"given":"Kunfeng","family":"Lai","sequence":"additional","affiliation":[{"name":"Mobile Internet Group, Tencent, Shenzhen, China"}]},{"given":"Yu","family":"Xu","sequence":"additional","affiliation":[{"name":"Mobile Internet Group, Tencent, Shenzhen, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186022-1","unstructured":"Fritz Albregtsen et al. 2008. Statistical texture measures computed from gray level coocurrence matrices. Image processing laboratory, department of informatics, university of oslo Vol. 5 (2008)."},{"key":"key-10.1145\/3178876.3186022-2","unstructured":"Collin F Baker, Charles J Fillmore, and John B Lowe. 1998. The berkeley framenet project. In Proceedings of the 36th Annual Meeting of the Association for Computational Linguistics and 17th International Conference on Computational Linguistics-Volume 1. Association for Computational Linguistics, 86--90."},{"key":"key-10.1145\/3178876.3186022-3","unstructured":"Laura Banarescu, Claire Bonial, Shu Cai, Madalina Georgescu, Kira Griffitt, Ulf Hermjakob, Kevin Knight, Philipp Koehn, Martha Palmer, and Nathan Schneider. 2012. Abstract meaning representation (AMR) 1.0 specification Parsing on Freebase from Question-Answer Pairs. In Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing. Seattle: ACL. 1533--1544."},{"key":"key-10.1145\/3178876.3186022-4","unstructured":"Laura Banarescu, Claire Bonial, Shu Cai, Madalina Georgescu, Kira Griffitt, Ulf Hermjakob, Kevin Knight, Philipp Koehn, Martha Palmer, and Nathan Schneider. 2013. Abstract meaning representation for sembanking. In Proceedings of the 7th Linguistic Annotation Workshop and Interoperability with Discourse. 178--186."},{"key":"key-10.1145\/3178876.3186022-5","unstructured":"Petr Baudivs, Jan Pichl, Tom&#225;vs Vyskovcil, and Jan vSediv&#7923;. 2016. Sentence pair scoring: Towards unified framework for text comprehension. arXiv preprint arXiv:1603.06127 (2016)."},{"key":"key-10.1145\/3178876.3186022-6","unstructured":"Jonathan Berant and Percy Liang. 2014. Semantic Parsing via Paraphrasing.. In ACL (1). 1415--1425.","DOI":"10.3115\/v1\/P14-1133","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186022-7","unstructured":"David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of machine Learning research Vol. 3, Jan (2003), 993--1022."},{"key":"key-10.1145\/3178876.3186022-8","unstructured":"Peter F Brown, Vincent J Della Pietra, Stephen A Della Pietra, and Robert L Mercer. 1993. The mathematics of statistical machine translation: Parameter estimation. Computational linguistics Vol. 19, 2 (1993), 263--311."},{"key":"key-10.1145\/3178876.3186022-9","unstructured":"Daniel Cer, Mona Diab, Eneko Agirre, Inigo Lopez-Gazpio, and Lucia Specia. 2017. SemEval-2017 Task 1: Semantic Textual Similarity-Multilingual and Cross-lingual Focused Evaluation. arXiv preprint arXiv:1708.00055 (2017)."},{"key":"key-10.1145\/3178876.3186022-10","unstructured":"Franccois Chollet et almbox.. 2015. Keras. https:\/\/github.com\/fchollet\/keras. (2015)."},{"key":"key-10.1145\/3178876.3186022-11","unstructured":"Marco Damonte, Shay B Cohen, and Giorgio Satta. 2016. An incremental parser for abstract meaning representation. arXiv preprint arXiv:1608.06111 (2016)."},{"key":"key-10.1145\/3178876.3186022-12","unstructured":"Scott Deerwester, Susan T Dumais, George W Furnas, Thomas K Landauer, and Richard Harshman. 1990. Indexing by latent semantic analysis. Journal of the American society for information science Vol. 41, 6 (1990), 391.","DOI":"10.1002\/(SICI)1097-4571(199009)41:6<391::AID-ASI1>3.0.CO;2-9","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186022-13","unstructured":"Jeffrey Flanigan, Sam Thomson, Jaime G Carbonell, Chris Dyer, and Noah A Smith. 2014. A discriminative graph-based parser for the abstract meaning representation. (2014)."},{"key":"key-10.1145\/3178876.3186022-14","unstructured":"Ralph Grishman. 1997. Information extraction: Techniques and challenges. In Information extraction a multidisciplinary approach to an emerging information technology. Springer, 10--27.","DOI":"10.1007\/3-540-63438-X_2","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186022-15","unstructured":"Hua He and Jimmy J Lin. 2016. Pairwise Word Interaction Modeling with Deep Neural Networks for Semantic Similarity Measurement.. In HLT-NAACL. 937--948."},{"key":"key-10.1145\/3178876.3186022-16","unstructured":"Baotian Hu, Zhengdong Lu, Hang Li, and Qingcai Chen. 2014. Convolutional neural network architectures for matching natural language sentences Advances in neural information processing systems. 2042--2050."},{"key":"key-10.1145\/3178876.3186022-17","unstructured":"Armand Joulin, Edouard Grave, Piotr Bojanowski, and Tomas Mikolov. 2016. Bag of tricks for efficient text classification. arXiv preprint arXiv:1607.01759 (2016)."},{"key":"key-10.1145\/3178876.3186022-18","unstructured":"Paul Kingsbury and Martha Palmer. 2002. From TreeBank to PropBank.. In LREC. 1989--1993."},{"key":"key-10.1145\/3178876.3186022-19","unstructured":"Philip A Knight. 2008. The Sinkhorn--Knopp algorithm: convergence and applications. SIAM J. Matrix Anal. Appl. Vol. 30, 1 (2008), 261--275.","DOI":"10.1137\/060659624","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186022-20","unstructured":"Alex Krizhevsky, Ilya Sutskever, and Geoffrey E Hinton. 2012. Imagenet classification with deep convolutional neural networks Advances in neural information processing systems. 1097--1105."},{"key":"key-10.1145\/3178876.3186022-21","unstructured":"Matt Kusner, Yu Sun, Nicholas Kolkin, and Kilian Weinberger. 2015. From word embeddings to document distances. In International Conference on Machine Learning. 957--966."},{"key":"key-10.1145\/3178876.3186022-22","unstructured":"Marco Marelli, Stefano Menini, Marco Baroni, Luisa Bentivogli, Raffaella Bernardi, and Roberto Zamparelli. 2014. A SICK cure for the evaluation of compositional distributional semantic models. LREC. 216--223."},{"key":"key-10.1145\/3178876.3186022-23","unstructured":"Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient estimation of word representations in vector space. arXiv preprint arXiv:1301.3781 (2013)."},{"key":"key-10.1145\/3178876.3186022-24","unstructured":"Jonas Mueller and Aditya Thyagarajan. 2016. Siamese Recurrent Architectures for Learning Sentence Similarity. AAAI. 2786--2792."},{"key":"key-10.1145\/3178876.3186022-25","unstructured":"Paul Neculoiu, Maarten Versteegh, Mihai Rotaru, and Textkernel BV Amsterdam. 2016. Learning Text Similarity with Siamese Recurrent Networks. ACL 2016 (2016), 148."},{"key":"key-10.1145\/3178876.3186022-26","unstructured":"Georgios Paltoglou and Mike Thelwall. 2010. A study of information retrieval weighting schemes for sentiment analysis Proceedings of the 48th annual meeting of the association for computational linguistics. Association for Computational Linguistics, 1386--1395."},{"key":"key-10.1145\/3178876.3186022-27","unstructured":"Liang Pang, Yanyan Lan, Jiafeng Guo, Jun Xu, Shengxian Wan, and Xueqi Cheng. 2016. Text Matching as Image Recognition.. In AAAI. 2793--2799."},{"key":"key-10.1145\/3178876.3186022-28","unstructured":"Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532--1543.","DOI":"10.3115\/v1\/D14-1162","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186022-29","unstructured":"Luca Ponzanelli, Andrea Mocci, and Michele Lanza. 2015. Summarizing complex development artifacts by mining heterogeneous data Proceedings of the 12th Working Conference on Mining Software Repositories. IEEE Press, 401--405."},{"key":"key-10.1145\/3178876.3186022-30","unstructured":"Nima Pourdamghani, Yang Gao, Ulf Hermjakob, and Kevin Knight. 2014. Aligning English Strings with Abstract Meaning Representation Graphs. EMNLP. 425--429."},{"key":"key-10.1145\/3178876.3186022-31","unstructured":"Chris Quirk, Chris Brockett, and William Dolan. 2004. Monolingual machine translation for paraphrase generation Proceedings of the 2004 conference on empirical methods in natural language processing."},{"key":"key-10.1145\/3178876.3186022-32","unstructured":"Stephen E Robertson and Steve Walker. 1994. Some simple effective approximations to the 2-poisson model for probabilistic weighted retrieval. In Proceedings of the 17th annual international ACM SIGIR conference on Research and development in information retrieval. Springer-Verlag New York, Inc., 232--241."},{"key":"key-10.1145\/3178876.3186022-33","unstructured":"Yossi Rubner, Carlo Tomasi, and Leonidas J Guibas. 2000. The earth mover's distance as a metric for image retrieval. International journal of computer vision Vol. 40, 2 (2000), 99--121.","DOI":"10.1023\/A:1026543900054","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186022-34","unstructured":"Alexandre Salle, Marco Idiart, and Aline Villavicencio. 2016. Enhancing the LexVec Distributed Word Representation Model Using Positional Contexts and External Memory. arXiv preprint arXiv:1606.01283 (2016)."},{"key":"key-10.1145\/3178876.3186022-35","unstructured":"Aliaksei Severyn and Alessandro Moschitti. 2015. Learning to rank short text pairs with convolutional deep neural networks Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval. ACM, 373--382."},{"key":"key-10.1145\/3178876.3186022-36","unstructured":"Yang Shao. 2017. HCTI at SemEval-2017 Task 1: Use convolutional neural network to evaluate semantic textual similarity. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval-2017). 130--133.","DOI":"10.18653\/v1\/S17-2016","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186022-37","unstructured":"Bing Su and Gang Hua. 2017. Order-preserving wasserstein distance for sequence matching Proc. IEEE Conf. Comput. Vis. Pattern Recognit. 1049--1057."},{"key":"key-10.1145\/3178876.3186022-38","unstructured":"Martin Sundermeyer, Ralf Schl&#252;ter, and Hermann Ney. 2012. LSTM neural networks for language modeling. In Thirteenth Annual Conference of the International Speech Communication Association."},{"key":"key-10.1145\/3178876.3186022-39","unstructured":"Chuan Wang, Nianwen Xue, and Sameer Pradhan. 2015. Boosting Transition-based AMR Parsing with Refined Actions and Auxiliary Analyzers. ACL (2). 857--862."},{"key":"key-10.1145\/3178876.3186022-40","unstructured":"Shuohang Wang and Jing Jiang. 2016. A Compare-Aggregate Model for Matching Text Sequences. arXiv preprint arXiv:1611.01747 (2016)."},{"key":"key-10.1145\/3178876.3186022-41","unstructured":"Zhiguo Wang, Wael Hamza, and Radu Florian. 2017. Bilateral multi-perspective matching for natural language sentences. arXiv preprint arXiv:1702.03814 (2017)."},{"key":"key-10.1145\/3178876.3186022-42","unstructured":"Wikipedia. 2017. Spearman's rank correlation coefficient -- Wikipedia, The Free Encyclopedia. (2017). https:\/\/en.wikipedia.org\/w\/index.php?title=Spearman%27s_rank_correlation_coefficient&#38;oldid=801404677 [Online; accessed 31-October-2017]."},{"key":"key-10.1145\/3178876.3186022-43","unstructured":"Ho Chung Wu, Robert Wing Pong Luk, Kam Fai Wong, and Kui Lam Kwok. 2008. Interpreting tf-idf term weights as making relevance decisions. ACM Transactions on Information Systems (TOIS) Vol. 26, 3 (2008), 13.","DOI":"10.1145\/1361684.1361686","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186022-44","unstructured":"Lei Yu, Karl Moritz Hermann, Phil Blunsom, and Stephen Pulman. 2014. Deep learning for answer sentence selection. arXiv preprint arXiv:1412.1632 (2014)."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186022&ftid=1957429&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:38:58Z","timestamp":1523641138000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":44,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186022","relation":{"cites":[]}}}