{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:26Z","timestamp":1523998766962},"publisher-location":"New York, New York, USA","reference-count":43,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"funder":[{"name":"the Sichuan Hi-Tech industrialization program","award":["2017GZ0308"]},{"name":"the General Equipment Department Foundation","award":["61403120102"]},{"name":"NSFC","award":["61772117","61133016"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186001","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Content Attention Model for Aspect Based Sentiment Analysis"],"prefix":"10.1145","author":[{"given":"Qiao","family":"Liu","sequence":"first","affiliation":[{"name":"University of Electronic Science and Technology of China, Chengdu, China"}]},{"given":"Haibin","family":"Zhang","sequence":"additional","affiliation":[{"name":"University of Electronic Science and Technology of China, Chengdu, China"}]},{"given":"Yifu","family":"Zeng","sequence":"additional","affiliation":[{"name":"University of Electronic Science and Technology of China, Chengdu, China"}]},{"given":"Ziqi","family":"Huang","sequence":"additional","affiliation":[{"name":"University of Electronic Science and Technology of China, Chengdu, China"}]},{"given":"Zufeng","family":"Wu","sequence":"additional","affiliation":[{"name":"University of Electronic Science and Technology of China, Chengdu, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186001-1","unstructured":"Yossi Adi, Einat Kermany, Yonatan Belinkov, Ofer Lavi, and Yoav Goldberg. 2017. Fine-grained analysis of sentence embeddings using auxiliary prediction tasks. In Proc. of the 5th ICLR. CoRR, Toulon, France."},{"key":"key-10.1145\/3178876.3186001-2","unstructured":"Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2015. Neural machine translation by jointly learning to align and translate. In Proc. of the 3rd International Conference on Learning Representations. CoRR, Scottsdale, USA."},{"key":"key-10.1145\/3178876.3186001-3","unstructured":"Yoshua Bengio, Aaron Courville, and Pascal Vincent. 2013. Representation learning: A review and new perspectives. IEEE Transactions on Pattern Analysis and Machine Intelligence 35, 8 (2013), 1798--1828.","DOI":"10.1109\/TPAMI.2013.50","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-4","unstructured":"Peng Chen, Zhongqian Sun, Lidong Bing, and Wei Yang. 2017. Recurrent attention network on memory for aspect sentiment analysis. In Proc. of the 2017 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, Copenhagen, Denmark, 463--472.","DOI":"10.18653\/v1\/D17-1047","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-5","unstructured":"Zhiyuan Chen, Arjun Mukherjee, and Bing Liu. 2014. Aspect extraction with automated prior knowledge learning. In Proc. of the 52nd Annual Meeting of the Association for Computational Linguistics. ACL, Baltimore, Maryland, 347--358.","DOI":"10.3115\/v1\/P14-1033","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-6","unstructured":"Kyunghyun Cho, Bart van Merri&#235;nboer, Dzmitry Bahdanau, and Yoshua Bengio. 2014. On the properties of neural machine translation: encoder-decoder ap- proaches. In Proc. of 8th Workshop on Syntax, Semantics and Structure in Statistical Translation. Association for Computational Linguistics, Doha, Qatar, 103--111."},{"key":"key-10.1145\/3178876.3186001-7","unstructured":"Li Dong, Furu Wei, Chuanqi Tan, Duyu Tang, Ming Zhou, and Ke Xu. 2014. Adaptive recursive neural network for target-dependent twitter sentiment classification. In Proc. of the 52nd Annual Meeting of the Association for Computational Linguistics (Short Papers). ACL, Baltimore, Maryland, 49--54.","DOI":"10.3115\/v1\/P14-2009","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-8","unstructured":"Alex Graves, Greg Wayne, Malcolm Reynolds, Tim Harley, Ivo Danihelka, Agnieszka Grabska-Barwi'ska, Sergio G&#243;mez Colmenarejo, Edward Grefenstette, Tiago Ramalho, John Agapiou, Adri&#224; Puigdom&#232;nech Badia, Karl Moritz Hermann, Yori Zwols, Georg Ostrovski, Adam Cain, Helen King, Christopher Summerfield, Phil Blunsom, Koray Kavukcuoglu, and Demis Hassabis. 2016. Hybrid computing using a neural network with dynamic external memory. Nature 538, 7626 (2016), 471--476.","DOI":"10.1038\/nature20101","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-9","unstructured":"Karl Moritz Hermann, Tomas Kocisky, Edward Grefenstette, Lasse Espeholt, Will Kay, Mustafa Suleyman, and Phil Blunsom. 2015. Teaching machines to read and comprehend. In Advances in Neural Information Processing Systems 28. Curran Associates, Inc., Montr&#233;al, Canada, 1693--1701."},{"key":"key-10.1145\/3178876.3186001-10","unstructured":"Ozan Irsoy and Claire Cardie. 2014. Opinion mining with deep recurrent neural networks. In Proc. of the 2014 Conference on Empirical Methods in Natural Language Processing. ACL, Doha, Qatar, 720--728.","DOI":"10.3115\/v1\/D14-1080","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-11","unstructured":"Long Jiang, Mo Yu, Ming Zhou, Xiaohua Liu, and Tiejun Zhao. 2011. Target-dependent twitter sentiment classification. In Proc. of the 49th Annual Meeting of the Association for Computational Linguistics. ACL, Portland, Oregon, USA, 151--160."},{"key":"key-10.1145\/3178876.3186001-12","unstructured":"Yoon Kim, Carl Denton, Luong Hoang, and Alexander M Rush. 2017. Structured attention networks. In Proc. of the 5th International Conference on Learning Representations. CoRR, Toulon, France."},{"key":"key-10.1145\/3178876.3186001-13","unstructured":"Svetlana Kiritchenko, Xiaodan Zhu, Colin Cherry, and Saif M. Mohammad. 2014. NRC-Canada-2014: Detecting aspects and sentiment in customer reviews. In Proc. of the 8th International Workshop on Semantic Evaluation. Dublin, Ireland, 437--442.","DOI":"10.3115\/v1\/S14-2076","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-14","unstructured":"Ankit Kumar, Ozan Irsoy, Peter Ondruska, Mohit Iyyer, James Bradbury, Ishaan Gulrajani, Victor Zhong, Romain Paulus, and Richard Socher. 2016. Ask me anything: Dynamic memory networks for natural language processing. In Proc. of The 33rd International Conference on Machine Learning, Vol. 48. PMLR, New York, NY, USA, 1378--1387."},{"key":"key-10.1145\/3178876.3186001-15","unstructured":"Yann LeCun, Yoshua Bengio, and Geoffrey Hinton. 2015. Deep learning. Nature 521, 7553 (2015), 436--444.","DOI":"10.1038\/nature14539","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-16","unstructured":"Bing Liu. 2012. Sentiment analysis and opinion mining. Synthesis Lectures on Human Language Technologies 5, 1 (2012), 1--167.","DOI":"10.2200\/S00416ED1V01Y201204HLT016","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-17","unstructured":"Yue Lu and Chengxiang Zhai. 2008. Opinion integration through semi-supervised topic modeling. In Proc. of the 17th International Conference on World Wide Web. ACM, Beijing, China, 121--130.","DOI":"10.1145\/1367497.1367514","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-18","unstructured":"Minh-Thang Luong, Hieu Pham, and Christopher D Manning. 2015. Effective approaches to attention-based neural machine translation. In Proc. of the 2015 Conference on Empirical Methods in Natural Language Processing. ACL, Lisbon, Portugal, 1412--1421."},{"key":"key-10.1145\/3178876.3186001-19","unstructured":"Dehong Ma, Sujian Li, Xiaodong Zhang, and Houfeng Wang. 2017. Interactive attention networks for aspect-level sentiment classification. In Proc. of the Twenty- Sixth IJCAI. Melbourne, Australia, 4068--4074.","DOI":"10.24963\/ijcai.2017\/568","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-20","unstructured":"Qiaozhu Mei, Xu Ling, Matthew Wondra, Hang Su, and ChengXiang Zhai. 2007. Topic sentiment mixture: modeling facets and opinions in weblogs. In Proc. of the 16th international conference on World Wide Web. ACM, Banff, Alberta, Canada, 171--180.","DOI":"10.1145\/1242572.1242596","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-21","unstructured":"Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in Neural Information Processing Systems 26. Curran Associates, Inc., Lake Tahoe, USA, 3111--3119."},{"key":"key-10.1145\/3178876.3186001-22","unstructured":"Samaneh Moghaddam and Martin Ester. 2013. The FLDA model for aspect-based opinion mining: addressing the cold start problem. In Proc. of the 22nd International Conference on WWW. ACM, Rio de Janeiro, Brazil, 909--918.","DOI":"10.1145\/2488388.2488467","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-23","unstructured":"Thien Hai Nguyen and Kiyoaki Shirai. 2015. PhraseRNN: Phrase recursive neural network for aspect-based sentiment analysis. In Proc. of the 2015 Conference on Empirical Methods in Natural Language Processing. ACL, Lisbon, Portugal, 2509--2514."},{"key":"key-10.1145\/3178876.3186001-24","unstructured":"Jeffrey Pennington, Richard Socher, and Christopher D Manning. 2014. Glove: Global vectors for word representation. In Proc. of the 2014 Conference on Empirical Methods in Natural Language Processing. ACL, Doha, Qatar, 1532--1543."},{"key":"key-10.1145\/3178876.3186001-25","unstructured":"Maria Pontiki, Dimitris Galanis, John Pavlopoulos, Harris Papageorgiou, Ion Androutsopoulos, and Suresh Manandhar. 2014. Semeval-2014 task 4: Aspect based sentiment analysis. In Proc. of the 8th International Workshop on Semantic Evaluation. Dublin, Ireland, 27--35.","DOI":"10.3115\/v1\/S14-2004","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-26","unstructured":"Soujanya Poria, Erik Cambria, and Alexander Gelbukh. 2016. Aspect extraction for opinion mining with a deep convolutional neural network. Knowledge-Based Systems 108, Supplement C (2016), 42--49."},{"key":"key-10.1145\/3178876.3186001-27","unstructured":"Guang Qiu, Bing Liu, Jiajun Bu, and Chun Chen. 2011. Opinion word expansion and target extraction through double propagation. Computational Linguistics 37, 1 (2011), 9--27.","DOI":"10.1162\/coli_a_00034","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-28","unstructured":"Tim Rockt&#228;schel, Edward Grefenstette, Karl Moritz Hermann, Tom&#225;s Kocisk&#253;, and Phil Blunsom. 2016. Reasoning about entailment with neural attention. In Proc. of the 4th ICLR. San Juan, Puerto Rico."},{"key":"key-10.1145\/3178876.3186001-29","unstructured":"Sebastian Ruder, Parsa Ghaffari, and John G Breslin. 2016. A hierarchical model of reviews for aspect-based sentiment analysis. In Proc. of the 2016 Conference on Empirical Methods in Natural Language Processing. ACL, Austin, Texas, USA, 999--1005."},{"key":"key-10.1145\/3178876.3186001-30","unstructured":"Alexander M. Rush, Sumit Chopra, and Jason Weston. 2015. A neural attention model for sentence summarization. In Proc. of the 2015 Conference on EMNLP. ACL, Lisbon, Portugal, 379--389."},{"key":"key-10.1145\/3178876.3186001-31","unstructured":"Minjoon Seo, Aniruddha Kembhavi, Ali Farhadi, and Hannaneh Hajishirzi. 2017. Bi-directional attention flow for machine comprehension. In Proc. of the 5th International Conference on Learning Representations. CoRR, Toulon, France."},{"key":"key-10.1145\/3178876.3186001-32","unstructured":"Richard Socher, Danqi Chen, Christopher D Manning, and Andrew Y. Ng. 2013. Reasoning with neural tensor networks for knowledge base completion. In NIPS 2013. Curran Associates, Inc., Lake Tahoe, USA, 926--934."},{"key":"key-10.1145\/3178876.3186001-33","unstructured":"Kaisong Song, Ling Chen, Wei Gao, Shi Feng, Daling Wang, and Chengqi Zhang. 2016. PerSentiment: A personalized sentiment classification system for microblog users. In Proc. of the 25th International Conference Companion on World Wide Web. International World Wide Web Conferences Steering Committee, Montr&#233;al, Canada, 255--258.","DOI":"10.1145\/2872518.2890540","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-34","unstructured":"Sainbayar Sukhbaatar, Arthur Szlam, Jason Weston, and Rob Fergus. 2015. End-to-end memory networks. In Advances in Neural Information Processing Systems 28. Curran Associates, Inc., Montr&#233;al, Canada, 2440--2448."},{"key":"key-10.1145\/3178876.3186001-35","unstructured":"Yaming Sun, Lei Lin, Duyu Tang, Nan Yang, Zhenzhou Ji, and Xiaolong Wang. 2015. Modeling mention, context and entity with neural networks for entity disambiguation. In Proc. of the Twenty-Fourth International Joint Conference on Artificial Intelligence. Buenos Aires, Argentina, 1333--1339."},{"key":"key-10.1145\/3178876.3186001-36","unstructured":"Duyu Tang, Bing Qin, Xiaocheng Feng, and Ting Liu. 2016. Effective LSTMs for target-dependent sentiment classification. In Proc. of COLING 2016, the 26th International Conference on Computational Linguistics: Technical Papers. Osaka, Japan, 3298--3307."},{"key":"key-10.1145\/3178876.3186001-37","unstructured":"Duyu Tang, Bing Qin, and Ting Liu. 2016. Aspect level sentiment classification with deep memory network. In Proc. of the 2016 Conference on Empirical Methods in Natural Language Processing. ACL, Austin, Texas, USA, 214--224.","DOI":"10.18653\/v1\/D16-1021","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-38","unstructured":"Duyu Tang, Furu Wei, Nan Yang, Zhou Ming, Ting Liu, and Bing Qin. 2014. Learning sentiment-specific word embedding for twitter sentiment classification. In Proc. of the 52nd Annual Meeting of the Association for Computational Linguistics. ACL, Baltimore, Maryland, 1555--1565.","DOI":"10.3115\/v1\/P14-1146","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-39","unstructured":"Duy-Tin Vo and Yue Zhang. 2015. Target-dependent twitter sentiment classification with rich automatic features. In Proc. of the 24th International Joint Conference on Artificial Intelligence. Buenos Aires, Argentina, 1347--1353."},{"key":"key-10.1145\/3178876.3186001-40","unstructured":"Shuai Wang, Zhiyuan Chen, and Bing Liu. 2016. Mining aspect-specific opinion using a holistic lifelong topic model. In Proc. of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, Montr&#233;al, Canada, 167--176.","DOI":"10.1145\/2872427.2883086","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-41","unstructured":"Yequan Wang, Minlie Huang, Xiaoyan Zhu, and Li Zhao. 2016. Attention-based LSTM for aspect-level sentiment classification. In Proc. of the 2016 Conference on Empirical Methods in Natural Language Processing. ACL, Austin, Texas, USA, 606--615.","DOI":"10.18653\/v1\/D16-1058","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186001-42","unstructured":"Jason Weston, Sumit Chopra, and Antoine Bordes. 2015. Memory networks. In Proc. of the 3rd International Conference on Learning Representations. CoRR, Scottsdale, Arizona, USA."},{"key":"key-10.1145\/3178876.3186001-43","unstructured":"Meishan Zhang, Yue Zhang, and Duy-Tin Vo. 2016. Gated neural networks for targeted sentiment analysis. In Proc. of the Thirtieth AAAI. AAAI Press, Phoenix, Arizona, USA, 3087--3093."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186001&ftid=1957399&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:20:48Z","timestamp":1523640048000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":43,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186001","relation":{"cites":[]}}}