{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:58:52Z","timestamp":1523998732280},"publisher-location":"New York, New York, USA","reference-count":42,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"NSF","award":["IIS-1526499 CNS-1626432 and NSFC 61672313"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186053","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Multi-Task Pharmacovigilance Mining from Social Media Posts"],"prefix":"10.1145","author":[{"given":"Shaika","family":"Chowdhury","sequence":"first","affiliation":[{"name":"University of Illinois at Chicago, Chicago, IL, USA"}]},{"given":"Chenwei","family":"Zhang","sequence":"additional","affiliation":[{"name":"University of Illinois at Chicago, Chicago, IL, USA"}]},{"given":"Philip S.","family":"Yu","sequence":"additional","affiliation":[{"name":"University of Illinois at Chicago, Chicago, IL, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186053-1","unstructured":"Mart'&#305;n Abadi, Paul Barham, Jianmin Chen, Zhifeng Chen, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Geoffrey Irving, Michael Isard, et almbox. . 2016. TensorFlow: A System for Large-Scale Machine Learning. OSDI, Vol. Vol. 16. 265--283."},{"key":"key-10.1145\/3178876.3186053-2","unstructured":"Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio . 2014. Neural machine translation by jointly learning to align and translate. arXiv preprint arXiv:1409.0473 (2014)."},{"key":"key-10.1145\/3178876.3186053-3","unstructured":"Adrian Benton, Lyle Ungar, Shawndra Hill, Sean Hennessy, Jun Mao, Annie Chung, Charles E Leonard, and John H Holmes . 2011. Identifying potential adverse effects using the web: A new approach to medical hypothesis generation. Journal of biomedical informatics Vol. 44, 6 (2011), 989--996.","DOI":"10.1016\/j.jbi.2011.07.005","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-4","unstructured":"Jiang Bian, Umit Topaloglu, and Fan Yu . 2012. Towards large-scale twitter mining for drug-related adverse events Proceedings of the 2012 international workshop on Smart health and wellbeing. ACM, 25--32."},{"key":"key-10.1145\/3178876.3186053-5","unstructured":"Brant W Chee, Richard Berlin, and Bruce Schatz . 2011. Predicting adverse drug events from personal health messages AMIA Annual Symposium Proceedings, Vol. Vol. 2011. American Medical Informatics Association, 217."},{"key":"key-10.1145\/3178876.3186053-6","unstructured":"Kyunghyun Cho, Bart Van Merri&#235;nboer, Dzmitry Bahdanau, and Yoshua Bengio . 2014. On the properties of neural machine translation: Encoder-decoder approaches. arXiv preprint arXiv:1409.1259 (2014)."},{"key":"key-10.1145\/3178876.3186053-7","unstructured":"Anne Cocos, Alexander G Fiks, and Aaron J Masino . 2017. Deep learning for pharmacovigilance: recurrent neural network architectures for labeling adverse drug reactions in Twitter posts. Journal of the American Medical Informatics Association (2017), ocw180.","DOI":"10.1093\/jamia\/ocw180","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-8","unstructured":"Daxiang Dong, Hua Wu, Wei He, Dianhai Yu, and Haifeng Wang . 2015. Multi-Task Learning for Multiple Language Translation. ACL (1). 1723--1732."},{"key":"key-10.1145\/3178876.3186053-9","unstructured":"Clark C Freifeld, John S Brownstein, Christopher M Menone, Wenjie Bao, Ross Filice, Taha Kass-Hout, and Nabarun Dasgupta . 2014. Digital drug safety surveillance: monitoring pharmaceutical products in twitter. Drug safety, Vol. 37, 5 (2014), 343--350."},{"key":"key-10.1145\/3178876.3186053-10","unstructured":"Rachel Ginn, Pranoti Pimpalkhute, Azadeh Nikfarjam, Apurv Patki, Karen O'Connor, Abeed Sarker, Karen Smith, and Graciela Gonzalez . 2014. Mining Twitter for adverse drug reaction mentions: a corpus and classification benchmark Proceedings of the fourth workshop on building and evaluating resources for health and biomedical text processing."},{"key":"key-10.1145\/3178876.3186053-11","unstructured":"Xavier Glorot and Yoshua Bengio . 2010. Understanding the difficulty of training deep feedforward neural networks Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. 249--256."},{"key":"key-10.1145\/3178876.3186053-12","unstructured":"Sepp Hochreiter and J&#252;rgen Schmidhuber . 1997. Long short-term memory. Neural computation, Vol. 9, 8 (1997), 1735--1780.","DOI":"10.1162\/neco.1997.9.8.1735","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-13","unstructured":"Trung Huynh, Yulan He, Alistair Willis, and Stefan R&#252;ger . 2016. Adverse drug reaction classification with deep neural networks Proceedings of COLING 2016, the 26th International Conference on Computational Linguistics: Technical Papers. 877--887."},{"key":"key-10.1145\/3178876.3186053-14","unstructured":"Keyuan Jiang and Yujing Zheng . 2013. Mining Twitter data for potential drug effects. In International Conference on Advanced Data Mining and Applications. Springer, 434--443.","DOI":"10.1007\/978-3-642-53914-5_37","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-15","unstructured":"Diederik Kingma and Jimmy Ba . 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 (2014)."},{"key":"key-10.1145\/3178876.3186053-16","unstructured":"Vasileios Lampos, Elad Yom-Tov, Richard Pebody, and Ingemar J Cox . 2015. Assessing the impact of a health intervention via user-generated Internet content. Data Mining and Knowledge Discovery Vol. 29, 5 (2015), 1434--1457.","DOI":"10.1007\/s10618-015-0427-9","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-17","unstructured":"Robert Leaman, Laura Wojtulewicz, Ryan Sullivan, Annie Skariah, Jian Yang, and Graciela Gonzalez . 2010. Towards internet-age pharmacovigilance: extracting adverse drug reactions from user posts to health-related social networks. In Proceedings of the 2010 workshop on biomedical natural language processing. Association for Computational Linguistics, 117--125."},{"key":"key-10.1145\/3178876.3186053-18","unstructured":"Bing Liu and Ian Lane . 2016. Attention-based recurrent neural network models for joint intent detection and slot filling. arXiv preprint arXiv:1609.01454 (2016)."},{"key":"key-10.1145\/3178876.3186053-19","unstructured":"Minh-Thang Luong, Quoc V Le, Ilya Sutskever, Oriol Vinyals, and Lukasz Kaiser . 2015. Multi-task sequence to sequence learning. arXiv preprint arXiv:1511.06114 (2015)."},{"key":"key-10.1145\/3178876.3186053-20","unstructured":"Ramesh Nallapati, Feifei Zhai, and Bowen Zhou . 2017. SummaRuNNer: A recurrent neural network based sequence model for extractive summarization of documents. hiP (yi= 1| hi, si, d) Vol. 1 (2017), 1."},{"key":"key-10.1145\/3178876.3186053-21","unstructured":"Azadeh Nikfarjam and Graciela H Gonzalez . 2011. Pattern mining for extraction of mentions of adverse drug reactions from user comments AMIA Annual Symposium Proceedings, Vol. Vol. 2011. American Medical Informatics Association, 1019."},{"key":"key-10.1145\/3178876.3186053-22","unstructured":"Azadeh Nikfarjam, Abeed Sarker, Karen O'Connor, Rachel Ginn, and Graciela Gonzalez . 2015. Pharmacovigilance from social media: mining adverse drug reaction mentions using sequence labeling with word embedding cluster features. Journal of the American Medical Informatics Association, Vol. 22, 3 (2015), 671--681.","DOI":"10.1093\/jamia\/ocu041","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-23","unstructured":"Karen O'Connor, Pranoti Pimpalkhute, Azadeh Nikfarjam, Rachel Ginn, Karen L Smith, and Graciela Gonzalez . 2014. Pharmacovigilance on twitter? mining tweets for adverse drug reactions AMIA annual symposium proceedings, Vol. Vol. 2014. American Medical Informatics Association, 924."},{"key":"key-10.1145\/3178876.3186053-24","unstructured":"World Health Organization et almbox. . 2002. The importance of pharmacovigilance. (2002)."},{"key":"key-10.1145\/3178876.3186053-25","unstructured":"Apurv Patki, Abeed Sarker, Pranoti Pimpalkhute, Azadeh Nikfarjam, Rachel Ginn, Karen O'Connor, Karen Smith, and Graciela Gonzalez . 2014. Mining adverse drug reaction signals from social media: going beyond extraction. Proceedings of BioLinkSig Vol. 2014 (2014), 1--8."},{"key":"key-10.1145\/3178876.3186053-26","unstructured":"Michael J Paul and Mark Dredze . 2011. You are what you Tweet: Analyzing Twitter for public health. ICWSM Vol. 20 (2011), 265--272."},{"key":"key-10.1145\/3178876.3186053-27","unstructured":"Mor Peleg, Tiffany I Leung, Manisha Desai, and Michel Dumontier . 2017. Is Crowdsourcing Patient-Reported Outcomes the Future of Evidence-Based Medicine? A Case Study of Back Pain. In Conference on Artificial Intelligence in Medicine in Europe. Springer, 245--255.","DOI":"10.1007\/978-3-319-59758-4_27","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-28","unstructured":"Jeffrey Pennington, Richard Socher, and Christopher Manning . 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532--1543.","DOI":"10.3115\/v1\/D14-1162","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-29","unstructured":"Marek Rei, Gamal KO Crichton, and Sampo Pyysalo . 2016. Attending to Characters in Neural Sequence Labeling Models. arXiv preprint arXiv:1611.04361 (2016)."},{"key":"key-10.1145\/3178876.3186053-30","unstructured":"Sebastian Ruder . 2017. An overview of multi-task learning in deep neural networks. arXiv preprint arXiv:1706.05098 (2017)."},{"key":"key-10.1145\/3178876.3186053-31","unstructured":"Abeed Sarker, Rachel Ginn, Azadeh Nikfarjam, Karen O'Connor, Karen Smith, Swetha Jayaraman, Tejaswi Upadhaya, and Graciela Gonzalez . 2015. Utilizing social media data for pharmacovigilance: A review. Journal of biomedical informatics Vol. 54 (2015), 202--212.","DOI":"10.1016\/j.jbi.2015.02.004","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-32","unstructured":"Abeed Sarker, Azadeh Nikfarjam, and Graciela Gonzalez . 2016. Social media mining shared task workshop. In Biocomputing 2016: Proceedings of the Pacific Symposium. 581--592.","DOI":"10.1142\/9789814749411_0054","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-33","unstructured":"Abigail See, Peter J Liu, and Christopher D Manning . 2017. Get To The Point: Summarization with Pointer-Generator Networks. arXiv preprint arXiv:1704.04368 (2017)."},{"key":"key-10.1145\/3178876.3186053-34","unstructured":"Ilya Sutskever, Oriol Vinyals, and Quoc V Le . 2014. Sequence to sequence learning with neural networks Advances in neural information processing systems. 3104--3112."},{"key":"key-10.1145\/3178876.3186053-35","unstructured":"Richard Tzong-Han Tsai, Shih-Hung Wu, Wen-Chi Chou, Yu-Chun Lin, Ding He, Jieh Hsiang, Ting-Yi Sung, and Wen-Lian Hsu . 2006. Various criteria in the evaluation of biomedical named entity recognition. BMC bioinformatics, Vol. 7, 1 (2006), 92.","DOI":"10.1186\/1471-2105-7-92","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-36","unstructured":"Oriol Vinyals, Alexander Toshev, Samy Bengio, and Dumitru Erhan . 2015. Show and tell: A neural image caption generator. Proceedings of the IEEE conference on computer vision and pattern recognition. 3156--3164.","DOI":"10.1109\/CVPR.2015.7298935","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-37","unstructured":"Stephen Wu, Sijia Liu, Yanshan Wang, Tamara Timmons, Harsha Uppili, Steven Bedrick, William Hersh, and Hongfang Liu . 2017. Intrainstitutional EHR collections for patient-level information retrieval. Journal of the Association for Information Science and Technology (2017)."},{"key":"key-10.1145\/3178876.3186053-38","unstructured":"Zhengzheng Xing, Jian Pei, and Eamonn Keogh . 2010. A brief survey on sequence classification. ACM Sigkdd Explorations Newsletter Vol. 12, 1 (2010), 40--48.","DOI":"10.1145\/1882471.1882478","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-39","unstructured":"Christopher C Yang, Haodong Yang, Ling Jiang, and Mi Zhang . 2012. Social media mining for drug safety signal detection Proceedings of the 2012 international workshop on Smart health and wellbeing. ACM, 33--40."},{"key":"key-10.1145\/3178876.3186053-40","unstructured":"Ming Yang, Xiaodi Wang, and Melody Y Kiang . 2013. Identification of Consumer Adverse Drug Reaction Messages on Social Media. PACIS. 193."},{"key":"key-10.1145\/3178876.3186053-41","unstructured":"Elad Yom-Tov . 2017. Predicting drug recalls from Internet search engine queries. IEEE Journal of Translational Engineering in Health and Medicine Vol. 5 (2017), 1--6.","DOI":"10.1109\/JTEHM.2017.2732945","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186053-42","unstructured":"Bin Zou, Vasileios Lampos, Russell Gorton, and Ingemar J Cox . 2016. On infectious intestinal disease surveillance using social media content Proceedings of the 6th International Conference on Digital Health Conference. ACM, 157--161."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186053&ftid=1957516&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:02:27Z","timestamp":1523635347000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":42,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186053","relation":{"cites":[]}}}