{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:25Z","timestamp":1525103725892},"publisher-location":"New York, New York, USA","reference-count":38,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"Department of Computer Science at Montclair State University","award":[]},{"name":"Environmental Management PhD Program at Montclair State University","award":[]},{"name":"ARO grant as part of the DARPA SocialSim Program","award":["W911NF-17-C-0098"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191632","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Mapping Ordinances and Tweets using Smart City Characteristics to Aid Opinion Mining"],"prefix":"10.1145","author":[{"given":"Manish","family":"Puri","sequence":"first","affiliation":[{"name":"Montclair State University, Monlclair , NJ, USA"}]},{"given":"Xu","family":"Du","sequence":"additional","affiliation":[{"name":"Montclair State University, Montclair, NJ, USA"}]},{"given":"Aparna S.","family":"Varde","sequence":"additional","affiliation":[{"name":"Montclair State University, Montclair, NJ, USA"}]},{"given":"Gerard","family":"de Melo","sequence":"additional","affiliation":[{"name":"Rutgers University, Piscataway, NJ, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191632-1","unstructured":"Christoph B&#246;hm, Gerard de Melo, Felix Naumann, and Gerhard Weikum. 2012. LINDA: Distributed Web-of-Data-Scale Entity Matching. In Proceedings of the 21st ACM Conference on Information and Knowledge Management (CIKM 2012), Xue-wen Chen, Guy Lebanon, Haixun Wang, and Mohammed J. Zaki (Eds.). ACM, New York, NY, USA.","DOI":"10.1145\/2396761.2398582","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-2","unstructured":"Zhu Cao, Linlin Wang, and Gerard de Melo. 2018. Link Prediction via Subgraph Embedding-Based Convex Matrix Completion. In Proceedings of the 32nd AAAI Conference on Artificial Intelligence (AAAI 2018). AAAI Press."},{"key":"key-10.1145\/3184558.3191632-3","unstructured":"The New York City Council. 2018. Legislative Research Center Web Page. (2018). Retrieved March 4, 2018 from http:\/\/legistar.council.nyc.gov\/"},{"key":"key-10.1145\/3184558.3191632-4","unstructured":"Gerard de Melo. 2013. Not Quite the Same: Identity Constraints for the Web of Linked Data. In Proceedings of the 27th AAAI Conference on Artificial Intelligence (AAAI 2013), Marie desJardins and Michael L. Littman (Eds.). AAAI Press, Menlo Park, CA, USA, 1092--1098. http:\/\/www.aaai.org\/ocs\/index.php\/AAAI\/AAAI13\/paper\/view\/6491"},{"key":"key-10.1145\/3184558.3191632-5","unstructured":"Gerard de Melo. 2017. Multilingual Vector Representations of Words, Sentences, and Documents. In Proceedings of IJCNLP 2017. http:\/\/www.aclweb.org\/anthology\/I17--5002"},{"key":"key-10.1145\/3184558.3191632-6","unstructured":"Gerard de Melo, Mouna Kacimi, and Aparna Varde. 2015. Dissertation Research Problems in Data Management and Related Areas. SIGMOD Record 44, 4 (December 2015). http:\/\/sigmod.org\/publications\/sigmodRecord\/1512\/pdfs\/09_reports_Melo.pdf"},{"key":"key-10.1145\/3184558.3191632-7","unstructured":"Gerard de Melo and Gerhard Weikum. 2008. Language as a Foundation of the Semantic Web. In Proceedings of the Poster and Demonstration Session at the 7th International Semantic Web Conference (ISWC 2008) (CEUR WS), Christian Bizer and Anupam Joshi (Eds.), Vol. 401. CEUR, Karlsruhe, Germany."},{"key":"key-10.1145\/3184558.3191632-8","unstructured":"Gerard de Melo and Gerhard Weikum. 2008. Mapping Roget's Thesaurus and WordNet to French. In Proceedings of the 6th Language Resources and Evaluation Conference (LREC 2008). ELRA, Paris, France, 3306--3313."},{"key":"key-10.1145\/3184558.3191632-9","unstructured":"Gerard de Melo and Gerhard Weikum. 2010. Untangling the Cross-Lingual Link Structure of Wikipedia. In Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics. Association for Computational Linguistics, Stroudsburg, PA, USA."},{"key":"key-10.1145\/3184558.3191632-10","unstructured":"Xin Dong and Gerard de Melo. 2018. Cross-Lingual Propagation for Deep Sentiment Analysis. In Proceedings of the 32nd AAAI Conference on Artificial Intelligence (AAAI 2018). AAAI Press."},{"key":"key-10.1145\/3184558.3191632-11","unstructured":"Katherine Rose Driggs-Campbell, Victor Shia, and Ruzena Bajcsy. 2014. Decisions for Autonomous Vehicles: Integrating Sensors, Communication, and Control. In Proceedings of the 3rd International Conference on High Confidence Networked Systems (HiCoNS '14). ACM, New York, NY, USA, 59--60. https:\/\/doi.org\/10.1145\/2566468.2576850","DOI":"10.1145\/2566468.2576850","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-12","unstructured":"Xu Du, Onyeka Emebo, Aparna Varde, Niket Tandon, Sreyasi Nag Chowdhury, and Gerard Weikum. 2016. Air Quality Assessment from Social Media and Structured Data: Pollutants and Health Impacts in Urban Planning. In IEEE International Conference on Data Engineering (ICDE) - Workshops. 54--59."},{"key":"key-10.1145\/3184558.3191632-13","unstructured":"Xu Du, Diane Liporace, and Aparna Varde. 2017. Urban Legislation Assessment by Data Analytics with Smart City Characteristics. In IEEE Ubiquitous Computing, Electronics and Mobile Communications Conference (UEMCON). 20--25.","DOI":"10.1109\/UEMCON.2017.8248972","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-14","unstructured":"Christiane Fellbaum (Ed.). 1998. WordNet: An Electronic Lexical Database. The MIT Press. http:\/\/www.amazon.ca\/exec\/obidos\/redirecttag=citeulike04--20{&#38;}path=ASIN\/026206197X"},{"key":"key-10.1145\/3184558.3191632-15","unstructured":"Liangjie Hong and Brian D. Davison. 2010. Empirical Study of Topic Modeling in Twitter. In Proceedings of the First Workshop on Social Media Analytics (SOMA '10). ACM, New York, NY, USA, 80--88. https:\/\/doi.org\/10.1145\/1964858.1964870","DOI":"10.1145\/1964858.1964870","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-16","unstructured":"IEEE. 2018. IEEE Smart Cities Technical Community. (2018). Retrieved March 4, 2018 from https:\/\/smartcities.ieee.org\/"},{"key":"key-10.1145\/3184558.3191632-17","unstructured":"G. Leef. 2007. Smart Economics: Commonsense Answers to 50 Questions about Government, Taxes, Business and Households. Foundation for Economic Education."},{"key":"key-10.1145\/3184558.3191632-18","unstructured":"Quanzhi Li, Sameena Shah, Xiaomo Liu, Armineh Nourbakhsh, and Rui Fang. 2016. TweetSift: Tweet Topic Classification Based on Entity Knowledge Base and Topic Enhanced Word Embedding. In Proceedings of the 25th ACM International on Conference on Information and Knowledge Management (CIKM '16). ACM, New York, NY, USA, 2429--2432. https:\/\/doi.org\/10.1145\/2983323.2983325","DOI":"10.1145\/2983323.2983325","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-19","unstructured":"TU Wien (Vienna University of Technology). 2015. European Smart Cities, Technical Report. Technical Report. Vienna, Austria."},{"key":"key-10.1145\/3184558.3191632-20","unstructured":"Michael Pawlish and Aparna Varde. 2010. Free Cooling: A Paradigm Shift in Data Centers. In IEEE International Conference on Information and Automation for Sustainability (ICIAfS). 347--352.","DOI":"10.1109\/ICIAFS.2010.5715685","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-21","unstructured":"Michael J. Pawlish, Aparna S. Varde, and Stefan A. Robila. 2015. The Greening of Data Centers with Cloud Technology. Int. J. Cloud Appl. Comput. 5, 4 (Oct. 2015), 1--23. https:\/\/doi.org\/10.4018\/IJCAC.2015100101","DOI":"10.4018\/IJCAC.2015100101","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-22","unstructured":"Priya Persaud, Aparna Varde, and Stefan Robila. 2017. Enhancing Autonomous Vehicles with Commonsense: Smart Mobility in Smart Cities. In IEEE International Conference on Tools with Artificial Intelligence (ICTAI) - Smart Cities Workshop."},{"key":"key-10.1145\/3184558.3191632-23","unstructured":"Andi Rexha, Mark Kr&#246;ll, Mauro Dragoni, and Roman Kern. 2016. Polarity Classification for Target Phrases in Tweets: A Word2Vec Approach. In The Semantic Web - ESWC 2016 Satellite Events, Heraklion, Crete, Greece, May 29 - June 2, 2016, Revised Selected Papers (Lecture Notes in Computer Science), Harald Sack, Giuseppe Rizzo, Nadine Steinmetz, Dunja Mladenic, S&#246;ren Auer, and Christoph Lange (Eds.), Vol. 9989. 217--223. https:\/\/doi.org\/10.1007\/978--3--319--47602--5_40"},{"key":"key-10.1145\/3184558.3191632-24","unstructured":"Jacobo Rouces, Gerard de Melo, and Katja Hose. 2015. Representing Specialized Events with FrameBase. In Proceedings of the 4th International Workshop on Detection, Representation, and Exploitation of Events in the Semantic Web (DeRiVE 2015) at ESWC 2015. http:\/\/ceur-ws.org\/Vol-1363\/paper_7.pdf"},{"key":"key-10.1145\/3184558.3191632-25","unstructured":"Jacobo Rouces, Gerard de Melo, and Katja Hose. 2016. Complex Schema Mapping and Linking Data: Beyond Binary Predicates. In Proceedings of the WWW 2016 Workshop on Linked Data on the Web (LDOW 2016)."},{"key":"key-10.1145\/3184558.3191632-26","unstructured":"Jacobo Rouces, Gerard de Melo, and Katja Hose. 2016. Heuristics for Connecting Heterogeneous Knowledge via FrameBase. In Proceedings of ESWC 2016 (Lecture Notes in Computer Science). Springer.","DOI":"10.1007\/978-3-319-34129-3_2","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-27","unstructured":"Niket Tandon and Gerard de Melo. 2010. Information Extraction from WebScale N-Gram Data. In Web N-gram Workshop. Workshop of the 33rd Annual International ACM SIGIR Conference on Research and Development in Information Retrieval, Chengxiang Zhai, David Yarowsky, Evelyne Viegas, Kuansan Wang, and Stephan Vogel (Eds.), Vol. 5803. ACM, 8--15."},{"key":"key-10.1145\/3184558.3191632-28","unstructured":"Niket Tandon, Gerard de Melo, Fabian Suchanek, and Gerhard Weikum. 2014. WebChild: Harvesting and Organizing Commonsense Knowledge from the Web. In Proceedings of the 7th ACM International Conference on Web Search and Data Mining (WSDM '14). ACM, New York, NY, USA, 523--532. https:\/\/doi.org\/10.1145\/2556195.2556245","DOI":"10.1145\/2556195.2556245","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-29","unstructured":"Niket Tandon, Gerard de Melo, and Gerhard Weikum. 2011. Deriving a Web-Scale Common Sense Fact Database. In Proceedings of the 25th AAAI Conference on Artificial Intelligence (AAAI 2011). AAAI Press, Palo Alto, CA, USA, 152--157."},{"key":"key-10.1145\/3184558.3191632-30","unstructured":"Niket Tandon, Gerard de Melo, and Gerhard Weikum. 2017. WebChild 2.0: Fine-Grained Commonsense Knowledge Distillation. In Proceedings of ACL 2017, System Demonstrations. Association for Computational Linguistics, Vancouver, Canada, 115--120. http:\/\/aclweb.org\/anthology\/P17--4020","DOI":"10.18653\/v1\/P17-4020","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-31","unstructured":"Niket Tandon, Aparna S. Varde, and Gerard de Melo. 2018. Commonsense Knowledge in Machine Intelligence. SIGMOD Rec. 46, 4 (Feb. 2018), 49--52. https:\/\/doi.org\/10.1145\/3186549.3186562","DOI":"10.1145\/3186549.3186562","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-32","unstructured":"Aparna Varde, Niket Tandon, Sreyasi Nag Chowdhury, and Gerhard Weikum. 2015. Common Sense Knowledge in Domain-Specific Knowledge Bases. Technical Report. Max-Planck-Institut f&#252;r Informatik, Saarbr&#252;cken, Germany."},{"key":"key-10.1145\/3184558.3191632-33","unstructured":"Alan Varghese, Aparna Varde, Jing Peng, and Eileen Fitzpatrick. 2015. A Framework for Collocation Erroe Correction in Web Pages and Text Documents. ACM SIGKDD Explorations 17, 1 (June 2015), 14--23.","DOI":"10.1145\/2830544.2830548","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-34","unstructured":"Linlin Wang, Kang Liu, Zhu Cao, Jun Zhao, and Gerard de Melo. 2015. Sentiment Aspect Extraction based on Restricted Boltzmann Machines. In Proceedings of ACL 2015. 616--625.","DOI":"10.3115\/v1\/P15-1060","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-35","unstructured":"Liqiang Wang, Yafang Wang, Bin Liu, Lirong He, Shijun Liu, Gerard de Melo, and Zenglin Xu. 2017. Link Prediction by Exploiting Network Formation Games in Exchangeable Graphs. In Proceedings of IJCNN 2017.","DOI":"10.1109\/IJCNN.2017.7965910","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-36","unstructured":"Ian H. Witten, Eibe Frank, and Mark A. Hall. 2011. Data Mining: Practical Machine Learning Tools and Techniques (3rd ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA."},{"key":"key-10.1145\/3184558.3191632-37","unstructured":"Yang Yu, Qi Lou, Jiafu Tang, Junwei Wang, and XiaoHang Yue. 2017. An exact decomposition method to save trips in cooperative pickup and delivery based on scheduled trips and profit distribution. Computers Operations Research 87 (2017), 245--257. https:\/\/doi.org\/10.1016\/j.cor.2017.02.015","DOI":"10.1016\/j.cor.2017.02.015","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191632-38","unstructured":"L. A. Zadeh, A. M. Abbasov, and S. N. Shahbazova. 2015. Analysis of Twitter hashtags: Fuzzy clustering approach. In 2015 Annual Conference of the North American Fuzzy Information Processing Society (NAFIPS) held jointly with 2015 5th World Conference on Soft Computing (WConSC). 1--6. https:\/\/doi.org\/10.1109\/NAFIPS-WConSC.2015.7284196","DOI":"10.1109\/NAFIPS-WConSC.2015.7284196","doi-asserted-by":"crossref"}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191632&ftid=1958379&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T21:13:09Z","timestamp":1524085989000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":38,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191632","relation":{"cites":[]}}}