{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:12Z","timestamp":1523998752050},"publisher-location":"New York, New York, USA","reference-count":33,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"JSPS KAKENHI","award":["16K12532","15J01402"]},{"name":"MIC SCOPE","award":["172307001"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186116","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Dual Graph Convolutional Networks for Graph-Based Semi-Supervised Classification"],"prefix":"10.1145","author":[{"given":"Chenyi","family":"Zhuang","sequence":"first","affiliation":[{"name":"Kyoto University, Kyoto, Japan"}]},{"given":"Qiang","family":"Ma","sequence":"additional","affiliation":[{"name":"Kyoto University, Kyoto, Japan"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186116-1","unstructured":"Reid Andersen, Fan Chung, and Kevin Lang. 2006. Local graph partitioning using pagerank vectors. In the 47th Annual IEEE Symposium on Foundations of Computer Science. 475--486.","DOI":"10.1109\/FOCS.2006.44","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-2","unstructured":"James Atwood and Don Towsley. 2016. Diffusion-convolutional neural networks. In Advances in Neural Information Processing Systems. 1993--2001."},{"key":"key-10.1145\/3178876.3186116-3","unstructured":"Mikhail Belkin, Partha Niyogi, and Vikas Sindhwani. 2006. Manifold regularization: A geometric framework for learning from labeled and unlabeled examples. Journal of machine learning research Vol. 7, Nov (2006), 2399--2434."},{"key":"key-10.1145\/3178876.3186116-4","unstructured":"John A Bullinaria and Joseph P Levy. 2007. Extracting semantic representations from word co-occurrence statistics: A computational study. Behavior research methods Vol. 39, 3 (2007), 510--526.","DOI":"10.3758\/BF03193020","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-5","unstructured":"Deng Cai, Xiaofei He, Jiawei Han, and Thomas S Huang. 2011. Graph regularized nonnegative matrix factorization for data representation. IEEE Transactions on Pattern Analysis and Machine Intelligence Vol. 33, 8 (2011), 1548--1560.","DOI":"10.1109\/TPAMI.2010.231","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-6","unstructured":"Andrew Carlson, Justin Betteridge, Bryan Kisiel, Burr Settles, Estevam R Hruschka Jr, and Tom M Mitchell. 2010. Toward an Architecture for Never-Ending Language Learning Proceedings of the Twenty-Fourth AAAI Conference on Artificial Intelligence, Vol. Vol. 5."},{"key":"key-10.1145\/3178876.3186116-7","unstructured":"Bhavana Dalvi, Aditya Mishra, and William W Cohen. 2016. Hierarchical semi-supervised classification with incomplete class hierarchies Proceedings of the Ninth ACM International Conference on Web Search and Data Mining. 193--202."},{"key":"key-10.1145\/3178876.3186116-8","unstructured":"Maximilien Danisch, T-H Hubert Chan, and Mauro Sozio. 2017. Large Scale Density-friendly Graph Decomposition via Convex Programming Proceedings of the 26th International Conference on World Wide Web. 233--242."},{"key":"key-10.1145\/3178876.3186116-9","unstructured":"Micha&#235;l Defferrard, Xavier Bresson, and Pierre Vandergheynst. 2016. Convolutional neural networks on graphs with fast localized spectral filtering Advances in Neural Information Processing Systems. 3844--3852."},{"key":"key-10.1145\/3178876.3186116-10","unstructured":"Franccois Fouss, Kevin Francoisse, Luh Yen, Alain Pirotte, and Marco Saerens. 2012. An experimental investigation of kernels on graphs for collaborative recommendation and semisupervised classification. Neural networks Vol. 31 (2012), 53--72.","DOI":"10.1016\/j.neunet.2012.03.001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-11","unstructured":"Francois Fouss, Alain Pirotte, Jean-Michel Renders, and Marco Saerens. 2007. Random-walk computation of similarities between nodes of a graph with application to collaborative recommendation. IEEE Transactions on knowledge and data engineering Vol. 19, 3 (2007), 355--369.","DOI":"10.1109\/TKDE.2007.46","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-12","unstructured":"David K Hammond, Pierre Vandergheynst, and R&#233;mi Gribonval. 2011. Wavelets on graphs via spectral graph theory. Applied and Computational Harmonic Analysis Vol. 30, 2 (2011), 129--150."},{"key":"key-10.1145\/3178876.3186116-13","unstructured":"Mikael Henaff, Joan Bruna, and Yann LeCun. 2015. Deep convolutional networks on graph-structured data. arXiv preprint arXiv:1506.05163 (2015)."},{"key":"key-10.1145\/3178876.3186116-14","unstructured":"Ming Ji, Yizhou Sun, Marina Danilevsky, Jiawei Han, and Jing Gao. 2010. Graph regularized transductive classification on heterogeneous information networks Joint European Conference on Machine Learning and Knowledge Discovery in Databases. 570--586."},{"key":"key-10.1145\/3178876.3186116-15","unstructured":"Thomas N Kipf and Max Welling. 2017. Semi-supervised classification with graph convolutional networks Proceedings of the 5th International Conference on Learning Representations. 1--14."},{"key":"key-10.1145\/3178876.3186116-16","unstructured":"Omer Levy and Yoav Goldberg. 2014. Neural word embedding as implicit matrix factorization Advances in neural information processing systems. 2177--2185."},{"key":"key-10.1145\/3178876.3186116-17","unstructured":"Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of Machine Learning Research Vol. 9, Nov (2008), 2579--2605."},{"key":"key-10.1145\/3178876.3186116-18","unstructured":"Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality Advances in neural information processing systems. 3111--3119."},{"key":"key-10.1145\/3178876.3186116-19","unstructured":"Maximilian Nickel, Kevin Murphy, Volker Tresp, and Evgeniy Gabrilovich. 2016. A review of relational machine learning for knowledge graphs. Proc. IEEE Vol. 104, 1 (2016), 11--33.","DOI":"10.1109\/JPROC.2015.2483592","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-20","unstructured":"Lawrence Page, Sergey Brin, Rajeev Motwani, and Terry Winograd. 1999. The PageRank citation ranking: Bringing order to the web. Technical Report. Stanford InfoLab."},{"key":"key-10.1145\/3178876.3186116-21","unstructured":"Bryan Perozzi, Rami Al-Rfou, and Steven Skiena. 2014. Deepwalk: Online learning of social representations Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. 701--710."},{"key":"key-10.1145\/3178876.3186116-22","unstructured":"Sebastian Ruder. 2016. An overview of gradient descent optimization algorithms. arXiv preprint arXiv:1609.04747 (2016)."},{"key":"key-10.1145\/3178876.3186116-23","unstructured":"Mehdi Sajjadi, Mehran Javanmardi, and Tolga Tasdizen. 2016. Regularization with stochastic transformations and perturbations for deep semi-supervised learning. In Advances in Neural Information Processing Systems. 1163--1171."},{"key":"key-10.1145\/3178876.3186116-24","unstructured":"David I Shuman, Sunil K Narang, Pascal Frossard, Antonio Ortega, and Pierre Vandergheynst. 2013. The emerging field of signal processing on graphs: Extending high-dimensional data analysis to networks and other irregular domains. IEEE Signal Processing Magazine Vol. 30, 3 (2013), 83--98."},{"key":"key-10.1145\/3178876.3186116-25","unstructured":"Milivoj Simeonovski, Giancarlo Pellegrino, Christian Rossow, and Michael Backes. 2017. Who Controls the Internet?: Analyzing Global Threats using Property Graph Traversals. In Proceedings of the 26th International Conference on World Wide Web. 647--656.","DOI":"10.1145\/3038912.3052587","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-26","unstructured":"Nitish Srivastava, Geoffrey E Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. 2014. Dropout: a simple way to prevent neural networks from overfitting. Journal of machine learning research Vol. 15, 1 (2014), 1929--1958."},{"key":"key-10.1145\/3178876.3186116-27","unstructured":"Jian Tang, Meng Qu, Mingzhe Wang, Ming Zhang, Jun Yan, and Qiaozhu Mei. 2015. Line: Large-scale information network embedding. In Proceedings of the 24th International Conference on World Wide Web. 1067--1077.","DOI":"10.1145\/2736277.2741093","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-28","unstructured":"Peter D Turney and Patrick Pantel. 2010. From frequency to meaning: Vector space models of semantics. Journal of artificial intelligence research Vol. 37 (2010), 141--188."},{"key":"key-10.1145\/3178876.3186116-29","unstructured":"Derry Wijaya, Partha Pratim Talukdar, and Tom Mitchell. 2013. Pidgin: ontology alignment using web text as interlingua Proceedings of the 22nd ACM international conference on Information &#38; Knowledge Management. 589--598."},{"key":"key-10.1145\/3178876.3186116-30","unstructured":"Zhilin Yang, William W Cohen, and Ruslan Salakhutdinov. 2016. Revisiting semi-supervised learning with graph embeddings Proceedings of the 33rd International Conference on Machine Learning. 1--9."},{"key":"key-10.1145\/3178876.3186116-31","unstructured":"Wayne W Zachary. 1977. An information flow model for conflict and fission in small groups. Journal of anthropological research Vol. 33, 4 (1977), 452--473.","DOI":"10.1086\/jar.33.4.3629752","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186116-32","unstructured":"Denny Zhou, Olivier Bousquet, Thomas N Lal, Jason Weston, and Bernhard Sch&#246;lkopf. 2004. Learning with local and global consistency. In Advances in neural information processing systems. 321--328."},{"key":"key-10.1145\/3178876.3186116-33","unstructured":"Xiaojin Zhu, Zoubin Ghahramani, and John D Lafferty. 2003. Semi-supervised learning using gaussian fields and harmonic functions Proceedings of the 20th International conference on Machine learning. 912--919."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186116&ftid=1957460&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:32:21Z","timestamp":1523637141000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":33,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186116","relation":{"cites":[]}}}