{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:26Z","timestamp":1523998766901},"publisher-location":"New York, New York, USA","reference-count":47,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3185997","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Time Expression Recognition Using a Constituent-based Tagging Scheme"],"prefix":"10.1145","author":[{"given":"Xiaoshi","family":"Zhong","sequence":"first","affiliation":[{"name":"Nanyang Technological University, Singapore, Singapore"}]},{"given":"Erik","family":"Cambria","sequence":"additional","affiliation":[{"name":"Nanyang Technological University, Singapore, Singapore"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3185997-1","unstructured":"Omar Alonso, Jannik Strotgen, Ricardo Baeza-Yates, and Michael Gertz. 2011. Temporal Information Retrieval: Challenges and Opportunities. In Proceedings of 1st International Temporal Web Analytics Workshop. 1--8."},{"key":"key-10.1145\/3178876.3185997-2","unstructured":"Gabor Angeli, Christopher D. Manning, and Daniel Jurafsky. 2012. Parsing Time: Learning to Interpret Time Expressions. In Proceedings of 2012 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 446--455."},{"key":"key-10.1145\/3178876.3185997-3","unstructured":"Gabor Angeli and Jakob Uszkoreit. 2013. Language-Independent Discriminative Parsing of Temporal Expressions. In Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics. 83--92."},{"key":"key-10.1145\/3178876.3185997-4","unstructured":"Steven Bethard. 2013. ClearTK-TimeML: A minimalist approach to TempEval 2013. In Proceedings of the 7th International Workshop on Semantic Evaluation. 10--14."},{"key":"key-10.1145\/3178876.3185997-5","unstructured":"Steven Bethard, Leon Derczynski, Guergana Savova, James Pustejovsky, and Marc Verhagen. 2015. SemEval-2015 Task 6: Clinical TempEval. In Proceedings of the 9th International Workshop on Semantic Evaluation. 806--814.","DOI":"10.18653\/v1\/S15-2136","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-6","unstructured":"Steven Bethard, Guergana Savova, Wei-Te Chen, Leon Derczynski, James Pustejovsky, and Marc Verhagen. 2016. SemEval-2016 Task 12: Clinical TempEval. In Proceedings of SemEval-2016. 1052--1062.","DOI":"10.18653\/v1\/S16-1165","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-7","unstructured":"Steven Bethard, Guergana Savova, Martha Palmer, and James Pustejovsky. 2017. SemEval-2017 Task 12: Clinical TempEval. In Proceedings of the 11th International Workshop on Semantic Evaluation. 565--572.","DOI":"10.18653\/v1\/S17-2093","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-8","unstructured":"Ricardo Campos, Gael Dias, Alipio M. Jorge, and Adam Jatowt. 2014. Survey of temporal information retrieval and related applications. Comput. Surveys 47, 2 (2014), 15:1--41."},{"key":"key-10.1145\/3178876.3185997-9","unstructured":"Angel X. Chang and Christopher D. Manning. 2012. SUTime: A Library for Recognizing and Normalizing Time Expressions. In Proceedings of 8th International Conference on Language Resources and Evaluation. 3735--3740."},{"key":"key-10.1145\/3178876.3185997-10","unstructured":"Angel X. Chang and Christopher D. Manning. 2013. SUTime: Evaluation in TempEval-3. In Proceedings of the Second Joint Conference on Lexical and Computational Semantics (SEM). 78--82."},{"key":"key-10.1145\/3178876.3185997-11","unstructured":"Nancy A. Chinchor. 1997. MUC-7 Named Entity Task Definition. In Proceedings of the 7th Message Understanding Conference, Vol. 29."},{"key":"key-10.1145\/3178876.3185997-12","unstructured":"Jason P.C. Chiu and Eric Nichols. 2016. Named Entity Recognition with Bidirectional LSTM-CNNs. Transactions of the Association for Computational Linguistics 4 (2016), 357--370."},{"key":"key-10.1145\/3178876.3185997-13","unstructured":"Hong-Jie Dai, Po-Ting Lai, Yung-Chun Chang, and Richard Tzong-Han Tsai. 2015. Enhancing of chemical compound and drug name recognition using representative tag scheme and fine-grained tokenization. Journal of Cheminformatics 7.S1, S14 (2015), 1--10."},{"key":"key-10.1145\/3178876.3185997-14","unstructured":"Lisa Ferro, L. Gerber, I. Mani, Beth Sundheim, and G. Wilson. 2005. TIDES 2005 Standard for the Annotation of Temporal Expressions. Technical Report. MITRE."},{"key":"key-10.1145\/3178876.3185997-15","unstructured":"Michele Filannino, Gavin Brown, and Goran Nenadic. 2013. ManTIME: Temporal expression identification and normalization in the TempEval-3 challenge. In Proceedings of the 7th International Workshop on Semantic Evaluation. 53--57."},{"key":"key-10.1145\/3178876.3185997-16","unstructured":"Radu Florian, Abe Ittycheriah, Hongyan Jing, and Tong Zhang. 2003. Named Entity Recognition through Classifier Combination. In Proceedings of the 7th Conference on Natural Language Learning. 168--171.","DOI":"10.3115\/1119176.1119201","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-17","unstructured":"Kadri Hacioglu, Ying Chen, and Benjamin Douglas. 2005. Automatic Time Expression Labeling for English and Chinese Text. In Proceedings of the 6th International Conference on Intelligent Text Processing and Computational Linguistics. 548--559.","DOI":"10.1007\/978-3-540-30586-6_59","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-18","unstructured":"William F. Styler IV, Steven Bethard, Sean Finan, Martha Palmer, Sameer Pradhan, Piet C de Groen, Brad Erickson, Timothy Miller, Chen Lin, Guergana Savova, and James Pustejovsky. 2014. Temporal Annotation in the Clinical Domain. Transactions of the Association for Computational Linguistics 2 (2014), 143--154."},{"key":"key-10.1145\/3178876.3185997-19","unstructured":"John Lafferty, Andrew McCallum, and Fernando Pereira. 2001. Conditional Random Fields: Probabilistic Models for Segmenting and Labeling Sequence Data. In Proceedings of the 18th International Conference on Machine Learning. 281--289."},{"key":"key-10.1145\/3178876.3185997-20","unstructured":"Guillaume Lample, Miguel Ballesteros, Sandeep Subramanian, Kazuya Kawakami, and Chris Dyer. 2016. Neural Architecture for Named Entity Recognition. In Proceedings of the 15th Annual Conference of the North American Chapter of the Association for Computational Linguistics. 260--270.","DOI":"10.18653\/v1\/N16-1030","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-21","unstructured":"Kenton Lee, Yoav Artzi, Jesse Dodge, and Luke Zettlemoyer. 2014. Contextdependent Semantic Parsing for Time Expressions. In Proceedings of the 52th Annual Meeting of the Association for Computational Linguistics. 1437--1447."},{"key":"key-10.1145\/3178876.3185997-22","unstructured":"Hector Llorens, Leon Derczynski, Robert Gaizauskas, and Estela Saquete. 2012. TIMEN: An Open Temporal Expression Normalisation Resource. In Proceedings of the 8th International Conference on Language Resources and Evaluation. 3044-- 3051."},{"key":"key-10.1145\/3178876.3185997-23","unstructured":"Hector Llorens, Estela Saquete, and Borja Navarro. 2010. TIPSem (English and Spanish): Evaluating CRFs and Semantic Roles in TempEval-2. In Proceedings of the 5th International Workshop on Semantic Evaluation. 284--291."},{"key":"key-10.1145\/3178876.3185997-24","unstructured":"Gang Luo, Xiaojiang Huang, Chin-Yew Lin, and Zaiqing Nie. 2015. Joint Named Entity Recognition and Disambiguation. In Proceedings of the 2005 Conference on Empirical Methods in Natural Language Processing. 879--888."},{"key":"key-10.1145\/3178876.3185997-25","unstructured":"Xuezhe Ma and Eduard Hovy. 2016. End-to-end Sequence Labeling via Bidirectional LSTM-CNNs-CRF. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). 1064--1074."},{"key":"key-10.1145\/3178876.3185997-26","unstructured":"Inderjeet Mani and George Wilson. 2000. Robust Temporal Processing of News. In Proceedings of the 38th annual meeting on Association for Computational Linguistics. 69--76.","DOI":"10.3115\/1075218.1075228","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-27","unstructured":"Pawel Mazur and Robert Dale. 2010. WikiWars: A New Corpus for Research on Temporal Expressions. In Proceedings of the 2010 Conference on Empirical Methods in Natural Language Processing. 913--922."},{"key":"key-10.1145\/3178876.3185997-28","unstructured":"Robert Parker, David Graff, Junbo Kong, Ke Chen, and Kazuaki Maeda. 2011. Engilish Gigaword Fifth Edition. (2011)."},{"key":"key-10.1145\/3178876.3185997-29","unstructured":"Alexandre Passos, Vineet Kumar, and Andrew McCallum. 2014. Lexicon Infused Phrase Embeddings for Named Entity Resolution. In Proceedings of the 8th Conference on Computational Language Learning. 78--86.","DOI":"10.3115\/v1\/W14-1609","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-30","unstructured":"James Pustejovsky, Jose Castano, Robert Ingria, Roser Sauri, Robert Gaizauskas, Andrea Setzer, Graham Katz, and Dragomir Radev. 2003. TimeML: Robust Specification of Event and Temporal Expressions in Text. New Directions in Question Answering 3 (2003), 28--34."},{"key":"key-10.1145\/3178876.3185997-31","unstructured":"James Pustejovsky, Patrick Hanks, Roser Sauri, Andrew See, Robert Gaizauskas, Andrea Setzer, Beth Sundheim, Dragomir Radev, David Day, Lisa Ferro, and Marcia Lazo. 2003. The TIMEBANK Corpus. Corpus Linguistics 2003 (2003), 647--656."},{"key":"key-10.1145\/3178876.3185997-32","unstructured":"James Pustejovsky, Kiyong Lee, Harry Bunt, and Laurent Romary. 2010. ISOTimeML: An International Standard for Semantic Annotation. In Proceedings of the Seventh conference on International Language Resouces and Evaluation (LREC'10). 394--397."},{"key":"key-10.1145\/3178876.3185997-33","unstructured":"Lev Ratinov and Dan Roth. 2009. Design Challenges and Misconceptions in Named Entity Recognition. In Proceedings of the Thirteenth Conference on Computational Natural Language Learning. 147--155.","DOI":"10.3115\/1596374.1596399","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-34","unstructured":"Erik F. Tjong Kim Sang and Fien De Meulder. 2003. Introduction to the CoNLL2003 Shared Task: Language-Independent Named Entity Recognition. In Proceedings of the 7th Conference on Natural Language Learning. 142--147."},{"key":"key-10.1145\/3178876.3185997-35","unstructured":"Erik F. Tjong Kim Sang and Jorn Veenstra. 1999. Representing Text Chunks. In Proceedings of the ninth Conference on European Chapter of the Association for Computational Linguistics. 173--179.","DOI":"10.3115\/977035.977059","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-36","unstructured":"Mark Steedman. 1996. Surface Structure and Interpretation. The MIT Press."},{"key":"key-10.1145\/3178876.3185997-37","unstructured":"S. S. Stevens. 1946. On the Theory of Scales of Measurement. Science 103, 2684 (1946), 677--680.","DOI":"10.1126\/science.103.2684.677","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-38","unstructured":"Jannik Str&#246;tgen, Thomas Bogel, Julian Zell, Ayser Armiti, Tran Van Canh, and Michael Gertz. 2014. Extending HeidelTime for Temporal Expressions Referring to Historic Dates. In Proceedings of the 9th International Conference on Language Resources and Evaluation. 2390--2397."},{"key":"key-10.1145\/3178876.3185997-39","unstructured":"Jannik Str&#246;tgen and Michael Gertz. 2010. HeidelTime: High Quality Rule-based Extraction and Normalization of Temporal Expressions. In Proceedings of the 5th International Workshop on Semantic Evaluation (SemEval'10). Association for Computational Linguistics, Stroudsburg, PA, USA, 321--324."},{"key":"key-10.1145\/3178876.3185997-40","unstructured":"Jannik Str&#246;tgen, Julian Zell, and Michael Gertz. 2013. HeidelTime: Tuning English and Developing Spanish Resources. In Proceedings of the Second Joint Conference on Lexical and Computational Semantics (SEM). 15--19."},{"key":"key-10.1145\/3178876.3185997-41","unstructured":"Naushad UzZaman and James F. Allen. 2010. TRIPS and TRIOS System for TempEval-2: Extracting Temporal Information from Text. In Proceedings of the 5th International Workshop on Semantic Evaluation. 276--283."},{"key":"key-10.1145\/3178876.3185997-42","unstructured":"Naushad UzZaman, Hector Llorens, Leon Derczynski, Marc Verhagen, James Allen, and James Pustejovsky. 2013. SemEval-2013 Task 1: TempEval-3: Evaluating Time Expressions, Events, and Temporal Relations. In Proceedings of the 7th International Workshop on Semantic Evaluation. 1--9."},{"key":"key-10.1145\/3178876.3185997-43","unstructured":"Marc Verhagen, Robert Gaizauskas, Frank Schilder, Mark Hepple, Graham Katz, and James Pustejovsky. 2007. SemEval-2007 Task 15: TempEval Temporal Relation Identification. In Proceedings of the 4th International Workshop on Semantic Evaluation. 75--80.","DOI":"10.3115\/1621474.1621488","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-44","unstructured":"Marc Verhagen, Inderjeet Mani, Roser Sauri, Robert Knippen, Seok Bae Jang, Jessica Littman, Anna Rumshisky, John Phillips, Inderjeet Mani, Roser Sauri, Robert Knippen, Seok Bae Jang, Jessica Littman, Anna Rumshisky, John Phillips, and James Pustejovsky. 2005. Automating Temporal Annotation with TARQI. In Proceedings of the ACL Interactive Poster and Demonstration Sessions. 81--84."},{"key":"key-10.1145\/3178876.3185997-45","unstructured":"Marc Verhagen, Roser Sauri, Tommaso Caselli, and James Pustejovsky. 2010. SemEval-2010 Task 13: TempEval-2. In Proceedings of the 5th International Workshop on Semantic Evaluation. 57--62."},{"key":"key-10.1145\/3178876.3185997-46","unstructured":"Mingbin Xu, Hui Jiang, and Sedtawut Watcharawittayakul. 2017. A Local Detection Approach for Named Entity Recognition and Mention Detection. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics. 1237--1247.","DOI":"10.18653\/v1\/P17-1114","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3185997-47","unstructured":"Xiaoshi Zhong, Aixin Sun, and Erik Cambria. 2017. Time Expression Analysis and Recognition Using Syntactic Token Types and General Heuristic Rules. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics. 420--429.","DOI":"10.18653\/v1\/P17-1039","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3185997&ftid=1957410&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T17:17:05Z","timestamp":1523639825000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":47,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3185997","relation":{"cites":[]}}}