{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:29Z","timestamp":1523998769075},"publisher-location":"New York, New York, USA","reference-count":39,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"funder":[{"name":"National Program on Key Basic Research Project","award":["2015CB352300"]},{"name":"Natural Science Foundation of China","award":["61532011","61672311"]},{"name":"National Natural Science Foundation of China Major Project","award":["U1611461"]},{"name":"National Key Basic Research Program","award":["2015CB358700"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186075","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Online Compact Convexified Factorization Machine"],"prefix":"10.1145","author":[{"given":"Xiao","family":"Lin","sequence":"first","affiliation":[{"name":"Tsignhua University, Beijing, China"}]},{"given":"Wenpeng","family":"Zhang","sequence":"additional","affiliation":[{"name":"Tsinghua University, Beijing, China"}]},{"given":"Min","family":"Zhang","sequence":"additional","affiliation":[{"name":"Tsinghua University, Beijing, China"}]},{"given":"Wenwu","family":"Zhu","sequence":"additional","affiliation":[{"name":"Tsinghua University, Beijing, China"}]},{"given":"Jian","family":"Pei","sequence":"additional","affiliation":[{"name":"Simon Fraser University, Vancouver, Canada"}]},{"given":"Peilin","family":"Zhao","sequence":"additional","affiliation":[{"name":"South China University of Technology, Shenzhen, China"}]},{"given":"Junzhou","family":"Huang","sequence":"additional","affiliation":[{"name":"Tencent AI Lab, Shenzhen, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186075-1","unstructured":"Jacob Abernethy, Elad Hazan, and Alexander Rakhlin. 2008. Competing in the dark: An efficient algorithm for bandit linear optimization. In In Proceedings of the 21st Annual Conference on Learning Theory (COLT)."},{"key":"key-10.1145\/3178876.3186075-2","unstructured":"Zeyuan Allen-Zhu, Elad Hazan, Wei Hu, and Yuanzhi Li. 2017. Linear Convergence of a Frank-Wolfe Type Algorithm over Trace-Norm Balls. CoRR abs\/1708.02105 (2017)."},{"key":"key-10.1145\/3178876.3186075-3","unstructured":"Mathieu Blondel, Akinori Fujino, and Naonori Ueda. 2015. Convex factorization machines. In Joint European Conference on Machine Learning and Knowledge Discovery in Databases. Springer, 19--35.","DOI":"10.1007\/978-3-319-23525-7_2","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-4","unstructured":"Mathieu Blondel, Akinori Fujino, Naonori Ueda, and Masakazu Ishihata. 2016. Higher-order factorization machines. In Advances in Neural Information Processing Systems. 3351--3359."},{"key":"key-10.1145\/3178876.3186075-5","unstructured":"Mathieu Blondel, Masakazu Ishihata, Akinori Fujino, and Naonori Ueda. 2016. Polynomial networks and factorization machines: new insights and efficient training algorithms. international conference on machine learning (2016), 850-- 858."},{"key":"key-10.1145\/3178876.3186075-6","unstructured":"Stephen Boyd and Lieven Vandenberghe. 2004. Convex optimization. Cambridge university press.","DOI":"10.1017\/CBO9780511804441","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-7","unstructured":"N. Cesa-Bianchi, A. Conconi, and C. Gentile. 2004. On the Generalization Ability of On-Line Learning Algorithms. Information Theory IEEE Transactions on 50, 9 (2004), 2050--2057.","DOI":"10.1109\/TIT.2004.833339","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-8","unstructured":"Chen Cheng, Fen Xia, Tong Zhang, Irwin King, and Michael R Lyu. 2014. Gradient boosting factorization machines. In Proceedings of the 8th ACM Conference on Recommender systems. ACM, 265--272.","DOI":"10.1145\/2645710.2645730","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-9","unstructured":"Koby Crammer, Ofer Dekel, Joseph Keshet, Shai Shalev-Shwartz, and Yoram Singer. 2006. Online Passive-Aggressive Algorithms. J. Mach. Learn. Res. 7 (Dec. 2006), 551--585."},{"key":"key-10.1145\/3178876.3186075-10","unstructured":"Peter DeMarzo, Ilan Kremer, and Yishay Mansour. 2006. Online Trading Algorithms and Robust Option Pricing. In Proceedings of the Thirty-eighth Annual ACM Symposium on Theory of Computing (STOC '06). ACM, New York, NY, USA, 477--486.","DOI":"10.1145\/1132516.1132586","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-11","unstructured":"Mark Dredze, Koby Crammer, and Fernando Pereira. 2008. Confidence-weighted Linear Classification. In Proceedings of the 25th International Conference on Machine Learning (ICML '08). ACM, New York, NY, USA, 264--271.","DOI":"10.1145\/1390156.1390190","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-12","unstructured":"Elad Hazan et al. 2016. Introduction to online convex optimization. Foundations and Trends&#174; in Optimization 2, 3--4 (2016), 157--325."},{"key":"key-10.1145\/3178876.3186075-13","unstructured":"Elad Hazan and Satyen Kale. 2012. Projection-free Online Learning. In Proceedings of the 29th International Coference on International Conference on Machine Learning (ICML'12). Omnipress, USA, 1843--1850."},{"key":"key-10.1145\/3178876.3186075-14","unstructured":"Steven CH Hoi, Doyen Sahoo, Jing Lu, and Peilin Zhao. 2018. Online Learning: A Comprehensive Survey. arXiv preprint arXiv:1802.02871 (2018)."},{"key":"key-10.1145\/3178876.3186075-15","unstructured":"Steven C. H. Hoi, Jialei Wang, and Peilin Zhao. 2014. LIBOL: a library for online learning algorithms. JMLR. 495--499 pages."},{"key":"key-10.1145\/3178876.3186075-16","unstructured":"Martin Jaggi. 2013. Revisiting Frank-Wolfe: Projection-Free Sparse Convex Optimization. In Proceedings of the 30th International Conference on Machine Learning (Proceedings of Machine Learning Research), Sanjoy Dasgupta and David McAllester (Eds.), Vol. 28. PMLR, Atlanta, Georgia, USA, 427--435."},{"key":"key-10.1145\/3178876.3186075-17","unstructured":"Yuchin Juan, Damien Lefortier, and Olivier Chapelle. 2017. Field-aware factorization machines in a real-world online advertising system. In Proceedings of the 26th International Conference on World Wide Web Companion. International World Wide Web Conferences Steering Committee, 680--688.","DOI":"10.1145\/3041021.3054185","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-18","unstructured":"Xiangnan He Hanwang Zhang Fei Wu Tat-Seng Chua Jun Xiao, Hao Ye. 2017. Attentional Factorization Machines: Learning the Weight of Feature Interactions via Attention Networks. In Proceedings of the Twenty-Sixth International Joint Conference on Artificial Intelligence, IJCAI-17. 3119--3125."},{"key":"key-10.1145\/3178876.3186075-19","unstructured":"Takuya Kitazawa. 2016. Incremental Factorization Machines for Persistently Cold-starting Online Item Recommendation. arXiv preprint arXiv:1607.02858 (2016)."},{"key":"key-10.1145\/3178876.3186075-20","unstructured":"Chun-Ta Lu, Lifang He, Weixiang Shao, Bokai Cao, and Philip S. Yu. 2017. Multilinear Factorization Machines for Multi-Task Multi-View Learning. In Proceedings of the Tenth ACM International Conference on Web Search and Data Mining (WSDM '17). ACM, New York, NY, USA, 701--709.","DOI":"10.1145\/3018661.3018716","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-21","unstructured":"H. Brendan McMahan, Gary Holt, D. Sculley, Michael Young, Dietmar Ebner, Julian Grady, Lan Nie, Todd Phillips, Eugene Davydov, Daniel Golovin, Sharat Chikkerur, Dan Liu, Martin Wattenberg, Arnar Mar Hrafnkelsson, Tom Boulos, and Jeremy Kubica. 2013. Ad Click Prediction: a View from the Trenches. In Proceedings of the 19th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD).","DOI":"10.1145\/2487575.2488200","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-22","unstructured":"Trung V. Nguyen, Alexandros Karatzoglou, and Linas Baltrunas. 2014. Gaussian Process Factorization Machines for Context-aware Recommendations. In Proceedings of the 37th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '14). ACM, New York, NY, USA, 63--72.","DOI":"10.1145\/2600428.2609623","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-23","unstructured":"Steffen Rendle. 2010. Factorization machines. In Data Mining (ICDM), 2010 IEEE 10th International Conference on. IEEE, 995--1000.","DOI":"10.1109\/ICDM.2010.127","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-24","unstructured":"Steffen Rendle, Zeno Gantner, Christoph Freudenthaler, and Lars Schmidt-Thieme. 2011. Fast context-aware recommendations with factorization machines. In Proceedings of the 34th international ACM SIGIR conference on Research and development in Information Retrieval. ACM, 635--644.","DOI":"10.1145\/2009916.2010002","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-25","unstructured":"F Rosenblatt. 1958. The perceptron: a probabilistic model for information storage and organization in the brain. Psychological Review 65, 6 (1958), 386."},{"key":"key-10.1145\/3178876.3186075-26","unstructured":"Shai Shalev-Shwartz. 2012. Online Learning and Online Convex Optimization. Found. Trends Mach. Learn. 4, 2 (Feb. 2012), 107--194.","DOI":"10.1561\/2200000018","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-27","unstructured":"Shai Shalev-Shwartz et al. 2012. Online learning and online convex optimization. Foundations and Trends&#174; in Machine Learning 4, 2 (2012), 107--194."},{"key":"key-10.1145\/3178876.3186075-28","unstructured":"Anh-Phuong Ta. 2015. Factorization machines with follow-the-regularizedleader for CTR prediction in display advertising. In Big Data (Big Data), 2015 IEEE International Conference on. IEEE, 2889--2891."},{"key":"key-10.1145\/3178876.3186075-29","unstructured":"Jialei Wang, Steven C.H. Hoi, Peilin Zhao, and Zhi-Yong Liu. 2013. Online Multitask Collaborative Filtering for On-the-fly Recommender Systems. In Proceedings of the 7th ACM Conference on Recommender Systems (RecSys '13). ACM, New York, NY, USA, 237--244. https:\/\/doi.org\/10.1145\/2507157.2507176","DOI":"10.1145\/2507157.2507176","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-30","unstructured":"Jialei Wang, Peilin Zhao, and Steven C. H. Hoi. 2016. Soft Confidence-Weighted Learning. ACM Trans. Intell. Syst. Technol. 8, 1, Article 15 (Sept. 2016), 32 pages."},{"key":"key-10.1145\/3178876.3186075-31","unstructured":"Jianpeng Xu, Kaixiang Lin, Pang Ning Tan, and Jiayu Zhou. 2016. Synergies that Matter: Efficient Interaction Selection via Sparse Factorization Machine. In Siam International Conference on Data Mining. 108--116.","DOI":"10.1137\/1.9781611974348.13","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-32","unstructured":"Makoto Yamada, Wenzhao Lian, Amit Goyal, Jianhui Chen, Kishan Wimalawarne, Suleiman A Khan, Samuel Kaski, Hiroshi Mamitsuka, and Yi Chang. 2015. Convex Factorization Machine for Regression. arXiv preprint arXiv:1507.01073 (2015)."},{"key":"key-10.1145\/3178876.3186075-33","unstructured":"Makoto Yamada, Wenzhao Lian, Amit Goyal, Jianhui Chen, Kishan Wimalawarne, Suleiman A. Khan, Samuel Kaski, Hiroshi Mamitsuka, and Yi Chang. 2017. Convex Factorization Machine for Toxicogenomics Prediction. In Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '17). ACM, New York, NY, USA, 1215--1224.","DOI":"10.1145\/3097983.3098103","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-34","unstructured":"Fajie Yuan, Guibing Guo, Joemon M. Jose, Long Chen, Haitao Yu, and Weinan Zhang. 2017. BoostFM: Boosted Factorization Machines for Top-N Featurebased Recommendation. In Proceedings of the 22Nd International Conference on Intelligent User Interfaces (IUI '17). ACM, New York, NY, USA, 45--54.","DOI":"10.1145\/3025171.3025211","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-35","unstructured":"Wenpeng Zhang, Peilin Zhao, Wenwu Zhu, Steven C. H. Hoi, and Tong Zhang. 2017. Projection-free Distributed Online Learning in Networks. In Proceedings of the 34th International Conference on Machine Learning (Proceedings of Machine Learning Research), Doina Precup and Yee Whye Teh (Eds.), Vol. 70. PMLR, International Convention Centre, Sydney, Australia, 4054--4062."},{"key":"key-10.1145\/3178876.3186075-36","unstructured":"Peilin Zhao and Steven C.H. Hoi. 2013. Cost-sensitive Online Active Learning with Application to Malicious URL Detection. In Proceedings of the 19th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '13). ACM, New York, NY, USA, 919--927.","DOI":"10.1145\/2487575.2487647","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-37","unstructured":"Peilin Zhao, Steven C. H. Hoi, Rong Jin, and Tianbao Yang. 2011. Online AUC Maximization. In Proceedings of the 28th International Conference on International Conference on Machine Learning (ICML'11). Omnipress, USA, 233--240."},{"key":"key-10.1145\/3178876.3186075-38","unstructured":"Erheng Zhong, Yue Shi, Nathan Liu, and Suju Rajan. 2016. Scaling Factorization Machines with Parameter Server. In Proceedings of the 25th ACM International on Conference on Information and Knowledge Management. ACM, 1583--1592.","DOI":"10.1145\/2983323.2983364","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186075-39","unstructured":"Martin Zinkevich. 2003. Online Convex Programming and Generalized Infinitesimal Gradient Ascent. In Proceedings of the Twentieth International Conference on International Conference on Machine Learning (ICML'03). AAAI Press, 928--935."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186075&ftid=1957397&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T18:15:44Z","timestamp":1523643344000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":39,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186075","relation":{"cites":[]}}}