{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:24Z","timestamp":1525103724254},"publisher-location":"New York, New York, USA","reference-count":22,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3191535","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["A Factoid Question Answering System for Vietnamese"],"prefix":"10.1145","author":[{"given":"Phuong","family":"Le-Hong","sequence":"first","affiliation":[{"name":"Hanoi University of Science & FPT University, Hanoi, Vietnam"}]},{"given":"Duc-Thien","family":"Bui","sequence":"additional","affiliation":[{"name":"FPT University, Hanoi, Vietnam"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3191535-1","unstructured":"Kurt Bollacker, Colin Evans, Praveen Paritosh, Tim Sturge, and Jamie Taylor. 2008. Freebase: a collaborative created graph database for structuring human knowledge. In Proceedings of the 2008 ACM SIGMOD International Conference on Management of Data. 1247--1250.","DOI":"10.1145\/1376616.1376746","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-2","unstructured":"Antoine Bordes, Sumit Chopra, and Jason Weston. 2014. Question Answering with Subgraph Embeddings. In Proceedings of EMNLP. Doha, Qatar, 615--620.","DOI":"10.3115\/v1\/D14-1067","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-3","unstructured":"Antoine Bordes, Jason Weston, and Nicolas Usunier. 2014. Open question answering with weakly supervised embedding models. In Machine Learning and Knowledge Discovery in Databases. Lecture Notes in Computer Science, Vol. 8724. Springer Berlin Heidelberg, 165--180.","DOI":"10.1007\/978-3-662-44848-9_11","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-4","unstructured":"Hang Cui, Renxu Sun, Keya Li, Min-Yen Kan, and Tat-Seng Chua. 2005. Question answering passage retrieval using dependency relations. In Proceedings of ACM SIGIR. Salvador, Brazil, 400--407.","DOI":"10.1145\/1076034.1076103","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-5","unstructured":"Huu-Thanh Duong and Bao-Quoc Ho. 2014. A Vietnamese Question Answering System in Vietnam's Legal Documents. In Proceedings of the 13th IFIP TC8 International Conference, CISIM. Ho Chi Minh City, Vietnam, 186--197.","DOI":"10.1007\/978-3-662-45237-0_19","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-6","unstructured":"Zhiheng Huang, Marcus Thint, and Zengchang Qin. 2008. Question Classification using Head Words and their Hypernyms. In Proceedings of the 2008 Conference on EMNLP. 927--936.","DOI":"10.3115\/1613715.1613835","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-7","unstructured":"Phuong Le-Hong. 2016. Vietnamese named entity recognition using token regular expressions and bidirectional inference. In arXiv preprint arXiv:1610.05652."},{"key":"key-10.1145\/3184558.3191535-8","unstructured":"Phuong Le-Hong, Thi-Minh-Huyen Nguyen, Thi-Luong Nguyen, and My-Linh Ha. 2015. Fast Dependency Parsing using Distributed Word Representations. In Trends and Applications in Knowledge Discovery and Data Mining. Lecture Notes in Artificial Intelligence, Vol. 9441. Springer.","DOI":"10.1007\/978-3-319-25660-3_22","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-9","unstructured":"Phuong Le-Hong, Thi Minh Huyen Nguyen, Azim Roussanaly, and Tuong Vinh Ho. 2008. A Hybrid Approach to Word Segmentation of Vietnamese Texts. In Language and Automata Theory and Applications. Lecture Notes in Computer Science, Vol. 5196. Springer Berlin Heidelberg, 240--249.","DOI":"10.1007\/978-3-540-88282-4_23","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-10","unstructured":"Phuong Le-Hong, Azim Roussanaly, and Thi-Minh-Huyen Nguyen. 2015. A syntactic component for Vietnamese language processing. Journal of Language Modelling 3, 1 (2015), 145--184.","DOI":"10.15398\/jlm.v3i1.89","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-11","unstructured":"Phuong Le-Hong, Azim Roussanaly, Thi Minh Huyen Nguyen, and Mathias Rossignol. 2010. An empirical study of maximum entropy approach for partof-speech tagging of Vietnamese texts. In Actes de Traitement Automatique des Langues. Montreal, Canada, 50--61."},{"key":"key-10.1145\/3184558.3191535-12","unstructured":"Phuong Le-Hong, Phan Xuan-Hieu, and Nguyen Tien-Dung. 2014. Using Dependency Analysis to Improve Question Classification. In Knowledge and Systems Engineering. Advances in Intelligent Systems and Computing, Vol. 326. Springer, 653--665."},{"key":"key-10.1145\/3184558.3191535-13","unstructured":"Jens Lehmann, Robert Isele, Max Jakob, Anja Jentzsch, Dimitris Kontokostas, Pablo Mendes, Sebastian Hellmann, Mohamed Morsey, Patrick van Kleef, S&#246;ren Auer, and Chris Bizer. 2015. DBpedia - A Large-scale, Multilingual Knowledge Base Extracted from Wikipedia. Semantic Web 6, 2 (2015), 167--195."},{"key":"key-10.1145\/3184558.3191535-14","unstructured":"Xin Li and Dan Roth. 2006. Learning Question Classifiers: the Role of Semantic Information. Natural Language Engineering 12, 3 (2006), 229--249.","DOI":"10.1017\/S1351324905003955","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-15","unstructured":"Christophe D. Manning. 2011. Part-of-Speech Tagging from 97% to 100%: Is It Time for Some Linguistics In Computational Linguistics and Intelligent Text Processing. Theoretical Computer Science and General Issues, Vol. 6608. SpringerVerlag Berlin Heidelberg, 171--189.","DOI":"10.1007\/978-3-642-19400-9_14","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-16","unstructured":"Mohamed Morsey, Jens Lehmann, S&#246;ren Auer, Claus Stadler, and Sebastian Hellmann. 2012. DBpedia and the live extraction of structured data from Wikipedia. Program: electronic library and information systems 46, 2 (2012), 157--181.","DOI":"10.1108\/00330331211221828","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-17","unstructured":"Dat Quoc Nguyen, Dai Quoc Nguyen, and Bao Son Pham. 2017. Ripple Down Rules for Question Answering. Semantic Web 8, 4 (2017), 511--532.","DOI":"10.3233\/SW-150204","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3191535-18","unstructured":"Thai-Hoang Pham, Xuan-Khoai Pham, and Phuong Le-Hong. 2015. Building a Semantic Role Labelling System for Vietnamese. In Proceedings of the 10th International Conference on Digital Information Management. IEEE, Jeju Islands, South Korea, 77--84."},{"key":"key-10.1145\/3184558.3191535-19","unstructured":"Thai-Hoang Pham, Xuan-Khoai Pham, Tuan-Anh Nguyen, and Phuong LeHong. 2017. NNVLP: A Neural Network-Based Vietnamese Language Processing Toolkit. In Proceedings of IJCNLP, Demonstration papers. Taipei, Taiwan."},{"key":"key-10.1145\/3184558.3191535-20","unstructured":"Ian Robinson, Jim Webber, and Emil Eifrem. 2015. Graph Databases: New Opportunities for Connected Data (2nd ed.). O'Reilly Media."},{"key":"key-10.1145\/3184558.3191535-21","unstructured":"Mai-Vu Tran, Duc-Trong Le, Xuan-Tu Tran, and Tien-Tung Nguyen. 2012. A Model for Vietnamese Person Named Entity. In Proceedings of the 26th Pacific Asia Conference on Language, Information and Computation. Bali, Indonesia, 325-- 332."},{"key":"key-10.1145\/3184558.3191535-22","unstructured":"Mai-Vu Tran, Vinh Duc Nguyen, Oanh Thi Tran, Uyen Thi Thu Pham, and Thuy Quang Ha. 2009. An Experiment Study of Vietnamese Question Answering System. In Proceedings of the 2009 International Conference on Asian Language Processing. Singapore, 152--155.","DOI":"10.1109\/IALP.2009.39","doi-asserted-by":"crossref"}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3191535&ftid=1958273&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T20:07:30Z","timestamp":1524082050000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":22,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3191535","relation":{"cites":[]}}}