{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:29Z","timestamp":1523998769080},"publisher-location":"New York, New York, USA","reference-count":37,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,10]],"date-time":"2018-04-10T00:00:00Z","timestamp":1523318400000},"delay-in-days":99,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186083","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["Conversational Query Understanding Using Sequence to Sequence Modeling"],"prefix":"10.1145","author":[{"given":"Gary","family":"Ren","sequence":"first","affiliation":[{"name":"Microsoft Bing Core Relevance, Sunnyvale, CA, USA"}]},{"given":"Xiaochuan","family":"Ni","sequence":"additional","affiliation":[{"name":"Microsoft Bing Core Relevance, Sunnyvale, CA, USA"}]},{"given":"Manish","family":"Malik","sequence":"additional","affiliation":[{"name":"Microsoft Bing Core Relevance, Sunnyvale, CA, USA"}]},{"given":"Qifa","family":"Ke","sequence":"additional","affiliation":[{"name":"Microsoft Bing Core Relevance, Sunnyvale, CA, USA"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186083-1","unstructured":"Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2014. Neural machine translation by jointly learning to align and translate. arXiv preprint arXiv:1409.0473 (2014)."},{"key":"key-10.1145\/3178876.3186083-2","unstructured":"Rafael E Banchs. 2012. Movie-DiC: a movie dialogue corpus for research and development. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Short Papers-Volume 2. Association for Computational Linguistics, 203--207."},{"key":"key-10.1145\/3178876.3186083-3","unstructured":"Ziv Bar-Yossef and Naama Kraus. 2011. Context-sensitive query auto-completion. In Proceedings of the 20th international conference on World wide web. ACM, 107--116.","DOI":"10.1145\/1963405.1963424","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-4","unstructured":"Yoshua Bengio. 2012. Practical recommendations for gradient-based training of deep architectures. In Neural networks: Tricks of the trade. Springer, 437--478.","DOI":"10.1007\/978-3-642-35289-8_26","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-5","unstructured":"Huanhuan Cao, Daxin Jiang, Jian Pei, Enhong Chen, and Hang Li. 2009. Towards context-aware search by learning a very large variable length hidden markov model from search logs. In Proceedings of the 18th international conference on World wide web. ACM, 191--200.","DOI":"10.1145\/1526709.1526736","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-6","unstructured":"Huanhuan Cao, Daxin Jiang, Jian Pei, Qi He, Zhen Liao, Enhong Chen, and Hang Li. 2008. Context-aware query suggestion by mining click-through and session data. In Proceedings of the 14th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 875--883.","DOI":"10.1145\/1401890.1401995","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-7","unstructured":"Kyunghyun Cho, Bart Van Merri&#235;nboer, Dzmitry Bahdanau, and Yoshua Bengio. 2014. On the properties of neural machine translation: Encoder-decoder approaches. arXiv preprint arXiv:1409.1259 (2014)."},{"key":"key-10.1145\/3178876.3186083-8","unstructured":"Kyunghyun Cho, Bart Van Merri&#235;nboer, Caglar Gulcehre, Dzmitry Bahdanau, Fethi Bougares, Holger Schwenk, and Yoshua Bengio. 2014. Learning phrase representations using RNN encoder-decoder for statistical machine translation. arXiv preprint arXiv:1406.1078 (2014)."},{"key":"key-10.1145\/3178876.3186083-9","unstructured":"Junyoung Chung, Caglar Gulcehre, KyungHyun Cho, and Yoshua Bengio. 2014. Empirical evaluation of gated recurrent neural networks on sequence modeling. arXiv preprint arXiv:1412.3555 (2014)."},{"key":"key-10.1145\/3178876.3186083-10","unstructured":"Kevin Clark and Christopher D Manning. 2016. Deep reinforcement learning for mention-ranking coreference models. arXiv preprint arXiv:1609.08667 (2016)."},{"key":"key-10.1145\/3178876.3186083-11","unstructured":"Cristian Danescu-Niculescu-Mizil, Lillian Lee, Bo Pang, and Jon Kleinberg. 2012. Echoes of power: Language effects and power differences in social interaction. In Proceedings of the 21st international conference on World Wide Web. ACM, 699--708.","DOI":"10.1145\/2187836.2187931","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-12","unstructured":"Mostafa Dehghani, Sascha Rothe, Enrique Alfonseca, and Pascal Fleury. 2017. Learning to attend, copy, and generate for session-based query suggestion. arXiv preprint arXiv:1708.03418 (2017)."},{"key":"key-10.1145\/3178876.3186083-13","unstructured":"Bhuwan Dhingra, Lihong Li, Xiujun Li, Jianfeng Gao, Yun-Nung Chen, Faisal Ahmed, and Li Deng. 2017. Towards end-to-end reinforcement learning of dialogue agents for information access. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), Vol. 1. 484--495.","DOI":"10.18653\/v1\/P17-1045","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-14","unstructured":"John W Du Bois, Wallace L Chafe, Charles Meyer, Sandra A Thompson, and Nii Martey. 2000. Santa Barbara Corpus of Spoken American English. CD-ROM. Philadelphia: Linguistic Data Consortium (2000)."},{"key":"key-10.1145\/3178876.3186083-15","unstructured":"Mihajlo Grbovic, Nemanja Djuric, Vladan Radosavljevic, Fabrizio Silvestri, and Narayan Bhamidipati. 2015. Context-and content-aware embeddings for query rewriting in sponsored search. In Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval. ACM, 383--392.","DOI":"10.1145\/2766462.2767709","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-16","unstructured":"Caglar Gulcehre, Sungjin Ahn, Ramesh Nallapati, Bowen Zhou, and Yoshua Bengio. 2016. Pointing the unknown words. arXiv preprint arXiv:1603.08148 (2016)."},{"key":"key-10.1145\/3178876.3186083-17","unstructured":"Yunlong He, Jiliang Tang, Hua Ouyang, Changsung Kang, Dawei Yin, and Yi Chang. 2016. Learning to Rewrite Queries. In Proceedings of the 25th ACM International on Conference on Information and Knowledge Management. ACM, 1443--1452.","DOI":"10.1145\/2983323.2983835","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-18","unstructured":"Sepp Hochreiter and J&#252;rgen Schmidhuber. 1997. Long short-term memory. Neural computation 9, 8 (1997), 1735--1780.","DOI":"10.1162\/neco.1997.9.8.1735","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-19","unstructured":"Seokhwan Kim, Luis Fernando Daro, Rafael E Banchs, Jason D Williams, and Matthew Henderson. 2017. The fourth dialog state tracking challenge. In Dialogues with Social Robots. Springer, 435--449."},{"key":"key-10.1145\/3178876.3186083-20","unstructured":"Liangda Li, Hongbo Deng, Jianhui Chen, and Yi Chang. 2017. Learning parametric models for context-aware query auto-completion via hawkes processes. In Proceedings of the Tenth ACM International Conference on Web Search and Data Mining. ACM, 131--139.","DOI":"10.1145\/3018661.3018698","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-21","unstructured":"Liangda Li, Hongbo Deng, Anlei Dong, Yi Chang, Ricardo Baeza-Yates, and Hongyuan Zha. 2017. Exploring Query Auto-Completion and Click Logs for Contextual-Aware Web Search and Query Suggestion. In Proceedings of the 26th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 539--548.","DOI":"10.1145\/3038912.3052593","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-22","unstructured":"Ryan Lowe, Nissan Pow, Iulian Serban, and Joelle Pineau. 2015. The ubuntu dialogue corpus: A large dataset for research in unstructured multi-turn dialogue systems. arXiv preprint arXiv:1506.08909 (2015)."},{"key":"key-10.1145\/3178876.3186083-23","unstructured":"Minh-Thang Luong, Hieu Pham, and Christopher D Manning. 2015. Effective approaches to attention-based neural machine translation. arXiv preprint arXiv:1508.04025 (2015)."},{"key":"key-10.1145\/3178876.3186083-24","unstructured":"Christopher D Manning, Mihai Surdeanu, John Bauer, Jenny Rose Finkel, Steven Bethard, and David McClosky. 2014. The stanford corenlp natural language processing toolkit.. In ACL (System Demonstrations). 55--60."},{"key":"key-10.1145\/3178876.3186083-25","unstructured":"Kishore Papineni, Salim Roukos, Todd Ward, and Wei-Jing Zhu. 2002. BLEU: a method for automatic evaluation of machine translation. In Proceedings of the 40th annual meeting on association for computational linguistics. Association for Computational Linguistics, 311--318."},{"key":"key-10.1145\/3178876.3186083-26","unstructured":"Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532--1543.","DOI":"10.3115\/v1\/D14-1162","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-27","unstructured":"Aaditya Prakash, Sadid A Hasan, Kathy Lee, Vivek Datla, Ashequl Qadir, Joey Liu, and Oladimeji Farri. 2016. Neural Paraphrase Generation with Stacked Residual LSTM Networks. arXiv preprint arXiv:1610.03098 (2016)."},{"key":"key-10.1145\/3178876.3186083-28","unstructured":"Gil Press. 2017. AI By The Numbers: 33 Facts And Forecasts About Chatbots And Voice Assistants. (2017). Retrieved October 23, 2017 from https:\/\/www.forbes.com\/sites\/gilpress\/2017\/05\/15\/ ai-by-the-numbers-33-facts-and-forecasts-about-chatbots-and-voice-assistants"},{"key":"key-10.1145\/3178876.3186083-29","unstructured":"Jonathan Raiman and John Miller. 2017. Globally normalized reader. arXiv preprint arXiv:1709.02828 (2017)."},{"key":"key-10.1145\/3178876.3186083-30","unstructured":"Xuehua Shen, Bin Tan, and ChengXiang Zhai. 2005. Context-sensitive information retrieval using implicit feedback. In Proceedings of the 28th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 43--50.","DOI":"10.1145\/1076034.1076045","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-31","unstructured":"Satinder P Singh, Michael J Kearns, Diane J Litman, and Marilyn A Walker. 2000. Reinforcement learning for spoken dialogue systems. In Advances in Neural Information Processing Systems. 956--962."},{"key":"key-10.1145\/3178876.3186083-32","unstructured":"Alessandro Sordoni, Yoshua Bengio, Hossein Vahabi, Christina Lioma, Jakob Grue Simonsen, and Jian-Yun Nie. 2015. A hierarchical recurrent encoder-decoder for generative context-aware query suggestion. In Proceedings of the 24th ACM International on Conference on Information and Knowledge Management. ACM, 553--562.","DOI":"10.1145\/2806416.2806493","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-33","unstructured":"Alessandro Sordoni, Michel Galley, Michael Auli, Chris Brockett, Yangfeng Ji, Margaret Mitchell, Jian-Yun Nie, Jianfeng Gao, and Bill Dolan. 2015. A neural network approach to context-sensitive generation of conversational responses. arXiv preprint arXiv:1506.06714 (2015)."},{"key":"key-10.1145\/3178876.3186083-34","unstructured":"Aixin Sun and Chii-Hian Lou. 2014. Towards context-aware search with right click. In Proceedings of the 37th international ACM SIGIR conference on Research &#38; development in information retrieval. ACM, 847--850.","DOI":"10.1145\/2600428.2609456","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186083-35","unstructured":"Ilya Sutskever, Oriol Vinyals, and Quoc V Le. 2014. Sequence to sequence learning with neural networks. In Advances in neural information processing systems. 3104-- 3112."},{"key":"key-10.1145\/3178876.3186083-36","unstructured":"Oriol Vinyals, &#321;ukasz Kaiser, Terry Koo, Slav Petrov, Ilya Sutskever, and Geoffrey Hinton. 2015. Grammar as a foreign language. In Advances in Neural Information Processing Systems. 2773--2781."},{"key":"key-10.1145\/3178876.3186083-37","unstructured":"Zhiguo Wang, Wael Hamza, and Radu Florian. 2017. Bilateral multi-perspective matching for natural language sentences. arXiv preprint arXiv:1702.03814 (2017)."}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186083&ftid=1957364&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T18:20:23Z","timestamp":1523643623000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":37,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186083","relation":{"cites":[]}}}