{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,30]],"date-time":"2018-04-30T15:55:19Z","timestamp":1525103719989},"publisher-location":"New York, New York, USA","reference-count":36,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3184558.3186578","type":"proceedings-article","created":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T18:04:25Z","timestamp":1524074665000},"source":"Crossref","is-referenced-by-count":0,"title":["Privacy Preserving Distributed Analysis of Social Networks"],"prefix":"10.1145","author":[{"given":"Varsha Bhat","family":"Kukkala","sequence":"first","affiliation":[{"name":"Indian Institute of Technology Ropar, Rupnagar, Punjab, India"}]}],"member":"320","reference":[{"key":"key-10.1145\/3184558.3186578-1","unstructured":"Abdelrahaman Aly, Edouard Cuvelier, Sophie Mawet, Olivier Pereira, and Mathieu Van Vyve. 2013. Securely solving simple combinatorial graph problems International Conference on Financial Cryptography and Data Security. Springer, 239--257."},{"key":"key-10.1145\/3184558.3186578-2","unstructured":"Abdelrahaman Aly and Mathieu Van Vyve. 2014. Securely solving classical network flow problems. In International Conference on Information Security and Cryptology. Springer, 205--221."},{"key":"key-10.1145\/3184558.3186578-3","unstructured":"Gilad Asharov and Yehuda Lindell. 2017. A full proof of the BGW protocol for perfectly secure multiparty computation. Journal of Cryptology (2017), 58--151.","DOI":"10.1007\/s00145-015-9214-4","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-4","unstructured":"Mikhail Atallah, Marina Bykova, Jiangtao Li, Keith Frikken, and Mercan Topkara. 2004. Private collaborative forecasting and benchmarking Proceedings of the 2004 ACM workshop on Privacy in the electronic society. ACM, 103--114."},{"key":"key-10.1145\/3184558.3186578-5","unstructured":"Vladimir Batagelj and Matjaz Zaversnik. 2003. An O (m) algorithm for cores decomposition of networks. arXiv preprint cs\/0310049 (2003)."},{"key":"key-10.1145\/3184558.3186578-6","unstructured":"Peter S Bearman, James Moody, and Katherine Stovel. 2004. Chains of affection: The structure of adolescent romantic and sexual networks 1. American journal of sociology Vol. 110, 1 (2004), 44--91."},{"key":"key-10.1145\/3184558.3186578-7","unstructured":"Michael Ben-Or, Shafi Goldwasser, and Avi Wigderson. 1988. Completeness theorems for non-cryptographic fault-tolerant distributed computation. In Proceedings of the twentieth annual ACM symposium on Theory of computing. ACM, 1--10.","DOI":"10.1145\/62212.62213","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-8","unstructured":"Marina Blanton, Aaron Steele, and Mehrdad Alisagari. 2013. Data-oblivious graph algorithms for secure computation and outsourcing Proceedings of the 8th ACM SIGSAC symposium on Information, computer and communications security. ACM, 207--218."},{"key":"key-10.1145\/3184558.3186578-9","unstructured":"Peter Bogetoft, Ivan Damg&#229;rd, Thomas Jakobsen, Kurt Nielsen, Jakob Pagter, and Tomas Toft. 2006. A practical implementation of secure auctions based on multiparty integer computation. In International Conference on Financial Cryptography and Data Security. Springer, 142--147.","DOI":"10.1007\/11889663_10","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-10","unstructured":"Justin Brickell and Vitaly Shmatikov. 2005. Privacy-preserving graph algorithms in the semi-honest model International Conference on the Theory and Application of Cryptology and Information Security. Springer, 236--252."},{"key":"key-10.1145\/3184558.3186578-11","unstructured":"David Chaum, Claude Cr&#233;peau, and Ivan Damgard. 1988. Multiparty unconditionally secure protocols. In Proceedings of the twentieth annual ACM symposium on Theory of computing. ACM, 11--19.","DOI":"10.1145\/62212.62214","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-12","unstructured":"Lin Chen and Richi Nayak. 2011. Social network analysis of an online dating network Proceedings of the 5th International Conference on Communities and Technologies. ACM, 41--49."},{"key":"key-10.1145\/3184558.3186578-13","unstructured":"Thomas Y Choi and Yunsook Hong. 2002. Unveiling the structure of supply networks: case studies in Honda, Acura, and DaimlerChrysler. Journal of Operations Management Vol. 20, 5 (2002), 469--493.","DOI":"10.1016\/S0272-6963(02)00025-6","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-14","unstructured":"Rob Cross, Nitin Nohria, and Andrew Parker. 2002. Six myths about informal networks-and how to overcome them. MIT Sloan Management Review Vol. 43, 3 (2002), 67."},{"key":"key-10.1145\/3184558.3186578-15","unstructured":"Ivan Damg&#229;rd, Matthias Fitzi, Eike Kiltz, Jesper Buus Nielsen, and Tomas Toft. 2006. Unconditionally secure constant-rounds multi-party computation for equality, comparison, bits and exponentiation. In Theory of Cryptography Conference. Springer, 285--304.","DOI":"10.1007\/11681878_15","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-16","unstructured":"Ivan Damgard and Jesper Buus Nielsen. 2003. Universally composable efficient multiparty computation from threshold homomorphic encryption. In Annual International Cryptology Conference. Springer, 247--264.","DOI":"10.1007\/978-3-540-45146-4_15","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-17","unstructured":"Gilbert Fridgen and Tirazheh Zare Garizy. 2015. Supply Chain Network Risk Analysis-A Privacy Preserving Approach. ECIS."},{"key":"key-10.1145\/3184558.3186578-18","unstructured":"David F Gleich. 2015. PageRank beyond the Web. SIAM Rev. Vol. 57, 3 (2015), 321--363."},{"key":"key-10.1145\/3184558.3186578-19","unstructured":"Oded Goldreich, Silvio Micali, and Avi Wigderson. 1987. How to play any mental game. In Proceedings of the nineteenth annual ACM symposium on Theory of computing. ACM, 218--229.","DOI":"10.1145\/28395.28420","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-20","unstructured":"S Dov Gordon, Jonathan Katz, Vladimir Kolesnikov, Fernando Krell, Tal Malkin, Mariana Raykova, and Yevgeniy Vahlis. 2012. Secure two-party computation in sublinear (amortized) time Proceedings of the 2012 ACM conference on Computer and communications security. ACM, 513--524."},{"key":"key-10.1145\/3184558.3186578-21","unstructured":"Florian Kerschbaum and Andreas Schaad. 2008. Privacy-preserving social network analysis for criminal investigations Proceedings of the 7th ACM workshop on Privacy in the electronic society. ACM, 9--14."},{"key":"key-10.1145\/3184558.3186578-22","unstructured":"Yusoon Kim, Thomas Y Choi, Tingting Yan, and Kevin Dooley. 2011. Structural investigation of supply networks: A social network analysis approach. Journal of Operations Management Vol. 29, 3 (2011), 194--211.","DOI":"10.1016\/j.jom.2010.11.001","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-23","unstructured":"David Krackhardt and Jeffrey R Hanson. 2001. 16 Informal Networks: The Company Behind the Chart. Creative Management (2001), 202."},{"key":"key-10.1145\/3184558.3186578-24","unstructured":"David Krackhardt and Robert N Stern. 1988. Informal networks and organizational crises: An experimental simulation. Social psychology quarterly (1988), 123--140.","DOI":"10.2307\/2786835","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-25","unstructured":"Varsha Bhat Kukkala and S. R. S. Iyengar. 2017. MPC meets SNA: A Privacy Preserving Analysis of Distributed Sensitive Social Networks. CoRR Vol. abs\/1705.06929 (2017). http:\/\/arxiv.org\/abs\/1705.06929"},{"key":"key-10.1145\/3184558.3186578-26","unstructured":"Varsha Bhat Kukkala, Jaspal Singh Saini, and SRS Iyengar. 2016. Privacy preserving network analysis of distributed social networks. In Information Systems Security. Springer, 336--355.","DOI":"10.1007\/978-3-319-49806-5_18","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-27","unstructured":"Varsha Bhat Kukkala, Jaspal Singh Saini, and SRS Iyengar. 2017. Secure Multiparty Construction of a Distributed Social Network Proceedings of the 18th International Conference on Distributed Computing and Networking. ACM, 12."},{"key":"key-10.1145\/3184558.3186578-28","unstructured":"Yehuda Lindell and Benny Pinkas. 2009. A proof of security of Yaorq s protocol for two-party computation. Journal of Cryptology Vol. 22, 2 (2009), 161--188.","DOI":"10.1007\/s00145-008-9036-8","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-29","unstructured":"Takashi Nishide and Kazuo Ohta. 2007. Multiparty computation for interval, equality, and comparison without bit-decomposition protocol. In International Workshop on Public Key Cryptography. Springer, 343--360.","DOI":"10.1007\/978-3-540-71677-8_23","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-30","unstructured":"Luis EC Rocha, Fredrik Liljeros, and Petter Holme. 2010. Information dynamics shape the sexual networks of Internet-mediated prostitution. Proceedings of the National Academy of Sciences Vol. 107, 13 (2010), 5706--5711."},{"key":"key-10.1145\/3184558.3186578-31","unstructured":"Elaine Shi, T Chan, Emil Stefanov, and Mingfei Li. 2011. Oblivious RAM with O ((logN) 3) worst-case cost. Advances in Cryptology--ASIACRYPT 2011 (2011), 197--214."},{"key":"key-10.1145\/3184558.3186578-32","unstructured":"Tamir Tassa and Francesco Bonchi. 2014. Privacy Preserving Estimation of Social Influence. EDBT. 559--570."},{"key":"key-10.1145\/3184558.3186578-33","unstructured":"Xiao Wang, Hubert Chan, and Elaine Shi. 2015. Circuit oram: On tightness of the goldreich-ostrovsky lower bound Proceedings of the 22nd ACM SIGSAC Conference on Computer and Communications Security. ACM, 850--861.","DOI":"10.1145\/2810103.2813634","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-34","unstructured":"Barbara K Wichmann, Barbara K Wichmann, Lutz Kaufmann, and Lutz Kaufmann. 2016. Social network analysis in supply chain management research. International Journal of Physical Distribution &#38; Logistics Management Vol. 46, 8 (2016), 740--762."},{"key":"key-10.1145\/3184558.3186578-35","unstructured":"Andrew Chi-Chih Yao. 1986. How to generate and exchange secrets. In Foundations of Computer Science, 1986., 27th Annual Symposium on. IEEE, 162--167.","DOI":"10.1109\/SFCS.1986.25","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3184558.3186578-36","unstructured":"Samee Zahur, Xiao Wang, Mariana Raykova, Adri&#224; Gasc&#243;n, Jack Doerner, David Evans, and Jonathan Katz. 2016. Revisiting square-root ORAM: efficient random access in multi-party computation Security and Privacy (SP), 2016 IEEE Symposium on. IEEE, 218--234."}],"event":{"name":"Companion of the The Web Conference 2018","location":"Lyon, France","sponsor":["IW3C2, International World Wide Web Conference Committee","SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Companion of the The Web Conference 2018 on The Web Conference 2018  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186578&ftid=1958336&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,18]],"date-time":"2018-04-18T19:53:56Z","timestamp":1524081236000},"score":1.0,"subtitle":[],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356404"],"references-count":36,"URL":"http:\/\/dx.doi.org\/10.1145\/3184558.3186578","relation":{"cites":[]}}}