{"status":"ok","message-type":"work","message-version":"1.0.0","message":{"indexed":{"date-parts":[[2018,4,17]],"date-time":"2018-04-17T20:59:14Z","timestamp":1523998754824},"publisher-location":"New York, New York, USA","reference-count":47,"publisher":"ACM Press","license":[{"URL":"http:\/\/www.acm.org\/publications\/policies\/copyright_policy#Background","start":{"date-parts":[[2018,4,23]],"date-time":"2018-04-23T00:00:00Z","timestamp":1524441600000},"delay-in-days":112,"content-version":"vor"}],"funder":[{"name":"National Science Foundation of USA","award":["1442971","1334351","1528138"]},{"name":"National Natural Science Foundation of China","award":["U1630115","61332008"]}],"content-domain":{"domain":[],"crossmark-restriction":false},"short-container-title":[],"published-print":{"date-parts":[[2018]]},"DOI":"10.1145\/3178876.3186155","type":"proceedings-article","created":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T15:53:48Z","timestamp":1523634828000},"source":"Crossref","is-referenced-by-count":0,"title":["AdaError"],"prefix":"10.1145","author":[{"given":"Dongsheng","family":"Li","sequence":"first","affiliation":[{"name":"IBM Research - China, Shanghai, China"}]},{"given":"Chao","family":"Chen","sequence":"additional","affiliation":[{"name":"IBM Research - China, Shanghai, China"}]},{"given":"Qin","family":"Lv","sequence":"additional","affiliation":[{"name":"University of Colorado Boulder, Boulder, CO, USA"}]},{"given":"Hansu","family":"Gu","sequence":"additional","affiliation":[{"name":"Seagate Technology, Longmont, CO, USA"}]},{"given":"Tun","family":"Lu","sequence":"additional","affiliation":[{"name":"Fudan University, Shanghai, China"}]},{"given":"Li","family":"Shang","sequence":"additional","affiliation":[{"name":"University of Colorado Boulder, Boulder, CO, USA"}]},{"given":"Ning","family":"Gu","sequence":"additional","affiliation":[{"name":"Fudan University, Shanghai, China"}]},{"given":"Stephen M.","family":"Chu","sequence":"additional","affiliation":[{"name":"IBM Research - China, Shanghai, China"}]}],"member":"320","reference":[{"key":"key-10.1145\/3178876.3186155-1","unstructured":"Xavier Amatriain, Josep M. Pujol, and Nuria Oliver. 2009. I Like It... I Like It Not: Evaluating User Ratings Noise in Recommender Systems. In Proceedings of the 17th International Conference on User Modeling, Adaptation, and Personalization (UMAP '09). Springer, 247--258.","DOI":"10.1007\/978-3-642-02247-0_24","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-2","unstructured":"Xavier Amatriain, Josep M. Pujol, Nava Tintarev, and Nuria Oliver. 2009. Rate It Again: Increasing Recommendation Accuracy by User Re-rating. In Proceedings of the Third ACM Conference on Recommender Systems (RecSys '09). ACM, 173--180.","DOI":"10.1145\/1639714.1639744","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-3","unstructured":"Alex Beutel, Amr Ahmed, and Alexander J. Smola. 2015. ACCAMS: Additive Co-Clustering to Approximate Matrices Succinctly. In Proceedings of the 24th International Conference on World Wide Web (WWW '15). 119--129.","DOI":"10.1145\/2736277.2741091","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-4","unstructured":"Alex Beutel, Ed H. Chi, Zhiyuan Cheng, Hubert Pham, and John Anderson. 2017. Beyond Globally Optimal: Focused Learning for Improved Recommendations. In Proceedings of the 26th International Conference on World Wide Web (WWW '17). 203--212.","DOI":"10.1145\/3038912.3052713","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-5","unstructured":"Daniel Billsus and Michael J Pazzani. 1998. Learning Collaborative Information Filters.. In Proceedings of the Fifteenth International Conference on Machine Learning (ICML '98), Vol. 98. 46--54."},{"key":"key-10.1145\/3178876.3186155-6","unstructured":"Olivier Bousquet and Andr&#180;e Elisseeff. 2001. Algorithmic Stability and Generalization Performance. In Advances in Neural Information Processing Systems. 196--202."},{"key":"key-10.1145\/3178876.3186155-7","unstructured":"Emmanuel J. Cand"},{"key":"key-10.1145\/3178876.3186155-8","unstructured":"es and Yaniv Plan. 2010. Matrix Completion With Noise. Proc. IEEE 98, 6 (2010), 925--936."},{"key":"key-10.1145\/3178876.3186155-9","unstructured":"Chao Chen, Dongsheng Li, Yingying Zhao, Qin Lv, and Li Shang. 2015. WEMAREC: Accurate and Scalable Recommendation through Weighted and Ensemble Matrix Approximation. In Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval. 303--312.","DOI":"10.1145\/2766462.2767718","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-10","unstructured":"Peizhe Cheng, Shuaiqiang Wang, Jun Ma, Jiankai Sun, and Hui Xiong. 2017. Learning to Recommend Accurate and Diverse Items. In Proceedings of the 26th International Conference on World Wide Web (WWW '17). 183--192.","DOI":"10.1145\/3038912.3052585","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-11","unstructured":"Dan Cosley, Shyong K. Lam, Istvan Albert, Joseph A. Konstan, and John Riedl. 2003. Is Seeing Believing?: How Recommender System Interfaces Affect Users? Opinions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, 585--592.","DOI":"10.1145\/642611.642713","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-12","unstructured":"Jeffrey Dean, Greg Corrado, Rajat Monga, Kai Chen, Matthieu Devin, Mark Mao, Andrew Senior, Paul Tucker, Ke Yang, Quoc V Le, et al. 2012. Large scale distributed deep networks. In Advances in neural information processing systems. 1223--1231."},{"key":"key-10.1145\/3178876.3186155-13","unstructured":"John Duchi, Elad Hazan, and Yoram Singer. 2011. Adaptive subgradient methods for online learning and stochastic optimization. Journal of Machine Learning Research 12, Jul (2011), 2121--2159."},{"key":"key-10.1145\/3178876.3186155-14","unstructured":"Moritz Hardt, Benjamin Recht, and Yoram Singer. 2016. Train Faster, Generalize Better: Stability of Stochastic Gradient Descent. In Proceedings of the 33rd International Conference on International Conference on Machine Learning (ICML'16). JMLR.org, 1225--1234."},{"key":"key-10.1145\/3178876.3186155-15","unstructured":"Elad Hazan and Satyen Kale. 2014. Beyond the regret minimization barrier: optimal algorithms for stochastic strongly-convex optimization. Journal of Machine Learning Research 15, 1 (2014), 2489--2512."},{"key":"key-10.1145\/3178876.3186155-16","unstructured":"Liang Hu, Jian Cao, Guandong Xu, Longbing Cao, Zhiping Gu, and Can Zhu. 2013. Personalized Recommendation via Crossdomain Triadic Factorization. In Proceedings of the 22Nd International Conference on World Wide Web (WWW '13). ACM, 595--606."},{"key":"key-10.1145\/3178876.3186155-17","unstructured":"Yifan Hu, Yehuda Koren, and Chris Volinsky. 2008. Collaborative Filtering for Implicit Feedback Datasets. In Proceedings of the Eighth IEEE International Conference on Data Mining (ICDM '08). 263--272.","DOI":"10.1109\/ICDM.2008.22","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-18","unstructured":"Robert A Jacobs. 1988. Increased rates of convergence through learning rate adaptation. Neural networks 1, 4 (1988), 295--307.","DOI":"10.1016\/0893-6080(88)90003-2","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-19","unstructured":"Nicolas Jones, Armelle Brun, and Anne Boyer. 2011. Comparisons Instead of Ratings: Towards More Stable Preferences. In Proceedings of the 2011 IEEE\/WIC\/ACM International Conferences on Web Intel ligence and Intel ligent Agent Technology (WI-IAT '11). IEEE, 451--456."},{"key":"key-10.1145\/3178876.3186155-20","unstructured":"Santosh Kabbur, Xia Ning, and George Karypis. 2013. FISM: Factored Item Similarity Models for top-N Recommender Systems. In Proceedings of the 19th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '13). ACM, 659--667.","DOI":"10.1145\/2487575.2487589","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-21","unstructured":"Diederik Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 (2014)."},{"key":"key-10.1145\/3178876.3186155-22","unstructured":"Yehuda Koren. 2008. Factorization Meets the Neighborhood: A Multifaceted Collaborative Filtering Model. In Proceedings of the 14th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '08). ACM, 426--434.","DOI":"10.1145\/1401890.1401944","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-23","unstructured":"Yehuda Koren, Robert Bell, and Chris Volinsky. 2009. Matrix factorization techniques for recommender systems. Computer 42, 8 (2009), 30--37.","DOI":"10.1109\/MC.2009.263","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-24","unstructured":"Balaji Lakshminarayanan, Guillaume Bouchard, and Cedric Archambeau. 2011. Robust Bayesian matrix factorisation. In Proceedings of the International Conference on Artificial Intel ligence and Statistics (AISTATS). 425--433."},{"key":"key-10.1145\/3178876.3186155-25","unstructured":"Joonseok Lee, Seungyeon Kim, Guy Lebanon, and Yoram Singer. 2013. Local low-rank matrix approximation. In Proceedings of The 30th International Conference on Machine Learning (ICML '13). 82--90."},{"key":"key-10.1145\/3178876.3186155-26","unstructured":"Dongsheng Li, Chao Chen, Qin Lv, Li Shang, Stephen M. Chu, and Hongyuan Zha. 2017. ERMMA: Expected Risk Minimization for Matrix Approximation-based Recommender Systems. In Proceedings of the Thirty-First AAAI Conference on Artificial Intel ligence (AAAI '17). 1403--1409."},{"key":"key-10.1145\/3178876.3186155-27","unstructured":"Dongsheng Li, Chao Chen, Qin Lv, Junchi Yan, Li Shang, and Stephen M. Chu. 2016. Low-rank matrix approximation with stability. In Proceedings of The 33rd International Conference on Machine Learning (ICML '16). 295--303."},{"key":"key-10.1145\/3178876.3186155-28","unstructured":"Lester W Mackey, Michael I Jordan, and Ameet Talwalkar. 2011. Divide-and-conquer matrix factorization. In Advances in Neural Information Processing Systems. 1134--1142."},{"key":"key-10.1145\/3178876.3186155-29","unstructured":"Bhaskar Mehta, Thomas Hofmann, and Wolfgang Nejdl. 2007. Robust Collaborative Filtering. In Proceedings of the 2007 ACM Conference on Recommender Systems (RecSys '07). ACM, 49-- 56.","DOI":"10.1145\/1297231.1297240","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-30","unstructured":"Andrew Y. Ng. 2004. Feature Selection, L1 vs. L2 Regularization, and Rotational Invariance. In Proceedings of the Twenty-first International Conference on Machine Learning (ICML '04). 78--85.","DOI":"10.1145\/1015330.1015435","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-31","unstructured":"Tien T. Nguyen, Daniel Kluver, Ting-Yu Wang, Pik-Mai Hui, Michael D. Ekstrand, Martijn C. Willemsen, and John Riedl. 2013. Rating Support Interfaces to Improve User Experience and Recommender Accuracy. In Proceedings of the 7th ACM Conference on Recommender Systems (RecSys '13). ACM, 149-- 156.","DOI":"10.1145\/2507157.2507188","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-32","unstructured":"Xia Ning and George Karypis. 2011. SLIM: Sparse Linear Methods for Top-N Recommender Systems. In Proceedings of the 2011 IEEE 11th International Conference on Data Mining (ICDM '11). 497--506.","DOI":"10.1109\/ICDM.2011.134","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-33","unstructured":"Michael O'Mahony, Neil Hurley, Nicholas Kushmerick, and Gu&#180;enol&#180;e Silvestre. 2004. Collaborative Recommendation: A Robustness Analysis. ACM Trans. Internet Technol. 4, 4 (2004), 344--377.","DOI":"10.1145\/1031114.1031116","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-34","unstructured":"Michael P. O'Mahony, Neil J. Hurley, and Gu&#180;enol&#180;e C.M. Silvestre. 2006. Detecting Noise in Recommender System Databases. In Proceedings of the 11th International Conference on Intel ligent User Interfaces (IUI '06). ACM, 109--115.","DOI":"10.1145\/1111449.1111477","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-35","unstructured":"Arkadiusz Paterek. 2007. Improving regularized singular value decomposition for collaborative filtering. In Proceedings of KDD cup and workshop, Vol. 2007. 5--8."},{"key":"key-10.1145\/3178876.3186155-36","unstructured":"Steffen Rendle and Christoph Freudenthaler. 2014. Improving Pairwise Learning for Item Recommendation from Implicit Feedback. In Proceedings of the 7th ACM International Conference on Web Search and Data Mining (WSDM '14). 273--282.","DOI":"10.1145\/2556195.2556248","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-37","unstructured":"Steffen Rendle, Christoph Freudenthaler, Zeno Gantner, and Lars Schmidt-Thieme. 2009. BPR: Bayesian personalized ranking from implicit feedback. In Proceedings of the twenty-fifth conference on uncertainty in artificial intel ligence. 452--461."},{"key":"key-10.1145\/3178876.3186155-38","unstructured":"Paul Resnick and Rahul Sami. 2007. The Influence Limiter: Provably Manipulation-resistant Recommender Systems. In Proceedings of the 2007 ACM Conference on Recommender Systems (RecSys '07). ACM, 25--32.","DOI":"10.1145\/1297231.1297236","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-39","unstructured":"Ruslan Salakhutdinov and Andriy Mnih. 2008. Bayesian Probabilistic Matrix Factorization Using Markov Chain Monte Carlo. In Proceedings of the 25th International Conference on Machine Learning (ICML '08). ACM, 880--887.","DOI":"10.1145\/1390156.1390267","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-40","unstructured":"Ruslan Salakhutdinov and Andriy Mnih. 2008. Probabilistic matrix factorization. In Advances in neural information processing systems. 1257--1264."},{"key":"key-10.1145\/3178876.3186155-41","unstructured":"Badrul Sarwar, George Karypis, Joseph Konstan, and John Riedl. 2000. Application of Dimensionality Reduction in Recommender System - A Case Study. In ACM WebKDD 2000 Workshop. ACM SIGKDD."},{"key":"key-10.1145\/3178876.3186155-42","unstructured":"Badrul Sarwar, George Karypis, Joseph Konstan, and John Riedl. 2002. Incremental Singular Value Decomposition Algorithms for Highly Scalable Recommender Systems. In Proceedings of the 5th International Conference in Computers and Information Technology."},{"key":"key-10.1145\/3178876.3186155-43","unstructured":"Madeleine Udell, Corinne Horn, Reza Zadeh, and Stephen Boyd. 2016. Generalized Low Rank Models. Foundations and Trends in Machine Learning 9, 1 (2016), 1--118.","DOI":"10.1561\/2200000055","doi-asserted-by":"crossref"},{"key":"key-10.1145\/3178876.3186155-44","unstructured":"Linli Xu, Zaiyi Chen, Qi Zhou, Enhong Chen, Nicholas Jing Yuan, and Xing Xie. 2016. Aligned Matrix Completion: Integrating Consistency and Independency in Multiple Domains. In 2016 IEEE 16th International Conference on Data Mining (ICDM). 529--538."},{"key":"key-10.1145\/3178876.3186155-45","unstructured":"Ting Yuan, Jian Cheng, Xi Zhang, Shuang Qiu, and Hanqing Lu. 2014. Recommendation by Mining Multiple User Behaviors with Group Sparsity. In Proceedings of the 28th AAAI Conference on Artificial Intel ligence (AAAI '14). 222--228."},{"key":"key-10.1145\/3178876.3186155-46","unstructured":"Matthew D Zeiler. 2012. ADADELTA: an adaptive learning rate method. arXiv preprint arXiv:1212.5701 (2012)."},{"key":"key-10.1145\/3178876.3186155-47","unstructured":"Yongfeng Zhang, Min Zhang, Yiqun Liu, Shaoping Ma, and Shi Feng. 2013. Localized Matrix Factorization for Recommendation Based on Matrix Block Diagonal Forms. In Proceedings of the 22Nd International Conference on World Wide Web (WWW '13). ACM, 1511--1520.","DOI":"10.1145\/2488388.2488520","doi-asserted-by":"crossref"}],"event":{"name":"the 2018 World Wide Web Conference","location":"Lyon, France","sponsor":["SIGWEB, ACM Special Interest Group on Hypertext, Hypermedia, and Web","IW3C2, International World Wide Web Conference Committee"],"acronym":"WWW '18","number":"2018","start":{"date-parts":[[2018,4,23]]},"end":{"date-parts":[[2018,4,27]]}},"container-title":["Proceedings of the 2018 World Wide Web Conference on World Wide Web  - WWW '18"],"original-title":[],"link":[{"URL":"http:\/\/dl.acm.org\/ft_gateway.cfm?id=3186155&ftid=1957491&dwn=1","content-type":"unspecified","content-version":"vor","intended-application":"similarity-checking"}],"deposited":{"date-parts":[[2018,4,13]],"date-time":"2018-04-13T16:53:37Z","timestamp":1523638417000},"score":1.0,"subtitle":["An Adaptive Learning Rate Method for Matrix Approximation-based Collaborative Filtering"],"short-title":[],"issued":{"date-parts":[[2018]]},"ISBN":["9781450356398"],"references-count":47,"URL":"http:\/\/dx.doi.org\/10.1145\/3178876.3186155","relation":{"cites":[]}}}